[
  {
    "message": "Does anyone have lime or lemon? I am cooking and just realized that I forgot buying lemon. If someone has, I can spend 1 dollars to buy it. Thanks",
    "prelabel": "ham"
  },
  {
    "message": "hope finals went well!! have a great great summer :) ",
    "prelabel": "ham"
  },
  {
    "message": "if anything is broken in ur room pls put in a service request so you don’t get charged  ",
    "prelabel": "ham"
  },
  {
    "message": "if anyone wants a pre check of their room to make sure they won’t be charged for any damages or mess or anything pls let me know :) ",
    "prelabel": "ham"
  },
  {
    "message": "free food in conference room!!!",
    "prelabel": "ham"
  },
  {
    "message": "tomorrow!! come celebrate AAPI month 7-9pm. lots of free Asian food!! ",
    "prelabel": "ham"
  },
  {
    "message": "Good luck on finals!! Finish the year strong 🩷🩷",
    "prelabel": "ham"
  },
  {
    "message": "Make sure you sign up for a move-out time on the housing portal. Return ur key and any temp buckIDs to the front desk when you do move out. Let me know if you have any questions :) ",
    "prelabel": "ham"
  },
  {
    "message": "closing floor meeting at 3pm today next to elevators!!",
    "prelabel": "ham"
  },
  {
    "message": "^actually at 3pm! ",
    "prelabel": "ham"
  },
  {
    "message": "hi everyone!! we’ll be having a floor meeting tomorrow at 4pm. If you can’t make it I’ll send an email out w the info too!! ",
    "prelabel": "ham"
  },
  {
    "message": "Hi guys! Please remember if you are watching the solar eclipse today:\n\nPLEASE. WEAR. ECLIPSE. GLASSES. \n\nThe eclipse will begin approximately at 1:55pm but will not reach its peak until 3:12pm. It will end at approximately 4:27pm. \n\nAlso attached is a great way to recycle your eclipse glasses after if you do not plan on keeping them as a keepsake. \n\nOur very delayed March program will be a grab and go program TONIGHT at 7:30pm. \n\nA “grow your own herb” kit with an info sheet on environmental wellness, and a QR code to scan for your very own compost bin will be in the Neil LOBBY for you guys to grab :) \n\nIt will be first come first serve so please stop by and grab one as soon as you can.\n\nHappy Monday and happy eclipse day! Keep those eyes protected!!! Only 3 more weeks left, I am so proud of you guys, KEEP GOING!!!! ❤️ ❤️ ❤️",
    "prelabel": "ham"
  },
  {
    "message": "Good morning! If your room is extremely hot pls fill out a service request. The more people that do, the more likely they are to come to Neil and fix the heat issue. Thank u!! ",
    "prelabel": "ham"
  },
  {
    "message": "fire drill at 1pm!! ",
    "prelabel": "ham"
  },
  {
    "message": "we have a fire drill next tuesday at 1pm! ",
    "prelabel": "ham"
  },
  {
    "message": "If you’ve filled out the form on the housing portal for spring break pls like this message  ",
    "prelabel": "ham"
  },
  {
    "message": "Spring break is coming so make sure to fill out the form on the housing portal. There’s no charge for staying over break so if you need to come in and out pls put that ur staying for break. If you do not, your access will be cut off for the week and you will not be able to enter the building. If you are a grad student you don’t need to fill out the form and your access will stay on. Let me know if you have any questions :)",
    "prelabel": "ham"
  },
  {
    "message": "Does anyone know if Neil building have a game room with a pool table or not?",
    "prelabel": "ham"
  },
  {
    "message": "yes pls!  ",
    "prelabel": "ham"
  },
  {
    "message": "I have a usb-c dongle if you still need it",
    "prelabel": "ham"
  },
  {
    "message": "does anyone have an HDMI  cord that can connect to a mac? ",
    "prelabel": "ham"
  },
  {
    "message": "Hi guys! \n\nTomorrow is our program Sweets, Sex & Condom Sense! Please come down to the Neil Lobby at 8pm to build your own goodie bag! \n\nSome of the items we have for this event: \n-fuzzy socks \n-build your own Lego succulent \n-Valentine’s day cards \n-Pocky Sticks \n-Candies such as Air Heads, Reese’s and Push Pops \n-condoms (latex and latex free) \n-flavored and unflavored lube \n-dental dams \n-y2k stickers \n\nSupplies are limited so it will be first come first serve. \n\nWe can’t wait to see you guys :)",
    "prelabel": "ham"
  },
  {
    "message": "next tuesday! ",
    "prelabel": "ham"
  },
  {
    "message": "probably service 2 facilities ",
    "prelabel": "ham"
  },
  {
    "message": "Just came home and saw this, who should I let know about it?",
    "prelabel": "ham"
  },
  {
    "message": "so whenever they run out of",
    "prelabel": "ham"
  },
  {
    "message": "we have about 20ish books left with a couple people in line rn ",
    "prelabel": "ham"
  },
  {
    "message": "How long will it be going on? ",
    "prelabel": "ham"
  },
  {
    "message": "tonight!! ",
    "prelabel": "ham"
  },
  {
    "message": "https://forms.gle/9ydR46cysHRrXqet7",
    "prelabel": "ham"
  },
  {
    "message": "Hi everyone! Hope you’ve had a good start to the semester. We’re having our first event of the semester on Jan 23rd at 8pm :)",
    "prelabel": "ham"
  },
  {
    "message": "Sure, thanks",
    "prelabel": "ham"
  },
  {
    "message": "I do but it’s a small one ",
    "prelabel": "ham"
  },
  {
    "message": "Anyone got a stapler I could borrow?",
    "prelabel": "ham"
  },
  {
    "message": "Don’t forget to choose a move out time on the housing portal! If you need to be let back in over break there is a $20 fee so make sure you take whatever you need with you. We are an academic building so there’s no charge to stay here over break. Good luck on finals!!  ",
    "prelabel": "ham"
  },
  {
    "message": "You will not be able to sign up for a move out time until housing sends out an email. Please don’t try it yet ",
    "prelabel": "ham"
  },
  {
    "message": "Alright ",
    "prelabel": "ham"
  },
  {
    "message": "yes it was super quick. i’m going to send out an email with everything we covered. let me know if you have any questions :) ",
    "prelabel": "ham"
  },
  {
    "message": "Is the meeting over???",
    "prelabel": "ham"
  },
  {
    "message": "Yes we are! Im running a bit behind schedule so we can move it to 6:30 sorry everyone!",
    "prelabel": "ham"
  },
  {
    "message": "Are we still having the floor meeting today?",
    "prelabel": "ham"
  },
  {
    "message": "Hi everyone! Hope you had a good break! We will be having our closing floor meeting this Friday (Dec 1st) at 6pm. If you can attend, pls join it should only take 20 minutes and we’ll cover lots of important information so you don’t get charged any fees over winter break. It’ll take place next to the elevators on our floor. If you can’t make the meeting please text me and let me know :) ",
    "prelabel": "ham"
  },
  {
    "message": "Does anyone have an AA battery? Thank you",
    "prelabel": "ham"
  },
  {
    "message": "you probably won’t have swipe access but someone at the front desk will let you in ",
    "prelabel": "ham"
  },
  {
    "message": "120 w 11th ave ",
    "prelabel": "ham"
  },
  {
    "message": "it’s a dorm down the street from jessie owen’s south ",
    "prelabel": "ham"
  },
  {
    "message": "Yea it did , and what is park strad?",
    "prelabel": "ham"
  },
  {
    "message": "Ok I wasn’t sure because someone left a bunch of packages on the table infront of the front desk ",
    "prelabel": "ham"
  },
  {
    "message": "if it just got delivered today call park strad and see if it’s there i was told they were supposed to go there",
    "prelabel": "ham"
  },
  {
    "message": "they’re all behind the front desk so you won’t be able to get any until the desk opens back up ",
    "prelabel": "ham"
  },
  {
    "message": "Do you know where they would put the packages because it said it delivered but the front desk isn’t open? ",
    "prelabel": "ham"
  },
  {
    "message": "Thank you!",
    "prelabel": "ham"
  },
  {
    "message": "it’s better on our floor since we’re so high up but still ",
    "prelabel": "ham"
  },
  {
    "message": "also over break maybe put a towel or something under your doors. there’s been a lot of cockroaches going around the building since the heat is now on ",
    "prelabel": "ham"
  },
  {
    "message": "but if you have a package coming that isn’t already here, i think it’ll get delivered to park strad ",
    "prelabel": "ham"
  },
  {
    "message": "No you cannot pick up your package until the desk opens back up ",
    "prelabel": "ham"
  },
  {
    "message": "if your package is at neil, i think you might have to wait til the desks open again to get it ",
    "prelabel": "ham"
  },
  {
    "message": "Can I pick my package from Morrill or park strad?",
    "prelabel": "ham"
  },
  {
    "message": "yea, it closed at 4",
    "prelabel": "ham"
  },
  {
    "message": "It’s closed now? ",
    "prelabel": "ham"
  },
  {
    "message": "or feel free to text me and i can try and contact the RAs on call! ",
    "prelabel": "ham"
  },
  {
    "message": "thank u!! ",
    "prelabel": "ham"
  },
  {
    "message": "the desk is closed and won’t open again til the 26th at noon, the closest desks to us that are open are morrill and park strad ",
    "prelabel": "ham"
  },
  {
    "message": "Have a good break everyone!! I won’t be back until next week so if you need anything stop by the front desk. Safe travels!! ",
    "prelabel": "ham"
  },
  {
    "message": "Thank you",
    "prelabel": "ham"
  },
  {
    "message": "Yes, please use the stairs. ",
    "prelabel": "ham"
  },
  {
    "message": "Idk I see the other building going off too ",
    "prelabel": "ham"
  },
  {
    "message": "Should we go downstairs?",
    "prelabel": "ham"
  },
  {
    "message": "Yes",
    "prelabel": "ham"
  },
  {
    "message": "Is the fire alarm ringing in our building?",
    "prelabel": "ham"
  },
  {
    "message": "free crumbl cookies in the conference room!! ",
    "prelabel": "ham"
  },
  {
    "message": "fyi ",
    "prelabel": "ham"
  },
  {
    "message": "Have a good break everyone! I will not be here so please stop by the front desk if you need anything. Neil will be open 10 a.m.-8 p.m. Thursday, October 12, through Saturday October 14, and open at 9 a.m. on Sunday, October 15. Safe travels!",
    "prelabel": "ham"
  },
  {
    "message": "Hi everyone! Could you each pls separately text me ur room number, major, year, and favorite class. Thank you!!",
    "prelabel": "ham"
  },
  {
    "message": "if you’re a freshman pls like this message",
    "prelabel": "ham"
  },
  {
    "message": "We didn’t have any extra plates so pls bring some",
    "prelabel": "ham"
  },
  {
    "message": "Hi everyone!! There’s free Adriaticos pizza next to the elevators if anyone wants some!! Please take as much as you want :) ",
    "prelabel": "ham"
  },
  {
    "message": "tomorrow!!",
    "prelabel": "ham"
  },
  {
    "message": "Alright thanks ",
    "prelabel": "ham"
  },
  {
    "message": "They changed the date but not the flyer! I’ll ask for the new date :)",
    "prelabel": "ham"
  },
  {
    "message": "This was suppose to be 2 weeks ago",
    "prelabel": "ham"
  },
  {
    "message": "Hi everyone! Hope your semester is going well! These are a few upcoming events we’re having at Neil!",
    "prelabel": "ham"
  },
  {
    "message": "i have greek salad dressing and ranch!",
    "prelabel": "ham"
  },
  {
    "message": "This is kinda random, but does anyone have any kind of salad dressing? I made a salad but realized I don’t have any 🫣",
    "prelabel": "ham"
  },
  {
    "message": "Hi! Does anyone have a tape measured I could use?",
    "prelabel": "ham"
  },
  {
    "message": "Hi everyone!! Please don’t put bicycles in the stairwells the building staff will remove them. Thank you :)",
    "prelabel": "ham"
  },
  {
    "message": "does anyone have a waffle maker i can use pleaseee",
    "prelabel": "ham"
  },
  {
    "message": "Welcome back event at Res on Tenth!!!",
    "prelabel": "ham"
  },
  {
    "message": "Floor meeting at 2:30 today!",
    "prelabel": "ham"
  },
  {
    "message": "Hi everyone!! Don’t forget we have a floor meeting tomorrow at 2:30pm next to the elevators on our floor. We also have a fire drill sometime\ntomorrow so make sure you take the stairs when that starts! Let me know if you have any questions :)",
    "prelabel": "ham"
  }
]