[
  "Sorry, not tonight ",
  "Anyone wanna play tonight?",
  "I'll play but I'll get there closer to 2:30",
  "anyone wanna play later? Maybe 2 to 4 pm",
  "An admin deleted this message",
  "I'll be there",
  "Maybe around 7",
  "Around what time?",
  "i may go and play pool tonight",
  "Woohoo",
  "Good news",
  "Suzi's is open tomorrow ",
  "If not, I may go and play tonight",
  "I hope so",
  "That’s so fair idek",
  "On labor day ",
  "Is Suzi cue open tomorrow?",
  "Okay, that's not too bad",
  "I’m big 10 only",
  "You didn't get tickets?",
  "I would but I’m gonna watch the game at home cuz no tickets 🥲",
  "Don’t call it an upset when they win",
  "I'm not sure we can call what the Zips do \"football\"",
  "There’s Zips* football today",
  "Sorry, there's OSU football today",
  "anyone wanna play at about 2 or 2:30pm?",
  "I can't tonight ",
  "anyone wanna play tonight?",
  "An admin deleted this message",
  "An admin deleted this message",
  "An admin deleted this message",
  "https://essaymarket.net/?rt=wS2J239v - link to hire me, if you need your personal essay writer",
  "Okay. The earliest I can get there is 3:30",
  "I’d like to play from 2:20 to 4:30",
  "Suzi-cue",
  "Where are you guys going to play at?",
  "Oh, I can't go until at least 4:00",
  "I may go there around 2:20pm",
  "I'd be down",
  "Anyone wanna play pool later?",
  "Does anyone wanna play pool tonight?",
  "An admin deleted this message",
  "An admin deleted this message",
  "An admin deleted this message",
  "An admin deleted this message",
  "Cya at 2",
  "I'll probably play too ",
  "Correct",
  "Here?",
  "1950 N 4th St, Columbus, OH 43201",
  "Or any other recommendations?",
  "In Suzi cue",
  "Where?",
  "Sounds good",
  "Around 2?",
  "Hell yeah",
  "Anyone wanna play in the afternoon?",
  "An admin deleted this message",
  "An admin deleted this message",
  "Gotcha",
  "We were gonna put flyers next to pool tables on campus ",
  "We can stand around the entrance with picket signs",
  "How are we gonna enlist more people",
  "Whattt",
  "No, Sanjay missed the sign up for it because he didn't have service ",
  "Is billiards club in the involvement fair 👾 👾 ",
  "I may go then",
  "Does anyone wanna play around 7 tonight?",
  "I can’t :/",
  "Not tonight, sorry ",
  "Anyone wanna play later?",
  "I’ll be there around 6:30 too",
  "Ok I might go a little later around 7-7:30",
  "I'll probably get there around 6:30",
  "What time?",
  "Me",
  "Anyone wanna play later?",
  "One of these bad boys. They didn't suspect a thing ",
  "Would’ve fooled me",
  "Nah, he just put on one of those cartoon disguise masks ",
  "Did he have to shimmy down an air vent or something",
  "So Sanjay got back into suzis 😂 ",
  "Sanjay and I are gonna be at Suzi's at 7",
  "anyone wanna play tonight?",
  "I may go then",
  "I'm going to Suzi's later tonight around 7 if anyone wants to join me",
  "Make sure you’re drinking some Gatorade or something, stay safe",
  "Oh that sounds ROUGH ",
  "Omg I’m praying for ya😭 I can’t even go outside rn, the heat and pollen make it so I can’t breathe, like if I’m outside for more than a minute I gotta go back inside and lay down",
  "It’s been a whole weekend endeavor. I forgot how much work moving is",
  "It’s been a one woman show too cuz everybody else in the house is gone pretty much and my family couldn’t make it out here",
  "Omg",
  "You have NO IDEA",
  "I bet it's been fun with this heat",
  "Yup I’ve been getting a real workout here",
  "Man, everyone is moving this weekend ",
  "Have fun",
  "I’d love to but I’m moving out of my house today :(",
  "Works for me",
  "like around 7:30",
  "Around what time?",
  "Anyone wanna play tonight?",
  "Hey, we have like a whole month still I think ",
  "Yikesss",
  "I have a 6-8 page paper due Sunday, I’m so sad that I only get a few weeks off if that lol",
  "So insane",
  "Can you guys believe school starts in a couple weeks",
  "Probably would’ve still absolutely whooped me",
  "You aren't missing out on much, Song and I were on the struggle bus today",
  "Just missed ya",
  "Ahh damn",
  "We just left ",
  "Are you guys still at suzi?",
  "Yes it’s fire my sister sent it to me and I was like this is my new pfp",
  "It’s just so random lol, it does make me laugh tho",
  "It’s a cat drinking wine I thought it was cute",
  "Thank you!",
  "Caroline, wtf is going on in your profile pic?😭",
  "Song I like the new profile pic 😎 ",
  "I'll be at Suzi's tonight if anyone wants to join me ",
  "im on the way",
  "I'm playing in the tournament at Suzi's tonight if anyone wants to join me",
  "That works for me",
  "Maybe 7:30",
  "But I may go there later than before",
  "I can ",
  "Anyone wanna play later tonight?",
  "Around 7",
  "What time are you thinking Song?",
  "I'm down to play tonight ",
  "anyone wanna play tonight?",
  "I’m driving back to Youngstown again, might be there a week or two",
  "If anyone wants to play in the tournament, if two more people sign up the pot goes up $50 ",
  "I won’t make it tonight",
  "I got too much homework",
  "Anyone wanna go to Suzi's around 7 tonight?",
  "I'll be at work. I might go later tonight though ",
  "I may play from 2:10 to 4:30 if anyone wants to join",
  "I'm gonna be at Suzi's tonight for the tournament if anyone wants to join",
  "Anyone over 21 trying to go to the casino?😂",
  "Sounds good",
  "I may arrive there around 6:30 or 7",
  "Sure",
  "Anyone wanna play tonight?",
  "At table 3 when you guys get here",
  "same ",
  "I’ll be there around 7:10",
  "Works for me ",
  "i’m down to go at like 7",
  "What time are you thinking?",
  "i would be down for a little bit",
  "It’s open today",
  "I checked the Facebook",
  "I'm not sure if Suzi's is open today",
  "Anyone wanna play tonight?",
  "I am at Suzie cue now and gonna stay here till 9",
  "I",
  "We probably left right before you showed up",
  "Just curious cuz I ended up here around 9",
  "How long did you guys end up staying?",
  "On my way",
  "I just arrive here",
  "I'm free now if you wanna go any earlier ",
  "Sounds great",
  "I probably can closer to 7:30",
  "Around 7?",
  "Around what time?",
  "Anyone wanna play tonight?",
  "1 min away",
  "Yeah, 9 works",
  "Awesome wanna meet at 9?",
  "I'd be down",
  "anybody interested in some pool on this fine evening? Might go over around 9 for a little while",
  "Need to go home to grab my cues and then drive there",
  "I just got back in Columbus ",
  "No worries ",
  "I may be there later than I thought",
  "Have fun in Youngstown. We'll have to find time to meet up afterwards ",
  "I may arrive around 7",
  "Yeah, I think so",
  "I’m going back to Youngstown for a week or two",
  "I was going to try to get to Suzi's around 6:30 or 7:00. Does that work for you Song?",
  "I never had an issue with it when I was underage ",
  "Yes, but not past like, 9 or 9:30 at night. But usually if you're already inside they don't kick you out if you're there after",
  "Does Suzis allow in people under 21?",
  "I may go tonight",
  "I think I'm going to Suzi's later tonight if anyone wants to join me",
  "No worries ",
  "I can’t make it actually but have fun :D",
  "It’s been a minute",
  "I might need to play",
  "That sounds like fun",
  "I think I'm gonna try to go to Suzi's for the tournament tonight if anyone wants to join me",
  "Yes welcome 😎 always love a new member",
  "Yeah, make sure to follow the main group at the start of the semester when we post information about meetings and such! Have a good rest of your orientation ",
  "Yes! Join clubs, it makes school fun and helps you meet new friends",
  "All good y'all looking forward to seeing y'all in the fall",
  "I’m doing homework, it’s a tough night for me to try and play, maybe tomorrow",
  "I would love to, but I'm super busy tonight and can't",
  "Hi y'all, I'm an incoming freshman here for orientation, I know it's late but if anyone wants to play some pool I'd love to meet yall",
  "Don't worry, I play pretty embarrassingly tonight as well. I didn't win a single game in the tournament 🤷‍♂️",
  "Lmao I don’t even come to play anymore, I just come for the tacos, I haven’t played in a minute😂",
  "I had to take a break cuz I’ve been embarrassingly bad lately 😂 ",
  "Haven’t played pool in awhile tbh",
  "Work and gym destroyed my mind body and soul today so I stayed home sorry :/",
  "I am here for tacos😂",
  "Sounds about right",
  "Might stop later for tacos😂",
  "No worries. I'll be on vacation next week so I won't be able to make it",
  "I got too much homework this week but I might be able to next week",
  "I'll be trying my hand at the tournament at Suzi's again tonight if anyone else wants to join me ",
  "Thank you!",
  "No worries. Have fun in Chicago Caroline! And have a good road trip Song!",
  "I have been on the trip and will be back on July",
  "Just got off work and I’m leaving for Chicago tomorrow so I can’t but have fun",
  "I'll probably be at Suzi's tonight around 7. Free pool and $2 tacos is a hard combo to argue with",
  "I really wanna go, but I just finished my work today. : (",
  "Yeah, I had a couple tacos, they were pretty good",
  "I’m too beat from work I’m gonna pass :/",
  "I can’t come bc I’m working on a midterm but I might come later for tacos",
  "Two dollar tacos sounds crazyyyy",
  "Also I think they have $2 tacos all week",
  "I'm probably going to try the tournament tonight at Suzi's again ",
  "Pain, it be like that tho",
  "Sorry, I already had dinner ",
  "Anyone wanna get food?",
  "On my way 🏎️🏎️🏎️",
  "I'm heading to Suzi's rn if anyone wants to join ",
  "Fair enough lol",
  "If you feel old imagine how I feel, I’m 24 and in classes with like 19 year olds😭",
  "Shred the fake lol",
  "And thanks, I do feel old now",
  "Yeah, it feels weird getting to use a real ID. I haven't even considered what I'm doing with my fake",
  "Welcome to the old head club!",
  "Ahhh 21 now very nice!",
  "Are you gonna toss your fake or keep it just cuz?",
  "Good! Gotta be exciting to be legal now 😎 ",
  "It was good!",
  "How was your birthday?",
  "Potentially me yes",
  "Anyone wanna play later tonight?",
  "Aww okay no probkem",
  "I just checked and you're right, it does go until the 31st. I can't make it though sadly",
  "I have a free summer membership with my job",
  "The membership should go til the 31st",
  "Are we even able to use the rpac over the summer? I thought we weren't ",
  "Anybody wanna play some pool at the rpac? I have a meeting there tn at 5:30 so imma go a little early",
  "I'll get there around then too",
  "I may arrive at 7",
  "I think I'm gonna join the tournament tonight ",
  "Yeah, they are open tonight ",
  "I think so yeah",
  "Is there any tournament in Suzie cue tonight?",
  "Oh cool I’m actually here with Gabe rn we’re gonna shoot some pool 😎 ",
  "I think I'm gonna be at Suzi for a little while tonight if anyone wants to join me",
  "I’m cleaning my house today sorry I cant",
  "I'll be at work",
  "I gonna play pool from 2pm to 4 pm today. Anyone else wanna play?\n",
  "Where I always park",
  "Outside my house 🥲",
  "where were you parked?",
  "that’s terrible damn",
  "They did you dirty",
  "🥲🥲🥲",
  "Yeah, that's super unfortunate. Sorry that happened to you ",
  "Sorry to hear that, hopefully your insurance covers everything",
  "Im not gonna make it, just found out my window got smashed and had some shit stolen from my car :/ so I won’t be driving for a little while until I get it fixed",
  "I’m down potentially",
  "Anyone wanna play tonight?",
  "I’m on the may. Maybe arrive around 6:30 too",
  "I will also be there tonight",
  "I'm gonna aim to get to suzis around 6:30 to try to get a table. Feel free to join me whenever, remember the tournament starts at 7:30, and I think they want people signed up like 10-15 minutes before ",
  "You guys can just let me know when you’ll be there and I’ll come then",
  "Oh yea I’d love to, I have training for my job til 5 but I’m free for the rest of the night after that",
  "But they let you play a bit beforehand for free as practice ",
  "Yup",
  "It's at 7:30, right?",
  "Ya it’s $10",
  "You just sign up tomorrow at it",
  "Ohh I’d love to join do I have to sign up?",
  "I think Frank and I were gonna go tomorrow night for the tournament ",
  "Anybody wanna play this week? I’m back in town",
  "I was planning on going a little later",
  "Gonna leave in 30 minutes",
  "actually I’m here now",
  "Ya I’d go",
  "Anyone wanna go to Suzi's tonight, it should be free",
  "I'll be there in about 20",
  "We can play a small tournament lol",
  "Oh wow they’re closed💔 I was looking forward to the tournament lol",
  "I’ll go to bankshots now",
  "Ok",
  "I could try bankshots",
  "Wow, great ",
  "q-stix is closed on mondays unfortunately ",
  "bankshots in hilliard is a pretty good place, i recommend",
  "Oh you're so right. Wanna try q stix?",
  "Any other good place to play pool?",
  "sounds about right lol",
  "Any other good play?",
  "Suzie cue is closed today",
  "I'll probably get there around 6:30 as well",
  "I’ll play then",
  "Ok",
  "Yeah. They let you play beforehand for free if you're playing in the tournament too",
  "Can I just walk in and sign up at around 6:30pm?",
  "Ya at 7:30 8 ball tournament, you show up and sign up right on the left $10",
  "How to sign up for that",
  "Oh really?",
  "I can play around 4:30",
  "Tournament night",
  "Anyone wanna play later?",
  "I didn’t realize you were going, I’m at Trader Joe’s rn😂",
  "I’ve been here. Still waiting for a table",
  "I’d play",
  "anyone wanna play today?",
  "Lmao I’ve been here an hour and a half and am yet to play a game",
  "There should be a tournament every Monday. I actually decided to go home for the week, so I can't make it",
  "I may join the tournament next Monday if they’ll still hold it. Too busy today",
  "Bc if there is I’m playing in it again, that was fun, for $10 I encourage people to play in it and see if one of us from the club and win some money",
  "There’s a tournament tonight right?",
  "I leave tomorrow morning but you guys have fun",
  "I can't tonight, maybe tomorrow ",
  "Anyone playing tonight?",
  "I am back in Columbus, might have to play some pool this weekend",
  "Not that good, it would wake me up tho, but I always sobered up very fast, I could have like 10 drinks in an hour and be fine with an hour or two",
  "Surprisingly, trying to cover the effects of one drug by taking others does not work well",
  "That’s like when I used to drink a cup of coffee and throw some chew in and say I was good enough to drive, it don’t work😭",
  "I'd be down to go to q-stix later",
  "Cuz I’m down, suzi is just closer to me for now so I’m going",
  "How late are u guys gonna stay?",
  "if any of u guys want to go to Q-Stix afterwards, trent and i are going!!  ",
  "There are lots of people here",
  "im here now",
  "Song what about you are you coming too?",
  "Okay I gotchu",
  "Yeah atm, because Sanjay couldn't get in so I had to drive him back lol",
  "Is it just you there playing",
  "Not horribly. I think a lot are coming in and out. The front is busy but the back is around normal",
  "How busy is it?",
  "🧢 ",
  "I'll be here for a bit",
  "Just got here, also just got a table",
  "You gotta eat the food before for that to work😭",
  "Anthony how long are you gonna be at suzi?",
  "Gonna be there more like 8:20-30, gotta eat some food so I can sober up lol",
  "I’m gonna aim for 8:15 ish in that case",
  "I can go there too around 8",
  "Okay sounds good",
  "I think Sanjay and I are gonna get there a little after 8",
  "Whenever, honestly doesn't matter ",
  "I’m still at the bar crawl when do you think you guys are gonna go?",
  "sooner is prob better",
  "i can go whenever ",
  "BATHROOM TACOS ‼️",
  "I think Suzi's has $2 tacos today ",
  "Not sure. It could be, it'll just be busy",
  "So is today not a good day?",
  "That’s true I didn’t think about rhat",
  "Like, no matter when we go",
  "It's gonna be hard to get a table either way",
  "Doesn't matter to me",
  "What time we thinking for pool?",
  "Yes that’s what I’ll be doing tomorrow",
  "could be fun tho too ",
  "eek i didn’t think abt that hmmm",
  "Oh, tomorrow is also the senior bar crawl, right? That could be hectic ",
  "I’m down too depending on what time",
  "I'm down tomorrow as well ",
  "same lol.  would be down to run some pool tomorrow though",
  "I have an exam tomorrow morning first thing :( I totally would but have fun",
  "There’s a tournament tonight $10 entry I believe. It starts at 7:30 if anyone wants to play. Anthony and I are going, will probably be fun!"
]