[
  "Hey BDAA!\nIf you're interested in participating in an exclusive Pre-Event Networking Session with Bank of America tomorrow, please fill out the form below. This is a great opportunity to connect with industry professionals in a small group setting, share your resume, and ask questions.\nSpots are limited! Only the first 30 people to RSVP will receive the exact time and location.\u2028This is a first-come, first-served opportunity:\nhttps://forms.gle/FpVTz3fYWQ5XZb6z5 \n",
  "Hey BDAA!\n\nThis Tuesday, April 8th, in Pomerene 260, Bank of America will be leading a special Tech Talk!\n\nExpect to explore cutting-edge data-driven innovations, tech strategies, and more. Whether you’re deep in the tech world or just curious, this session will offer valuable insights!\n\n🕖 Pre-networking session: 7:00 - 7:30 PM\n🕢 Main meeting: 7:30 PM\n\nPanda Express provided. More details to come, so stay tuned! 🤝",
  "An admin deleted this message",
  "Meeting tonight!!! See above messages for more details😄",
  "Hi BDAA! To add onto our upcoming Tuesday meeting, a campus ambassador from Good Molecules will be coming and giving out free packages that include full-sized products and samples. Good Molecules is a skincare brand known for its affordable products made with clean, cruelty-free ingredients and the company has a a strong focus on transparency about what goes on your skin. Join us this Tuesday so you have a chance to try these products out for yourself!",
  "Hey BDAA! Join us this Tuesday, April 1st at 7:30 PM in Pomerene 260 for an in-depth session on NLP and text analysis - exploring how technology is transforming the way we understand language. Plus, a campus ambassador for Good Molecules will be speaking and handing out FREE product packs! Food will be provided😊 Don’t miss out on this exciting event!",
  "Another hackathon here at OSU! \n\nhttps://www.yforsec4c.org/?fbclid=PAY2xjawJQ9pVleHRuA2FlbQIxMQABprNhOssyD9f4RuhSKBPqhCaIejoxYppyD_Q06k2H0o0RD00xN4yFQa2V9A_aem_d-gwnlrPEP6HKLZONACguA\n",
  "Reminder that BDAA Feud is TONIGHT! Hope to see you all there:)",
  "Hi BDAA!! OHI/O is hosting MakeOHI/O, Ohio State’s annual makeathon dedicated to inspiring students at the intersection of technology and hardware. This is another great opportunity to practice your skills and make new connections. For more information and registration use this link: \nhttps://hack.osu.edu/make/2025?fbclid=PAY2xjawJPwa9leHRuA2FlbQIxMQABpsn4jnnCvG22w0sc3maoOFfWvm0ojMQiVoWyLbnKDabJF9mQprlit2_ilA_aem_WaT3D1N1bY73gBHU9PdB5w\n",
  "Hey everyone! Check out this opportunity with OSU AIRC! \n\n\nTech Talk: Leveraging AI/ML Use Cases in the Financial Sector: Challenges and Opportunities\nSpeaker: Dee Pai, Chief Data Scientist at Chase\n📅 Date: Thursday, March 27th, 2025\n⏰ Time: 7:30 - 9:00 PM EST\n📍 Location: Pomerene Hall 160\n🍕 Pizza, cookies, and drinks included!\n📝 Resume drop available for attendees!",
  "This message was deleted",
  "Get ready for BDAA Feud this Tuesday, March 25 at 7:30 PM in Pomerene 260! It's a unique take on Family Feud that lets everyone join in the fun. Food will be provided, so bring your friends and come have some fun!",
  "This message was deleted",
  "Reminder that we have a meeting tonight with Harman Thind from Microsoft!!! See you all there😁",
  "Join us on Tuesday, March 18 at 7:30 PM in Pomerene 260 for an exciting meeting with Harman Thind, a Project Manager at Microsoft!  He'll be joining us via Zoom to share what a day in his life looks like and give us an inside look at Microsoft. 🙌🏼 Food will be provided! Have questions? Stick around for a Q&A session afterward. See you there!",
  "Here are the slides from yesterday!",
  "Shared a document: https://group.me/1p4hETnCsdY4an",
  "Hey everyone!\n\nWe’re hosting a meeting today on how to build personal projects, and I highly recommend attending! We’ll cover topics like building personal websites and leveraging AI tools like Replit and GitHub Copilot. These skills are great for boosting your resume and giving you strong projects to showcase in interviews—perfect to work on over spring break. Don’t miss out!\n\nPanda Express provided too!",
  "Hello BDAA! Got a great data project idea but don’t know where to start? Join us this Tuesday, March 4th at 7:30 PM in Pomerene 260 for an in-depth session on how to turn your ideas into reality! We’ll cover everything from essential tools to common pitfalls and how to find the right resources to bring your project to life. Whether you're just getting started or refining your process, this session is for you. Hope to see you all there!",
  "it starts at 9am on Saturday and ends at 12pm on Sunday",
  "I don’t know but if you reach out to this club or sign up they should send more information",
  "I mean like what time of day? ",
  "Yes March 1-2 in the math tower room 724",
  "March 1-2 according to the poster",
  "Do you know at what time it takes place? I can't seem to find it anywhere",
  "Another great opportunity for those all interested. Register here: https://forms.gle/gpJGbWeNTsnitzve7.",
  "Hey everyone! Check out this great opportunity from the Sports Analytics Association:\n\n“Hi all! Registration for our CFP Hackathon is officially open! Anyone is welcome and no prior coding experience is necessary. We would love each and everyone of you to participate, either individually or in a team. Finalists will present at the Ohio State Sports Analytics Conference March 28-29. Please reach out to us if you have any questions about the conference, hackathon, or simply where to start!\n\nThe data, sponsored by Sports Info Solutions, will be available March 3. Submissions will be due March 21. Give yourself ample time to participate!”\n\n\nFeel free to reach out with any questions or follow @saaohiostate on instagram!",
  "This message was deleted",
  "Meeting tonight!!! See message above for more details😁",
  "An admin deleted this message",
  "An admin deleted this message",
  "Join us this Tuesday, February 25th at 7:30 PM in Pomerene 260 for a Resume Workshop! Whether you're prepping for career fairs, internships, or your dream job, a strong resume makes all the difference. We’ll provide personalized tips and help you improve your resume to stand out. Plus, free food will be provided! 🍕 See you there!",
  "I do also",
  "I do",
  "Does anyone still need a team for DataFest?",
  "An admin deleted this message",
  "Reminder: Meeting tonight with guest from Fifth Third Bank! See you all at 7:30😁",
  "An admin deleted this message",
  "Join us this Tuesday (2/18) for Modern Data Strategy with Fifth Third Bank! Kayleigh Lavorini, Director of Data Engineering – Data Foundations & Strategy will share her expertise on transforming data management in banking and how people, processes, and tech come together for successful data modernization.\n\nPLUS: Enjoy some delicious Chipotle while you learn from a top industry expert! \n\n📍 Pomerene 260 | 7:30 – 8:30 PM\n\nDon’t miss out!",
  "https://medium.com/99p-labs/data-i-o-2025-bcd11781e6e6",
  "Hey everyone!! We will not have a Tuesday meeting this week. Enjoy your night off and we’ll see you next week:)",
  "Hey everyone , Agastya Mishra and I are representing Ohio State in the 2025 Big Ten Academic Alliance (BTAA) Data Visualization Championship. After winning against other Ohio State participants, we are now competing against the top teams from every Big Ten school for the BTAA Data Viz Championship. \n\nOur project was a dive into U.S. National Park Visits\nIf you wanna see what we did here it is:\nhttps://24amishra-datavizpt2-streamlittest-faij14.streamlit.app/\n\n\nFor us to win, we have to collect as many votes as we can by 12 PM, Feb 14th. \nIf you have an Ohio State email, please vote for us here: https://forms.gle/cAy6yaynbypDJ6GA8",
  "I could not make it to the workshop yesterday. I am looking for a team. Please let me know if anyone is still looking to be in a team.",
  "This message was deleted",
  "Remember we have a Hacking the Hackathon Workshop tonight!! See message above for more details😁",
  "Data I/O is almost here! Join us this Tuesday for our Hacking the Hackathon workshop! \n\nWhen: Tuesday, January 4th, 7:30 PM\nWhere: Pomerene 260\n\nWe'll be covering essential tips, tricks, and strategies to set you up for success—whether you're brainstorming project ideas, maximizing your time, or just want to know what to expect.\n\nPlus, if you're signed up for Data I/O as an individual, we’ll help you find a team! This is the perfect chance to connect and collaborate.\n\nPizza will be provided!\n\nDon’t miss out! See you there! 🙌",
  "Yes sorry it is too late to join the project series this semester but we might be running one again in the fall so feel free to join it then!",
  "I’m guessing it is, but is it too late to participate in the project series if you missed the first workshop? ",
  "https://discord.gg/hDGEgqfA",
  "Hey, whenever I try to join the discord it says the link is expired, can someone help me out?",
  "Just a general reminder for everyone, tomorrow is the last day that you can join the project series. So if you are interested please join the discord as soon as possible so you will get updates about meetings and such",
  "The first day of the project series was actually last Thursday but we posted the slides in the discord (scroll a lil bit up the link is there) so just follow that to set up your environment and you should be all good!",
  "Is the first day of the project series tomorrow evening?",
  "REMINDER: MEETING TONIGHT!!!! See message above for more details🙃",
  "Hello BDAA!\n\nJoin us for a Data Visualization Competition this Tuesday, January 28th at 7:30 PM in Pomerene 260! \n\nThis is your chance to show off your creative and analytical skills by crafting data visualizations that tell a story. Whether you’re a seasoned pro or a beginner, we want YOU to participate. Plus, there are gift card prizes for the top entries! \n\nFREE food will be provided! \n\nDon’t miss out on this awesome opportunity to compete, learn, and win! We can't wait to see your visualizations.",
  "Hey BDAA! Join us TONIGHT for our Hot Chocolate Social!!! You are welcome to stop by anytime between 5-7, or stay the whole time. Hope to see you all there😁 ",
  "An admin deleted this message",
  "https://discord.gg/QeeKWFGa\n\n^ Discord link for the project series",
  "If you plan to come to this meeting and have not filled out the application, reach out to me!",
  "BDAA Project Series Orientation!\nIf you applied to the project series or are interested in joining, the orientation meeting is today!\nWhen: Today at 7:30pm\nWhere: Pomerene 160\nPlease bring your laptops!",
  "Hey everyone! \n\nExcited about data and eager to level up your skills?  Join us for Data I/O, an event open to all skill levels! Whether you're just starting out or looking to sharpen your expertise, there's something for everyone.\n\n Sign up here: https://tally.so/r/mR8Kop\n\nDon't miss this opportunity to learn, connect, and grow. Hope to see you there!",
  "Shared a document: https://group.me/aY5VQXWs1IMjJ",
  "yes!! Meeting at 7:30 in Pomerene 260😊",
  "Do we have a meeting today. ",
  "We will be having meetings Tuesdays and Thursdays starting next week!",
  "No there will not be a meeting tonight, people were just confused about when the project series would begin.",
  "Is there a meeting tonight?",
  "Just a reminder guys the project series will start next Thursday not today!",
  "https://activities.osu.edu/posts/documents/day-1-public-map.pdf\nIf you're at the involvement fair today please stop by! We will be at table 159!",
  "Here’s the notion with more information on schedules, project managers, and more!\nhttps://coordinated-nymphea-a4f.notion.site/16a2baa503d4801c8a9aee5b8d54123a?v=16a2baa503d481379ce9000c054ca96f&pvs=74",
  "Project Application  \nhttps://tally.so/r/nWD5Ne",
  "Hey BDAA! Join us tonight, January 14th at 7:30 in Pomerene 260 to hear about the exciting plans we have for this semester and gain some valuable hands-on experience! We’ll kick things off with a discussion of our project series, followed by a brief workshop on Python and Tableau. Panda Express will be provided!!!!! Hope to see you all there:) ",
  "https://docs.google.com/forms/d/e/1FAIpQLSfRXJDQ-Bcmk0Z3Wg55C5lyN_qW_o1s9Ff3Bqmriyyxucfj_A/viewform\n\nSign in link^",
  "Shared a document: https://group.me/2P4wApDMyt3auM",
  "Shared a document: https://group.me/23YLDRulVWOvdf",
  "Hey everyone, Adidas just recently dropped their Analytics internships along with some events for students to join. The first event is today at 8 pm EST and look at the flyers for more information!",
  "This message was deleted",
  "Welcome back to school BDAA! To start off the second semester right, we will be meeting Tuesday, January 7 in Pomerene 260 at 7:30 to discuss all things BDAA! Whether you have been a part of BDAA in the past, or this is your first meeting, everyone is welcome:) We will discuss the motives of BDAA as well as some exciting things we have in store. We will also be doing some fun activities to foster new connections among members. FREE pizza will be provided!! Hope to see you all there😄😄😄",
  "An admin deleted this message",
  "https://www.tableau.com/university-students\nA lot of entries are created in Tableau which we get a free license to!",
  "https://btaa.org/research/love-data-week/compete-in-the-2025-data-viz-championship\n\nHey guys wanted to push this one more time it's a super cool opportunity to show off your data analysis skills with the chance of winning prizes ",
  "REMINDER: No meeting tonight! \n\nGood luck on the rest of your finals and have a great break😁😁😁",
  "This message was deleted",
  "Hi BDAA! If you're interested in joining a technical project next semester (spring 2025), please fill out this quick interest form. No commitment—just an interest check! :)\nhttps://tally.so/r/3XRZdg ",
  "(ROOM CHANGE TO POMERENE 160) Hey BDAA! Reminder to join us TONIGHT at 7:30pm in Pomerene 160 for our last meeting of the semester for a study session! As a form of stress relief, we will have some friends from Buckeye Paws come hang out and play so be sure to stop by! Boba & Insomnia will be provided, see you all there!",
  "Hey Guys!\n\nHeres a really good resource for anyone currently interviewing for data science roles: https://www.stratascratch.com/",
  "https://www.shorturl.at/1ffsx",
  "Link for todays workshop: https://sqlite.org/fiddle/",
  "https://btaa.org/research/love-data-week/compete-in-the-2025-data-viz-championship",
  "Just a reminder, if you wish to attend the pre networking session. Please fill out this form ASAP!",
  "Happy Veterans Day BDAA! Join us TOMORROW in Pomerene 260 from 7:30pm as we will have AWS’s representatives join us to talk about industry insights, company culture, and various other topics! CHIPOTLE is catered so make sure not to miss out on this exciting opportunity and good food!",
  "On Tuesday not tonight lol",
  "Heads up, juniors and seniors! Join us before the main meeting tonight at 6:30 for an AWS networking session. Reps will be here to discuss internship opportunities and answer any questions. Don’t miss this chance to connect! Fill out the form if you’re interested: https://forms.gle/jc2egJUT3QkpwFHE8. \n\nLimited spots are available so sign up quickly!",
  "Hey everyone!\n\nHeads-up: The virtual info session for the UHG Analytics Internship program was canceled due to high applicant volume. But good news—you can still apply! Use this link: https://uhg.taleo.net/careersection/10260/jobdetail.ftl?lang=en&job=2248464\n\nFor any questions, feel free to reach out directly to the recruiter, Mai Zong Vang, at mai_zong_vang@uhg.com.\n\nDon’t miss out, and good luck to everyone applying!",
  "Please come to Pomerene 280 for the meeting!",
  "Pomerene 260 is currently unavailable, so we are trying a different room ^^",
  "Hey BDAA! Join us TONIGHT in Pomerene 260 at 7:30pm for a career panel to hear some past internship experiences as well as interview prep. Get tips and tricks for a standout interview from students who have obtained internships/jobs at Chase, Progressive, GE, P&G, and more! We will discuss how to take on behavioral and technical interviews as well. Don’t miss this chance to boost your career and learn more about possible future employers! Papa Johns will be provided!",
  "Shared a document: https://group.me/3bo0JdOCrR8ot8",
  "https://www.tableau.com/academic/students - get your free edu version of Tableau",
  "Here's the following links we'll be using today for the visualizations:",
  "Hi BDAA! Join us TONIGHT at 7:30pm in Pomerene 260 for a workshop to learn the basics of creating and manipulating data visualizations using Tableau! We will be following it up with mini competition for prizes so you don’t want to miss it. Workshop + Visual competition is beginner friendly and Jimmy Johns is provided so be sure to join us!",
  "Hey everyone! \n\nWe’ve partnered with the app Claim to bring you a great deal. If you download Claim and use the code BDAA24 (or use this link:https://join.claim.co/g/BDAA24), you’ll get free Chipotle, and you’ll also help our club earn money with each sign up.\n\nClaim is easy to use—just sign up, redeem offers from different brands, and enjoy rewards like Chipotle. Thanks for supporting BDAA, and enjoy your free meal!\n\nIf you have any questions or concerns, feel free to reach out to me as well!",
  "Don’t forget to join us tonight in Pomerene 260 at 7:30pm as we host a club favorite Jeopardy Night! Chips & Snacks will be provided as well",
  "FINAL REMINDER: BDAA Applications are due tonight!! Here’s the link to apply: https://docs.google.com/forms/d/e/1FAIpQLSfm48gOU9qdOhLpaEOfjk_gVwrexp4Y7_ofKLpq58H-KRFeFw/viewform",
  "Shared a document: https://group.me/3p3WU57HAMax62",
  "Shared a document: https://group.me/23kKnhCalu4OgA",
  "Hi BDAA! Join us TONIGHT at 7:30pm in Pomerene 260 for an interactive session on data cleaning and transformation techniques! Whether you’re new to data or looking to sharpen your skills, this workshop will cover the tools and methods you need to prepare data for analysis. This will also help you continue the project you started a few weeks ago, but attendance at the previous workshop is not necessary to join us this week! BDUBS provided!",
  "In addition to the application window opening, join us TONIGHT in Pomerene 260 at 7:30pm as we will be hosting an E-Board Panel to present what each position on E-Board entails followed by a Q+A session. This meeting is to provide potential applicants with a good understanding of what each position does before applying. We will leave time to network at the end for general body members to speak directly with our current E-Board! Panda Express is provided so see you all there!",
  "Hello BDAA, 2024-2025 E-Board applications are now open! Applications are due on October 15th! Here’s the link to the application form: https://docs.google.com/forms/d/e/1FAIpQLSfm48gOU9qdOhLpaEOfjk_gVwrexp4Y7_ofKLpq58H-KRFeFw/viewform",
  "Networking is in 301!",
  "Final Reminder: The new location for our meeting and pre-meeting is in Pomerene 320!",
  "Hi BDAA! Reminder to join us TODAY September 24th at 7:30pm as we will have Fifth Third Bank’s representatives talk to us about the data pipeline process at Fifth Third! The Meeting Location is POMERENE 320 tonight, not our usual room in 260! Make sure you don’t miss out on this exciting opportunity to network with the company and ask questions! Chipotle is provided!!\n\nAs mentioned earlier, we are also hosting a pre-meeting session in Pomerene 320 at 6:45pm directly before the meeting. This event is open for all BDAA members and we will be sending invitations via email to 25-30 attendees who fill the google form sent out earlier in this chat (active members take priority)! Once again, BOTH meetings will be taking place in Pomerene 320 instead of 260 tonight!",
  "An admin deleted this message",
  "It is not expected for you to meet a dress code as our meetings are informal but ur more than welcome to make an impression on the recruiter ",
  "Should we dress in business casual to the upcoming meeting?",
  "Meetings are Tuesdays from 730-830!",
  "This message was deleted",
  "Meeting is tomorrow?",
  "Active members will get priority and all years are welcome!",
  "Hey everyone!\n\nThis week’s meeting will be with Fifth Third, where we will host a pre-meeting session with a recruiter to discuss their internship programs and early career opportunities. The session will focus on the available roles, desired qualifications, and potential career growth within the organization. It will also provide an opportunity to ask questions and gain valuable insights into standing out during the recruitment process.\n\nPlease fill out this form if you wish to be included: https://forms.gle/CnNBiRjkdYmBABqE9\n\nSign up quickly as spots will run out quickly!",
  "https://forms.office.com/Pages/ResponsePage.aspx?id=NlYJ61IQlUiVKx_53x0RIb1LEGFqbXZDuM3GjLZ6HDFUQTlaMkE2UE5VTjdBTDFYNTRYUTBHSlg0WS4u",
  "Is there an application link?",
  "Here's a cool web dev opportunity ",
  "https://docs.google.com/document/d/1UpN-iuFmxlQcgXE3SSoxBaBZ-bJhQ6CzWJy4S9IMO2s/edit?usp=sharing",
  "I’m a big fan of using the jupyter extension in Vscode",
  "Yeah I tried using VScode for python this summer at my internship but I was definitely missing something. I’ll look into that extension if I pick it back up",
  "I’m a big fan of using the jupyter extension in Vscode",
  "you can also have Jupyter in VScode but I really think it’s personal preference and if you’re on jpn just stick w it",
  "Jupyter is solid imo since Python dependencies and environments in VScode can get annoying",
  "Genuine question for the DA major folks here - should I make an effort to start writing my python programs/scripts in VS code? Up till now I’ve mostly used Jupyter notebooks ",
  "Shared a document: https://group.me/3UGH69HewnIHTH",
  "I can send the slide set when done and will answer any questions",
  "I am in the same position",
  "I’m not able to make it to today’s meeting about projects. Is there anyone we can reach out to for help relating to projects?",
  "Use those hints if you’re feeling stuck. We care more about the number of clue slips than the number of hints at the end of the day",
  "Let us know ASAP if you’re running late and on the way to Pomerene!",
  "Scavenger hunt is about to start. If you’re not here at the start, we can’t count your group",
  "Reminder to meet at Pomerene 160 at 6:30pm for kickoff if you’re participating in the Scavenger Hunt!",
  "Hello BDAA! Join us TODAY, September 12th from 6:30-8pm for a social event as we host a campus wide scavenger hunt! All students are welcome to participate so round up 4-5 of your friends or fellow BDAA members per team to look for clues across campus! You have a chance to win $200, BDAA swag and gift cards! We are meeting in Pomerene 160 BEFORE the scavenger hunt for directions, so please make sure to join us there! See you all soon!",
  "Hi everyone,\n\nWe are running 4 projects this semester! We will be continuing the 2 projects from last semester and including 2 new projects! More information on the projects are in the form. This is a great chance to improve your resume and include some projects that are having a real world value! \n\nIf you have any questions please feel free to reach out to myself and Suvan.\n\nThis application is due on 9/17.\n\nhttps://forms.gle/r7s6kaihNnsG6MHA7",
  "Unfortunately all sports have been filled but you can still attend our Accenture meeting @7:30 in Pomerene ",
  "Hey all, are there still spots open to come to the mini networking event with Accenture today? ",
  "This message was deleted",
  "Yup we have no membership requirement you're always welcome to join! ",
  "Hey all, is this club still accepting new members?",
  "You would have received an email!",
  "How do we know if we were chosen for this?",
  "I’d say more on the casual to business casual side",
  "Would we dress for this the same as for a career fair? Or more casually",
  "I believe we don’t have one planned with NetJets right now",
  "Which day was the NetJets event again? ",
  "Attention all BDAA Members!\n\nDue to the limited amount of representatives, we will be selecting members to speak with Accenture representatives 1x1 tomorrow.\n\nPlease fill out this form if you wish to be included: https://forms.gle/3pcKMp72Ndd99vvbA.\n\nSign up quickly as spots will run out quickly!",
  "Hey everyone!\n\nUnitedHealth Group (UHG) just posted some internships in analytics, actuarial science, and finance, and they’re open to all years! If you’re interested, I highly recommend checking them out and applying.\n\n🔗Here is the link to the internship postings: https://careers.unitedhealthgroup.com/job-search-results/?keyword=intern\n\nIf you have any questions, feel free to reach out. Good luck! ",
  "@Zachary Slone That’s you bro ",
  "I think I made them mad lol",
  "that way we can rid of the bot ",
  "lmaoo just make everyone enter their name.# before they can join and has to be confirmed",
  "Can someone remove lol",
  "Bots in full force smhmh ",
  "An admin deleted this message",
  "An admin deleted this message",
  "An admin deleted this message",
  "This message was deleted",
  "An admin deleted this message",
  "An admin deleted this message",
  "An admin deleted this message",
  "An admin deleted this message",
  "An admin deleted this message",
  "🙄",
  "An admin deleted this message",
  "They’re nothing if not persistent lol ",
  "An admin deleted this message",
  "On a side note Techstars a local startup accelerator released some internship positions within their companies, great roles to apply to if you wanna get involved.\n\nhttps://techstars-osu-2024.pory.app/TechstarsColumbusInternships",
  "Hey guys! Hope the career fair went well! A couple reminders post career fair if you got anyone's contact or LinkedIn you should try to follow up today before noonish or on Monday. Try to ask them something tangible like to hop on a quick coffee chat or even ask them questions about the job. Also make sure you are applying to the companies you talked to ASAP, if a recruiter liked you they are going to be looking for your name in those applications so you need to get those in.",
  "This message was deleted",
  "scam btw ^",
  "An admin deleted this message",
  "LMFAO i was at the career fair still and just saw “mention-skills”",
  "IME avoid mentioning things you aren’t prepared to talk at length about. ",
  "SQL, analysis, implementation and operations 🥳",
  "Should we mention skills we are starting to learn or only mention skills we have learned a good amount of? ",
  "Good luck everyone! ",
  "Printer paper is fine ",
  "It totally fine to have a resume style LinkedIn, but it probably won’t make a big difference for college students",
  "How important is paper quality for resumes?",
  "yeah this is fine, but I think just getting your experience/skills down is enough. as an entry level applicant recruiters aren’t looking much at your profile, so for entry level we use LinkedIn to reach out to people  ",
  "^ libraries and the kbk in the union both have printers, whatever is more convenient",
  "Kbk has a place ",
  "Where’s the best place to print off resumes?",
  "You don’t need to register ahead of time, they may just ask for a BuckID!",
  "Is there registration?",
  "Business casual at bare minimum but if you have something nicer, wear it",
  "whats the dress code??",
  "Hey BDAA, the Tech & Analytics career fair is beginning in an HOUR! As a reminder, the event is open to all current OSU students and recent graduates. It’s the premier Ohio State event for students seeking opportunities in the field of technology, data, economics, and analytics. The fair is located at the Ohio Union Archie M. Griffin Grand Ballroom and will occur from 1pm-5pm. We anticipate OVER 50 COMPANIES attending so this is an event you do not want to miss! See you there!",
  "All the info is available in the notion that's pinned ",
  "An admin deleted this message",
  "Are the slides from the meeting posted somewhere?",
  "Highly recommend against jeans a shirt, career fairs are really about first impressions ",
  "Business Casual / Business Professional. It's typically a suit or polo/dress shirt and nice pants ",
  "Is it ok to copy paste from the resume to start and then add extra bullets? Since the resume is already written in the xyz format for impact",
  "What is the recommended attire for tomorrow?",
  "A lot of the content will be the same but LinkedIn allows you to add more detail since you have a lot more space. Think of it as an extended version of your resume!",
  "How should a linkedin profile differ from your resume?",
  "Please try to submit resumes for review by tmrw afternoon we'll try to look at as many as possible before the career fair ",
  "Resume Dropbox - https://forms.gle/kJPNvYEP9sVoUgXG9\n\nResume Guide - https://boatneck-individual-8bf.notion.site/BDAA-Resume-Guide-8ea3143c5f7448c191e838983fc348ac?pvs=4",
  "Hey guys, the long awaited Tech & Analytics Fair is this Thursday! To prepare for the fair, join us TONIGHT at 7:30pm in Pomerene 260 to go over career fair tips and tricks as well as a resume workshop to ensure a successful career fair this fall! Bring questions and chat with E-board and your peers to learn how others have succeeded in the past. Panda Express is provided so make sure you don’t miss this!",
  "An admin deleted this message",
  "Hey BDAA, the Tech & Analytics career fair is approaching soon! This year, BDAA is proudly co-sponsoring the Tech & Analytics Career Fair, which is the premier Ohio State event for students seeking opportunities in the field of technology, data, economics, and analytics. The event is open to all current OSU students and recent graduates. The fair is located at the Ohio Union Archie M. Griffin Grand Ballroom and will occur from 1pm-5pm. It provides an opportunity for you to network with employers and learn about internship and career opportunities. We anticipate OVER 50 COMPANIES attending so this is an event you do not want to miss! DM us if you have any specific questions! We can’t wait to see you all there!",
  "An admin deleted this message",
  "if anyone has a complete resume and wants feedback here's a dropbox for resume reviews! Again please feel free to ask us any questions. Career Fairs are approaching very soon so this is a great thing to work on!\n\nhttps://forms.gle/Z5XMeUBPxVGq4Mk49",
  "An admin deleted this message",
  "Hey guys, join us on the South Oval TODAY at 7:30 for an Ice Cream Social! This is the perfect chance to network with E-board and other BDAA members!",
  "Hey Everyone!\n\nTo make the resume workshop next week more helpful, we’ve created a general guide on how to write your resume. Below is a Notion page with information on crafting a resume. The guide is tailored toward tech roles, but most of the advice applies to every major and job. There are also templates available at the bottom!\n\nNotion: https://boatneck-individual-8bf.notion.site/BDAA-Resume-Guide-8ea3143c5f7448c191e838983fc348ac?pvs=4\n\nFeel free to reach out to Pratty or me if you have any questions!",
  "An admin deleted this message",
  "Okay thank you. ",
  "https://bdaaosu.org",
  "Anyone who missed yesterdays meeting can still join the club. Join us next Tuesday! If you have any specific questions feel free to reach out to anyone on eboard. You can find our emails on our website linked here ",
  "An admin deleted this message",
  "An admin deleted this message",
  "Yup! There’s also an ice cream social this Thursday",
  "Is there a meeting next week?",
  "Same here",
  "I am in the same situation",
  "Hey! How can I get in contact with some e board members as I am really interested in joining but can not make tonight’s meeting. ",
  "If you cannot attend, no worries just be sure to stay updated with our socials and email for future meetings and opportunities. We do not normally post our slides online but you can reach out to Eboard or ask at the next meeting if you have any questions!",
  "If we can’t attend tomorrows meeting what should we do?",
  "Hi BDAA! Join us this Tuesday August 27th at 7:30pm in Pomerene 260 as we welcome our new BDAA members as well current BDAA members! We will discuss the purpose and goals of BDAA and have some fun activities. Free pizza will be provided!",
  "This message was deleted",
  "An admin deleted this message",
  "An admin deleted this message",
  "An admin deleted this message",
  "https://midwestcon.live/datahackathon-2024",
  "Hi everyone,\n\nWe are excited to announce that BDAA will be hosting this year's Tech & Analytics Career Fair, and we aim to make it the premier event for CS and Data Analytics students. To achieve this, we need your help!\n\nIf you are currently interning, we would greatly appreciate it if you could connect us with your company's recruiters. Please either reach out to them directly about this fantastic opportunity or send us their contact information, and we will get in touch. The link for registration is: https://app.joinhandshake.com/career_fairs/49171/employer_preview. \n\nIf you have any questions or need assistance, please feel free to reach out to myself or Suvan. Thank you for helping us make this event a success!",
  "Hi BDAA! The Scavenger Hunt for this Thursday April 18th has been CANCELLED and will not be rescheduled for the rest of the semester. Please inform your friends who are not active in this group chat",
  "An admin deleted this message",
  "Hi! We sent out a story post earlier this week mentioning that the scavenger hunt was cancelled due to the weather",
  "Hey! My team and I are at pomerene, where do we meet for the scavenger hunt?",
  "Hey guys due to the weather we will have to unfortunately cancel tonight’s meeting. Make sure to let your friends know for those not active in the gc",
  "Hey Guys!\n\nThis is also an amazing opportunity to explore if you're free in the 12th\n\nShowOHI/O tickets are available to get COMPLETELY FREE until 4/12! Come by to learn more about startups around Columbus, eat FREE FOOD, and network with industry professionals in the tech field as well as startup incubators like Techstars! This is something you don’t want to miss, so click the link in our Instagram bio to get your free tickets now!",
  "https://www.instagram.com/p/C5EpqFvP9Cw/?utm_source=ig_web_copy_link&igsh=MzRlODBiNWFlZA==",
  "Bain Info Session & Case Workshop:\n\nDate: April 4th\nTime: 3 – 4:30pm\nLocation: Ohio Staters Traditions Room in the Ohio Union\nDescription: Join us to learn more about Bain, the type of work we do, and what the day-to-day of consultants look like. We will also take you through a guided case to simulate what the case interview process is like and give you a better idea of how consultants approach problems!\n\nBain Coffee Chats:\n\nDate: April 5th\nTime: 9:30 – 11:30am\nLocation: Mason Hall Rooms 135 – 138\nLink to sign up here\nDescription: If you are looking to network with the OSU recruiting team and get your questions answered, don’t hesitate to sign up for a chat. Feel free to bring questions about Bain, the recruiting process, and more!\n\nWe are looking forward to being on campus and meeting you all there!! Feel free to reach out to any members of the Ohio State recruiting team if you have questions before the events!\n\nBest,\n\nThe OSU Recruiting Team\nSumitro, Katie, Pat, and Shaan",
  "Hello!\n\nAre you interested in consulting and want to learn more about what Bain consultants do? Are you looking to get some tips and tricks on the case interview process? Or, are you looking to recruit for an internship or full-time role with Bain & Co.?\n\nIf you answered yes to any of these questions, we are excited to announce that members of the Bain & Co. Ohio State recruiting team are coming to campus on April 4th and 5th to host a series of events, allowing students to learn about Bain, engage on a practice case, and get unique insights into the recruiting process. These events are open to everyone, regardless of year or major, so feel free to invite your friends that are interested in consulting! The details of both events are below:\n\n",
  "Shared a document: https://group.me/49hoQdHz2LUg1k",
  "An admin deleted this message",
  "Hi,\n\nBuckeye Bargains is an on-campus thrift shop that raises money for campus scholarships. The shop is operated by volunteers who are members of the University Women’s Club. All merchandise and workers’ time is 100% donated. They are looking to hire unpaid interns for the fall. If you are interested, please fill out the application form. The time commitment is about 3 hours a week. Applications are due Friday, March 29th. If you have any questions, please reach out to me at zutshi.6@osu.edu! Application Link: https://forms.gle/n3SWW7MTZZHcPMiX8 (https://forms.gle/n3SWW7MTZZHcPMiX8)\n\nThanks,\n\nRiya Zutshi",
  "An admin deleted this message",
  "An admin deleted this message",
  "Hey everyone, the deadline to apply to work on these projects has been extended until March 22nd! As Suvan mentioned earlier, this is an opportunity to work on projects that will have a significant impact on our partners and will help you gain skills relevant to the corporate world. \n\nAgain feel free to message me or Suvan if you have any questions.",
  "Hey guys shouting this out one more time! This is an amazing opportunity for anyone to build out a really strong project on your resume! We're going to be doing essentially everything you would in a data science job. Another bonus is that project two had a visualization portion that will be on display in thompson at the end of the project so you have a really cool way to display your work as well! ",
  "Hey BDAA!\n\nWe're thrilled to announce a collaboration between BDAA and OSU Libraries, presenting two exciting projects for this semester! These projects, designed to last approximately one month each, offer students the opportunity to participate in mini internships. Detailed project descriptions are provided in the application form. Apply ASAP for this incredible opportunity as this experience will be a valuable addition to your resume; the application closes on 3/10.\n\nApply here: https://docs.google.com/forms/d/1VIFpACywsFIhVm7sxiGWXcU-ZNHgfhV_nJPpcShWj94/edit\n\nFeel free to direct message me or Suvan if you have any questions!",
  "Good Afternoon BDAA! If you are interested in another data analytics based challenge following Data I/O, the OSU Department of Statistics and the Data Analytics Major are co-hosting ASA DataFest on April 05-07, a 26-hour data analysis challenge open to all undergraduate students in any major at OSU! Sharpen your statistical analysis and programming skills while interacting with sponsors and mentors from Columbus' rapidly growing data sectors. The registration is open from Feb 13 through April 05. Teams must be comprised of 3-5 members. \n\nVisit go.osu.edu/osudatafest or connect via Instagram @osudatafest to learn more and to register your team!\n\nIf you have questions, please email datafest@osu.edu.  \n \u2028*While it is recommended to form teams with some background in statistics or computer science, no prior experience is required to participate in DataFest. ",
  "https://medium.com/99p-labs/data-i-o-2024-recap-4f9f6fa1c6e2",
  "Thanks ",
  "I know a lot of people used GitHub for the first time yesterday! Updating your Readme.md file whenever you make a new project is always good practice. The file creates and displays notes about your project, making it easy for anyone looking at it (especially recruiters) to understand your goals and intentions! Ive linked a resource that makes it easy to write a good readme.\n\nhttps://readme.so/editor\n\nAlso, I recommend everyone link the projects they made to the project section of their LinkedIn! I have had great feedback from recruiters who have watched videos of the projects I've worked on! Here are Tyler, Frank and I's LinkedIn's as some examples of how you can post projects:\n\nhttps://www.linkedin.com/in/tjunverferth/details/projects/\nhttps://www.linkedin.com/in/lifrank1/details/projects/\nhttps://www.linkedin.com/in/suvan-dommeti/details/projects/\n\nLmk if you have any questions!",
  "My team is having trouble with our video downloading ",
  "Shared a document: https://group.me/zRUr3FOjEftW7",
  "Hey BDAA!\n\n\nReminder that the last day to sign up for Data/IO is TOMORROW Feb 23rd at 11:59pm! Data/IO is a day-long hackathon hosted in partnership with Hack/IO. The hackathon will be held in person on February 24th from 9:00 a.m. to 6 p.m. in Pomerene Hall. \n\n\nTeams of 2-4 can register at: https://forms.gle/bMBzmSoBWTcyPYLCA\n\nThis year’s event is sponsored by Honda with a first-place prize of $400. Other prizes and challenges can be found on the official website: https://hack.osu.edu/dataio/2024/\n\nThis event is open to everyone! We will be hosting workshops throughout the day covering all sorts of topics in Data Analytics/Science. On top of workshops, we will have time for students to network with Honda as well as other BDAA sponsors!\n\n\n\nFor additional information reach out to us on Instagram @BDAAOSU or email Dommeti.1@osu.edu",
  "Resubmit the form with your new team I can remove the old entry ",
  "What’s the protocol for adding a member to a Data I/O team that’s already registered ?",
  "cool data analytics opportunity through osu!!",
  "http://tinyurl.com/4wx487fa",
  "This message was deleted",
  "This message was deleted",
  "Me!",
  "i need one",
  "im down",
  "Yeah sure ",
  "This message was deleted",
  "This message was removed",
  "An admin deleted this message",
  "If you guys see me after the meeting on Tuesday I can send the recruiter your resume directly!",
  "Hey Guys!  Here's another internship that's from a company partner \n\nhttps://careers.tql.com/us/en/job/24100335/Data-Science-Analytics-Intern-Summer-2024",
  "An admin deleted this message",
  "ohiostatebdaa@gmail.com",
  "Can anyone give me the email to send the viz ?",
  "Also, U of Michigan Biostatistics is recruiting undergraduate students who are interested in quantitative studies, big data, and human health this summer for the Big Data Summer Institute. This full-time, in-person six-week summer institute will introduce undergraduate students to emerging challenges at the intersection of Big Data, Statistics, and Human Health.\n\nhttps://sph.umich.edu/bdsi/application-new.html",
  "Hi BDAA! The Interactive Data Systems Group is looking for multiple undergraduate student research assistants and summer interns for the following projects:\n \n1. Conversational Querying using Augmented and Mixed Reality \n2. Natural Language and Chat-based Interfaces to Databases using LLMs\n3. Human-Centered Computing\nMultimodal Data Management: Combining Computer Vision with Databases\n \nTasks will involve one or more of: Software Design, Prototyping, Development, Research Publication\n \nSkills required: Knowledge of one or more of the following:\nPython\nJavaScript\nSQL\nSwift\nSciPy\nOpenCV\nPyTorch\n \nThese are paid positions. Students can either start immediately, or at the beginning of summer.\n \nTo apply: please send your CV as a PDF or URL to: arnab@cse.osu.edu with the Subject line “Application for Student Research Position”\n \nMore information about Arnab and the group are at https://arnab.org.",
  "If you guys have any questions about Data/Io feel free to reach out!!",
  "Hey BDAA! The time has finally come, BDAA and Honda present Data I/O on February 24th from 9AM-6PM! This is Ohio's largest data analytics based hackathon and this year will be sponsored by Honda. Data I/O will present data challenges, experienced professional analysts as judges, and prizes for the top winners! You may form and work on a team 2-4, so start looking for team members! Register using the QR code or this link from our Linktree:\nhttps://tr.ee/-8PxMHJeue\n",
  "An admin deleted this message",
  "An admin deleted this message",
  "Hi all! I’m looking to join/create a group for Data I/O - if anyone is looking for another person, or if there are other singles looking for a group, dm me!",
  "An admin deleted this message",
  "Shared a document: https://group.me/3Vx4gPtG2JbTW2",
  "Both will work but the downloaded version offers some more features and visibility of the database.",
  "If you are planning to participate in the SQL workshop today you can either use a browser-based application or download what I’ll be using (SQL Lite Studio) in advance at this link: https://sqlitestudio.pl/",
  "💀",
  "Kay not playin 😤",
  "An admin deleted this message",
  "An admin deleted this message",
  "An admin deleted this message",
  "An admin deleted this message",
  "An admin deleted this message",
  "An admin deleted this message",
  ":(",
  "I don't think so sadly ",
  "Hi Suvan. Can non-osu student join?",
  "https://docs.google.com/forms/d/e/1FAIpQLScU6LGOTrh9130Mlyb0e1IcOFcHiRE7nc6P9wUm7xTrq5WvcA/viewform",
  "An admin deleted this message",
  "An admin deleted this message",
  "An admin deleted this message",
  "First meeting of the semester @7:30 tnight in Pomerene 260! Papa John’s provided",
  "Tuesdays!",
  "Hey! What days are the meetings on?",
  "An admin deleted this message",
  "An admin deleted this message",
  "An admin deleted this message",
  "An admin deleted this message",
  "An admin deleted this message",
  "An admin deleted this message",
  "Hey everyone, I can across this casing opportunity from JP Morgan Chase if anyone’s interested ",
  "An admin deleted this message",
  "An admin deleted this message",
  "An admin deleted this message",
  "An admin deleted this message",
  "If you want I highly doubt anyone will even notice or care",
  "Hey guys. I'm not an OSU student. Can I still join?",
  "starting next week, meetings are tuesdays at 7:30pm in Pomerene Hall room 260",
  "when? this is my first semester at osu",
  "yep, starting next week",
  "Meetings same time this semester?",
  "An admin deleted this message",
  "Kay Jiang does not play games",
  "An admin deleted this message",
  "An admin deleted this message",
  "Excuse me",
  "An admin deleted this message",
  "Hey ",
  "An admin deleted this message",
  "An admin deleted this message",
  "An admin deleted this message",
  "An admin deleted this message",
  "An admin deleted this message",
  "An admin deleted this message",
  "An admin deleted this message",
  "An admin deleted this message",
  "FINAL MEETING OF THE SEMESTER!!\nCome to Pomerene 250 tonight at 7:30 to take a break from studying, enjoy cookies and hot cocoa, and play some games to celebrate the semester. ",
  "No meeting tomorrow",
  "Is there a meeting tomorrow or next week?",
  "hoping y’all are having a happy thanksgiving !!",
  "An admin deleted this message",
  "Hi, I was wondering if you guys post slides after the workshops are over. I won’t be able to make it to today’s meeting",
  "Python and Pandas workshop tonight at 7:30 in Pomerene 260!! No experience required",
  "Ight thanks",
  "They’re generally Tuesdays from 7:30-8:30 at Pomerene 250",
  "Or where to find it ",
  "I'm new to BDAA. I was willing to know the time and of the meetings.",
  "An admin deleted this message",
  "This message was removed",
  "Hi @everyone, due to administrative issues we’ll be postponing Data I/O until spring semester. We apologize for any inconvenience this has caused but we’ll send out more information about new event dates in upcoming weeks",
  "Sure",
  "An admin deleted this message",
  "I am",
  "is anyone looking for a partner still for Data I/O?",
  "Can you fill out the form again? ",
  "We already submitted our team for Data IO. How can we add a new member (4th) ?",
  "Data vis and tableau meeting tonight at 7:30 in pomerene 250. We will have cookies and a halloween themed workshop!",
  "BDAA meeting tonight in Pomerene 260. We’ll be hearing a tech talk from the lead of Fishers Risk Institute on the use of AI and analytics to measure and mitigate risk for major corporations and social problems alike. Dinner is provided!",
  "https://forms.gle/e2uAcFnQsCZCPkQG8",
  "🚨Reminder🚨 E-Board applications due TONIGHT at 11:59 keep applying all experience is welcomed!!!",
  "An admin deleted this message",
  "https://linktr.ee/bdaaosu",
  "This message was deleted",
  "hey y’all! remember to apply to e-board!! all freshmen, sophomores and juniors quality and no prior experience needed— even if you haven’t been to BDAA in a bit, you can still apply!",
  "An admin deleted this message",
  "I have 6 acres of land in Croatia available dm me if interested",
  "An admin deleted this message",
  "Ok",
  "guys plz don’t sell tickets in this group me thx",
  "An admin deleted this message",
  "Hi, I was wondering, is there a data analytics curriculum in this club?",
  "Tonight in Pomerene 250 at 7:30 we’re having a Jeopardy games meeting to take some stress off and just hang out with some friends. Jimmy johns will be provided!",
  "Selling my season tickets can also sell individual dm if you’re interested ",
  "An admin deleted this message",
  "Selling Missouri ticket message me ",
  "Tonight at 7:30 come to Pomerene 260 and learn how to ace your next interview. Dinner will be provided! ",
  "COLLAB MEETING TONIGHT! Business Builders will be joining us and we’ll be hearing from the CEO of status followed by a Pitch Competition for a 100 dollar prize. Pizza will be provided!",
  "An admin deleted this message",
  "An admin deleted this message",
  "Hey everyone! Join us tonight for an intro to Python workshop at 7:30pm in Pomerene 260 covering one of the most popular languages on the planet! Whether you're a complete beginner or looking to refresh your skills, this session will have something for you!",
  "How much for it?",
  "An admin deleted this message",
  "Reminder that there’s sand volleyball at the courts near the rpac tonight from 6-8. Feel free to show up anytime throughout the 2 hours. And for those who are in clusters this is a chance to earn points by attending (and maybe even some bonus points for winning)!!  ",
  "accenture.com/campus",
  "hey everyone apologies for the technical issues— ive included the slide deck here ",
  "Shared a document: https://group.me/4TQEajD2yRnZC",
  "They do have 260 today we’ll be in 250 (it’s right next door)",
  "Are you sure we’re not in 250 or some other room today because I think LSS scholars has 260 today?",
  "Panda Express ",
  "Reminder! Meeting tonight @7:30 with Accenture in Pomerene 260",
  "There’s a little bit more info on what the clusters are and how to earn points on these slides. Let me know if there are any issues! ",
  "Here are the cluster groups! ",
  "https://docs.google.com/presentation/d/1XHpAOfk_EVY-ZXDNjM3jXBRJBKBH-_jclNypduv-QG8/edit",
  "We will also be introducing this semester’s cluster groups afterwards so be sure to come out if you signed up",
  "BDAA TONIGHT!!! We have the fortune 500 energy provider AEP coming in tonight at 7:30 in Pomerene 260 to talk about how they use data analytics in their day to days. So grab the frog to your toad and join us for some pizza and a great data analytics talk. ",
  "260",
  "Same room as always ",
  "What room number? ",
  "Yes it’s for everyone!",
  "Can you go even if you didn’t sign up for clusters?",
  "Don't forget about our BDAA speed dating social today in Pomerene @ 7! There will be snacks and we'll be giving away t-shirts; this is a great opportunity to see who you may want to be in a cluster with (your potential team for the upcoming scavenger hunt)!",
  "https://docs.google.com/presentation/d/1xetQXbxDqOdvYF8I-7geFtJLyi_bSEG8x_H5elfU7HE/edit?usp=sharing",
  "Hey everyone, here are the slides from tonight!",
  "Reminder that tonight is your last chance to sign up for clusters! \nhttps://docs.google.com/forms/d/e/1FAIpQLSd7-m6lRqZgPQ92W-MilxjaR2_ZU3sRP233CLo_EGRdn-0qgg/viewform?usp=sf_link",
  "Thanks! Just making sure ",
  "Oh shoot it is today ! Sorry for the miscommunication ",
  "Hi I just wanted to clarify if it was today or Thursday? On the insta post it says Thursday the 31st. Thanks! ",
  "Come to BDAA tonight in Pomerene 260 at 7:30 and we'll teach you how to build an excellent resume, develop an elevator pitch, and kick it at the career fair coming up. Raising Canes will be provided!",
  "Nope :(",
  "Will there be klondikes 👉👈",
  "Come out!!!!",
  "Reminder that we have an ICE CREAM SOCIAL in the SOUTH OVAL from 7:30 to 8:30 tonight :) Come get some free ice cream or popsicles ‼️‼️",
  "Hey guys so just wanted to lay out some rules for this chat: \nRules:\n1. No advertising of any sort without permission of BDAA (including surveys)\n2. No arguing whatsoever in this chat, if you don't have something nice to say, don't say it\n3. Please don't spam the chat and keep it related to BDAA this way people don't inadvertently mute the chat and miss important updates\n4. We are all adults so let's behave as such",
  " thank you!!",
  "This message was deleted",
  "https://docs.google.com/presentation/d/e/2PACX-1vTVeEV0QRaNuTNSh7UUsAntp5DV1A621SUuO5thU9bYh2Ez8ST0XrapEQ7wwAEPs2w5gkcibc_n3roN/pub?start=false&loop=false&delayms=3000",
  "I would also like the slides",
  "I wasn’t able to make it to the meeting last night, could anyone possibly send the slides?",
  "‼️🚨AAHHHH BDAA IS BACK🚨‼️ Come to Pomerene 260 tonight at 7:30 to learn about our plans for the semester 🥳🥰, meet everyone in the club 🧙‍♀️🦅, and get free pizza 😋 🍕",
  "@everyone hi everyone! Just wanted to let you all know about this cool opportunity: Dr. Arnab Nandi from the CSE department (an incredible and very accomplished professor btw) is teaching a first session data wrangling course this fall. There aren't any pre-requisites to the course and he brings in his years of industry expertise to teach it. It's an amazing opportunity and you can easily use some of these skills in personal projects, hackathons, and internships!",
  "Cheng.1823",
  "I relayed your school emails to the data scientist at TDAI who reached out to me w/the opportunity. I’ll follow up if there are any updates",
  "This message was deleted",
  "johnson.9254",
  "Pandrangi.10",
  "Gunawan.85",
  "prasanna.12",
  "maarikarthykeyan.1",
  "annareddy.1",
  "Habroune.3",
  "mummaneni.1",
  "drop your name.#s and I will get in contact with you guys",
  "I am also interested in the project! How can I apply?",
  "Taking part ",
  "I am also interested in",
  "Hi, I am also interested can you provide me more information to apply?",
  "Hi, I'm interested in the research project. Can you provide me with more information about the project and how to apply? ",
  "I believe so",
  "will it be at osu?",
  "@everyone hi everyone! hope your summers are going well! the college of public health is looking for an analytics focused undergrad to join a research project for the summer (asap). the PI is Professor Ayaz Hyder and the project is building a climate justice dashboard for the city of Cleveland Heights. the position will be paid— reach out to me if you’re interested!",
  "we’re getting canes tonight!",
  "yeah just message me separately and we’ll work out a time ",
  "I can’t make the meeting tonight, is there another way I can get a shirt? ",
  "Come out to Pomerene 260 tonight at 7:30 to play some jeopardy and relax before exams! This is our last meeting of the semester and we will be giving out shirts and dinner!",
  "sign up here: https://urldefense.com/v3/__https://r20.rs6.net/tn.jsp?f=001OB1XNWwlvhSmtrgQtCwFcg1a9otOglpwiWhj9qdJYrtyR5t_TeuOfKsywJUgpGgUSsoPwVykNORL8DYbVtIUYtzjbv0tZsf1-bB8Tt6PzXUzjbAE8CrN-UtCnpoBjIbWhpbJnG-qGEh8K7uM3iW2ElXO4IFHFkuOztFLWZSQhzy4qFvz8c9C0y3JWZSZJtWtyUOM_gaVry94CSR5MJS7oIRu7UXAtz5kUa4IprX22E7jTQ9G9kEOblMTazFQdLinTrmbU53F548tberMkpaK44WLMA2Ez9pZjfG-1Skw60GxiHEEG2R3v2q5BqWBfRAAj5BUxL2PH2VE1WuP5Vc_8h1nbQRK08q6XHn_UfWxdGhaGuroM473lvLKCVv93zeJ6COD8tm3PW0=&c=kaomL6Zw6VPF-4UfftrCzxX5bG1gMNY4-pLSC77ve7lQh24tWEe5OA==&ch=pU-VBRCIWJdcAUy7XJmhbCv4wHj0N9coThzDiN-bCg890ErOfVxS6Q==__;!!KGKeukY!wPonUsFIoS3zDFSjmislZb9--gZjd3qRfsYfc5CiMIgEhscBgnUGlor53ruN11VWrHKH0GalpC1WCulN$",
  "Hi everyone! Deloitte is holding their Commercial Consulting Tech Consulting 101 event this Thursday 4/13 at 5:00PM! It’ll be in CBEC Room 130 (Chemical Engineering building with the hexagon lights). This is a great opportunity to network with Deloitte recruiters and learn more about what kind of opportunities are available in the consulting space!",
  "remember to sign in at go.osu.edu/bdaasignin ",
  "tonight at 7:30 in Pomerene 260 Infoverity and past BDAA VP Libby will be coming in to talk about how they use data in their company and how our members can get involved with them! Pizza will be provided",
  "tonight in pomerene 260 at 7:30, we'll be answering any and all of your questions about pre-internship experience. panda Express will be provided! everyone should show up, I know where you live 🥳 🔥",
  "Tonight at 7:30 in Pomerene 260 we'll be hearing from an OSU alumni on his journey into a data science career. Canes will be provided!",
  "fr i can’t wait to see your moves hrushik",
  "Be sure to bring your friends and your moves!!! 🕺 💃",
  "Hi guys! Just a reminder that formal is tomorrow 7-10 at Horseshoe! Hope to see you all there. Remember to fill out this form :)\nhttps://forms.gle/HDVSQeTmwbkSZNjM9",
  "Come down to pomerene 260 tonight at 7:30 to hear from Worthington Industries and get free bdubs!",
  "Just in case you guys didn’t see. ",
  "Hi everyone, if anyone is looking to get involved with a nonprofit, SmileChild (started by OSU students & partnering w/Nationwide children’s hospital) is looking for a part time developer. I’ve attached the role description here in case anyone is interested:\n\nhttps://drive.google.com/file/d/1K7MfGUaeowuT585F8T8FejxoNtIVblur/view?usp=share_link\n\nmore details about the organization here:\n\nhttps://www.linkedin.com/company/smile-child\n\n",
  "atm it’s just a google forms but here’s the link: \n\nhttps://forms.gle/KiHGMoVhbRuZnbMt5\n",
  "Can you send the link too? I can’t access the QR code on a phone haha",
  "i’ll be attending! still figuring out my team tho",
  "Anyone Interested ",
  "Hi everyone. BDAA will be having a spring formal with IISE at Horseshoe on March 24th 7-10. Please fill out this form if you are planning on going. Hope to see you all there! https://forms.gle/HDVSQeTmwbkSZNjM9",
  "Hi everyone! I am on the advisory board for TDAI's Data Science Summer Camp (https://tdai.osu.edu/education/data-science-summer-camp). I wanted to reach out and see if any of you would be interested in being a panelist for the camp. The board is looking for passionate data analytics/statistics students who can act as role models for students, and especially young women, in middle school.\n\nThe panel is scheduled for Thursday, June 29, between 2:00 and 3:00 pm. If a panelist cannot make it in-person, we will host them virtually. Otherwise it will be in-person, in Pomerene. There will probably be 3-4 student panelists, and the aim of the event is to provide info about the data analytics/statistics majors. Let me know if anyone is interested, and I can put you in contact with Professor Turkmen! Just shoot me a message.",
  "Hi everyone! If anyone is still looking for an internship, the John Glenn College of Public Affairs here at OSU has a Data Science Summer Internship program. Professor Josh Hawley is the faculty lead and wanted us to share this excellent opportunity for you all. More details can be found here: https://glenn.osu.edu/data-analytics-internship\nThe application deadline is next week, March 15th so make sure to apply soon!",
  "yes! we're having a collab meeting with sports analytics. Papa John's will be provided ",
  "Is there a meeting tn? ",
  "looking at a wet happy hour tonight 😉 ",
  "Everyone should pull up!!!",
  "Come out to Pomerene tonight to learn about regular expressions and tesseract ocr. No experience required and food provided.",
  "Happening in Pomerene right now!",
  "https://www.instagram.com/p/Co-3uKXOoNQ/?igshid=YmMyMTA2M2Y=",
  "Happy Tuesday everyone! I know a lot of you have asked about Data Science interviews, the process, and how to go about them. Tonight we’re having Nick Singh, author of the best selling book Ace the Data Science Interview, give a talk on his journey to FB & Google! We’ll be raffling out copies of his book to 2 lucky attendees, so make sure to sign in!! As always, food will be provided so pull up 😙",
  "BDAA movie night tonight, come on out to pomerene at 7:30 to watch the social network and have some snacks with us",
  "Come out to Pomerene 260 at 7:30 tonight for an intro to machine learning and AI workshop ... or else. No coding experience needed, Donatos will be provided.",
  "Yup",
  "Are we meeting this week?",
  "yes",
  "Can I just do the hackathon by myself without a team ??? ",
  "https://discord.gg/krWvDnUAne",
  "Hey everyone if you haven't already, make sure to join the discord. The link to sign up and access to the data set will be there as soon as you join the server. Additionally, all information regarding the competition is listed there as well.",
  "https://osu.zoom.us/j/93251374969?pwd=Z0txVmtGcEN2M2xVN0dDbmxmU1U0QT09",
  "For those that can’t attend in person (there’s free food idk why u wouldn’t want to come) here is the zoom link to join ",
  "Come out to Pomerene 260 at 7:30 tonight to learn about our Honda Hackathon where the main prize is 500 dollars! No experience needed, anyone can participate!",
  "Hey everyone, interested in learning how to use one of the most popular programming languages on the planet? Join BDAA tonight at 7:30pm in Pomerene 250 for an introductory Python workshop where we'll review variables and lists before diving into loops, conditional statements, dictionaries, functions, and more!\n\nThis workshop is designed for those without any programming experience as well as those with programming experience in other languages (or those that want a Python refresher).\n\nPotbelly will be provided!",
  "^Great way to gain some practical experience in data science",
  "Please sign up as soon as possible",
  "Hi everyone! BDAA is hosting a Hackathon in collaboration with 99P Labs affiliated with Honda. We will be having a kickoff meeting on Jan 31st @7PM at Pomerene 260. In this meeting we will introduce the prompt, release the dataset, and have time to ask questions regarding the dataset to members at 99P Labs. Another reason to come is that free food will be provided!! Lastly please use the following link to sign up for the hackathon or scan QR code in the flyer, no experience is needed and people without a team can find other members at the kickoff meeting: https://forms.gle/FmhGM8vE2B2dNXbw9",
  "Come out to Pomerene 250 tonight at 7:30 for our semester kick off meeting. We'll be doing a mini visualization competition after an overview of what we have planned tonight!",
  "Okay, thank you",
  "Due to there being personal information on the resumes they are only shared with sponsors ",
  "It does not show the resumes",
  "https://bdaaosu.org/resumepool",
  "Hey, how can I access the resume pool?",
  "First one for this semester will be next Tuesday ",
  "Yes they will",
  "Will meetings this semester still be same time and location?",
  "Yep, we'll be in Pomerene 260 @ 7:30 for a study hall with Insomnia cookies!",
  "Is there a meeting today ",
  "Yes!",
  "Is it still going on?",
  "DONATOS SOCIAL RIGHT NOW!!! Come get some food and hang out!!",
  "Don't forget to join us tonight at 7:30 in Pomerene 250 to learn how to scrape websites for data with Python. We'll be covering Selenium, BeautifulSoup, and Pandas!\n\nPanda Express will be provided!!",
  "Yeah there’ll be a webscraping workshop tomorrow at Pomerene!!",
  "Is there a meeting tomorrow",
  "thanks bro you too",
  "Nope there is not everyone enjoy your break!!",
  "This message has been deleted",
  "Is there a meeting today?",
  "If you have problems getting in, let me know on slack DM, GroupMe DM, or in the group chat",
  "Or show the the flyer!!",
  "Make sure to say you’re with BDAA",
  "When u come in to ethyl",
  "Hi everyone",
  "Hellooooo everyone… OUR FORMAL IS TOMORROW on Friday, November 18th, 2022 at Ethyl & Tank Upstairs from 8-10pm! It's free, so everyone is welcome!! It's time to stop hitting the books for a night and dance to your heart’s content with BDAA!!\n\nMake sure to fill out the registration form at https://forms.gle/A6xaShrm7ongfCjU9\n\n(dress code will be semi-formal: think dresses/dress shirts/dress pants)",
  "Off topic question but has anyone ever applied for research funding before and have any useful pointers?",
  "If anyone has any questions for the Capital One talk feel free to submit them here!",
  "It’s loading now ",
  "Does this not work? It’s working on my end ",
  "https://capitalone.eightfold.ai/events/candidate?plannedEventId=w7qqGOB7",
  "So I assumed it closed ",
  "It says page not found ",
  "You beat me to texting Kay haha but YES register!! ",
  "it’ll take like 2 minutes",
  "yes!! u should totally register right now tho",
  "Can you show if you didn’t register because my plans for tonight got cancelled ",
  "Hiii everyone!! FORMAL IS IN 4 DAYS on Friday, November 18th, 2022 at Ethyl & Tank Upstairs from 8-10pm! It’s 18+ and everyone is welcome! It’s time to stop hitting the books and dance the night away with BDAA!!\n\nMake sure to fill out the registration form at https://forms.gle/A6xaShrm7ongfCjU9\n\n(dress code will be semi-formal: think dresses/dress shirts/dress pants)",
  "Cant wait! 🤩",
  "Hey guys!! Join us tomorrow at 7:30 in Pomerene 260 for our Capital One Tech Talk! It'll be an informative session where you can learn more about working in tech as a Day in the Life of a TDP and associate membership Business Resource Groups, like Women in Tech and Hispanics in Tech. This will be followed by Q&A where you’ll be able to hear more about #LifeatCapitalOne, ask questions about our exciting opportunities, and interact directly with associates, who are also OSU alums!\n\n**If you plan on attending, please register at https://capitalone.eightfold.ai/events/candidate?plannedEventId=w7qqGOB7**\n\nBob Evans Thanksgiving dinner will be provided!",
  "Selling my bedlam ,Georgia and UNC tickets at affordable price \n2294437178",
  "Hey everyone! Artificial Intelligence Club is hosting an AI Research Expo on Mon 11/14 7pm-9pm in Enarson 311 to connect students with AI research performed on campus. Learn about new discoveries in Machine Learning, Computer Vision, and their applications in fields like conversation, fairness, healthcare, autonomous driving and more! The event is open to undergraduate and graduate students. Pizza and drinks will be served. RSVP, list of labs attending, and more details here: https://go.osu.edu/aiexpo",
  "^todays slides ",
  "https://docs.google.com/presentation/d/1eDSp47NL32N641OyUs8ii6hshDsHEZe3xX90Y8US3n0/edit",
  "This message has been deleted",
  "       I’m selling TCU student section tickets and Ulca  available at affordable prices 7855041157",
  "Why are there so many bots in this chat",
  "Howdy",
  "Hi",
  "Am we ole miss versus Georgia tickets dm (617) 855-5814\n$25",
  "This message has been deleted",
  "Hi",
  "This message has been deleted",
  "Reminder! Our collaboration social at Leo’s is tonight at 7-10! Come through tonight and have a good time!! ",
  "Tickets available for sales (336) 654-7384 text me",
  "I think the student might in this group, sorry for interruption ",
  "Sorry for the interpret,  I borrowed someone’s calculator this morning on Pomerene, I can’t find the owner student when I tried to return it, if anyone know whose is it could pleas tell me",
  "Lfg get ready to boogie! 🕺💃🏻",
  "Hiii everyone, just wanted to announce again that BDAA is having a formal on November 18th at Ethyl & Tank Upstairs!! Everyone in BDAA and plus ones are welcome!! We would love to see you all there!!\n\nPlease make sure to fill out the registration form!! \nhttps://docs.google.com/forms/d/e/1FAIpQLSebpigPCEUz_zcuh-1zKAgaP42fIrhKsBAiYbgCJjR5OtyhsQ/viewform",
  "UPDATE We’re in room 250! ",
  "Hey guys, tonight's meeting is Hacking Hackathons! Learn about some hackathons offered at OSU and hear from experienced BDAA members about their past hackathon experiences! They will talk about their hackathon workflow, useful tools, and advice on collaborating. You'll also get a chance to form a team for Data I/O, if you need one!\n\nPotbelly will be provided!",
  "Hey everyone, we’ll be handing out rush t-shirts at the meeting tonight for those who met the requirements, so make sure to come through!! If you can’t make it tonight, we’ll be passing them out at next week’s meeting also!!",
  "Tickets available for sales (336) 654-7384 text me",
  "9AM Saturday, 11/5",
  "Hello everyone, what time Data I/O starts at?",
  "Has anyone here interned at Microsoft or know someone who has",
  "Hey guys! Join us tonight at 7:30 in Pomerene 260 for an internship panel and hear more about how some of our executive board members landed their internships! We have panelists with a variety of backgrounds, from software engineering to data analysts to research internships.\n\nPanda Express will be provided!",
  "Seems like awk timing but has anyone interviewed Data Science for Expedia? Lol ",
  "😂",
  "🤔",
  "This message has been deleted",
  "This message has been deleted",
  "Hey everyone, I know a lot of you were interested in our SQL workshop and weren’t able to make it to our meeting on Tuesday. It’s officially been uploaded to our youtube: link provided here https://www.youtube.com/watch?v=cLyZhEv2o_Q",
  "we’re in the process of editing and uploading rn it should be up by tomorrow morning",
  "where can I find the sql video? I can’t find it on the yt channel",
  "This message has been deleted",
  "Join on Slack -- https://join.slack.com/t/bdaa1/shared_invite/zt-uw0ava39-EhdrtQNpFSna5wMnZBTqrw",
  "all of our past workshops are on our youtube channel, from multiple years as well so feel free to check that out",
  "we’ll record the workshop and upload it onto our youtube channel! ",
  "Yea the Panda Express is through zoom too 😆",
  "is there a zoom meeting for it if we can’t make it ",
  "This message has been deleted",
  "Thanks!",
  "You don’t have to fill out their names, just the team name you created! ",
  "I go through the dataio 2022 registration form. But I don’t find the place to add your group members’ name. Does anyone know how to add it?",
  "Dang it that was really funny lol",
  "Hey guys!! Left, Right, Inner or Outer Join us tonight @ 7:30 in Pomerene 260 for an overview of SQL. We’ll cover how and why it’s useful to know SQL as a data scientist and some other tools to help kickstart your querying. Panda Express will be provided!",
  "Go register now at go.osu.edu/dataio2022registration",
  "Hi everyone! I hope you guys had a great fall break 😊 Just a reminder that Data I/O, our 1 day hackathon is happening 2.5 weeks from now!! Come with your friends to get some real-world experience with data analytics! Food & drinks will be provided, and PRIZES AWAIT!!",
  "here’s the link for the slack if anyone is interested and haven’t had the chance to join it!",
  "Join us on Slack -- it’s a faster, simpler way to work. Sign up here, from any device: https://join.slack.com/t/bdaa1/shared_invite/zt-1hzzj5k6o-G_740d2tw6GaFM9Y_yUhug",
  "it’s our day long data hackathon next month! u get to work in teams to find insights from a dataset provided by our sponsors, and there will be judging/prizes. we’ll give out more details at the meeting tonight",
  "What Data I/O is?",
  "Hey everyone!! Join us tonight @ 7:30 in Pomerene 260 for a fun pre-fall break social! Destress by playing some Kahoots and enjoying Insomnia Cookies! We will also give you a chance to form teams for Data I/O, so if you still need a team, we hope to see you there!!",
  "Created new poll 'What do you want to learn about at the workshop on Oct 18th?'",
  "Donatos Pizza\n(614) 294-5371\nhttps://maps.app.goo.gl/BaVArDKKAJcr24Lg8",
  "Is there a zoom link 😆",
  " Where’s it at",
  "DONATOS SOCIAL RIGHT NOW!! Join us in the Donatos basement for a BDAA social and free pizza!",
  "An EASY way to get a tshirt and/or a job?? 😧 Literally don’t know what could be better (if u want your resume reviewed reach out to me) ",
  "Hi all, if you weren’t able to attend the sand volleyball social and only went to 2 events, you still one more chance to get a free rush t-shirt!! Just go to the BDAA website at https://bdaaosu.org and submit your resume under the “Resume Pool” tab (you do need to make an account to do so), so you can get a free t-shirt and/or possibly even an internship or job👀",
  "Yep! Our events are open to everyone, rushing was just for T-shirts and stuff :)",
  "If I didn’t rush can I still come to the event tonight?",
  "gg",
  "Audrey no soliciting or advertising 😡😡😡🤬🤬🤬",
  "Selling my ou /tax tickets now 858 609 9654",
  "Hey guys! Join us tonight @ 7:30 in Pomerene 260 for an Intro to Python for Data Analytics using Pandas! We'll be covering the basics of Pandas needed for data analytics, followed by a quick application on real world data. Donatos will be provided!",
  "this is great, thank you so much!",
  "But u should also ask ur recruiter what kind of questions to expect since they usually always tell you ",
  "I used this link I think for a previous interview that was general data science and picked and chose based on what I thought was relevant and it turned out well. https://www.simplilearn.com/tutorials/data-science-tutorial/data-science-interview-questions",
  "Can’t say much without knowing the company/interview format but whatever you do make sure you clearly communicate your thought process when approaching the problem.",
  "hey y’all! i’m interviewing at a data science company and was wondering if any of you guys would have advice on the best way to nail a more technical interview! pls lmk bc i desperately want to get this role :))",
  "Thanks for everyone who came out to our Sand volleyball event! S/O to our special guest BRUTUS!!!",
  "Hi all, a reminder that sand volleyball is in 5 MINUTES at the RPAC courts and we have pizza!! Be there or be square!! Excited to see u all!!",
  "Hiii everyone, there is one more chance to qualify for a free \"rush\" t-shirt this week!! Come out to our Sand Volleyball Social at the courts near the RPAC at 5:45 PM for some friendly competition! Donato's will be provided",
  "WE’RE IN ROOM 260",
  " Rip Sandra Luke",
  "I have 3 NC state and Tennessee tickets for sale interested in buying DM:(509) 639-5052",
  "Lmfaooo",
  "^the stats hw/CSE projects can wait!! Lol ",
  "^^ Reminder that the social is TONIGHT!! Bring your friends and have a good time at Leo’s tonight!",
  "Org Collab Social coming up tomorrow at Leo’s!! Come through 7-10pm, hang out, meet some people from different clubs, and have a good time! This counts for the Rush T-Shirts too as a bonus!",
  "This message has been deleted",
  "Hey everyone! Here's the link to a video going over what we covered at last week's Intro to Python workshop: https://www.youtube.com/watch?v=vLbpljrQuXI. Sorry for the delay in getting the video out, I was sharing the wrong screen during the live workshop so couldn't use the recording. There are a couple things I mention in the video that I didn't during the live workshop, if you don't watch the video don't worry about it because I'll go over them at the beginning of the part 2 workshop. Thanks again to everyone that came out, it was an awesome turnout. Hopefully we'll do a part 2 (continuing where we left off) Intro to Python workshop sometime soon! And here are the slides (note: they are a work in progress): https://docs.google.com/presentation/d/1l4-8aVJT_pAyYxNBRnd_drXEXOwfTWwk1cAlg1YvDro/edit?usp=sharing",
  "There’s a class going in 250",
  "Hi everyone!! Room correction: we are in 260 tonight!!",
  "Feel free to fill out the above survey to have a say in what workshops we will hold this semester!",
  "Created new poll 'What topic do you want at the next educational workshop?'",
  "Tonight we'll be in Pomerene 250 @ 7:30!! We’re having a Parameterizing Python workshop hosted by our very own alum, Jaret Mrochek, who now works as a Data Scientist at ascena!\n\"Jupyter notebooks are amazing and it’s where my career and python journey started. However you can’t do the Tour de France on training wheels, and you can’t automate pipelines by hitting Command+Enter a hundred times. I’m lazy and I don’t want to do work – let’s be lazy together and automate a Machine Learning pipeline!\"\nPapa John's will be provided! ",
  "Thanks to everyone who came out for the python workshop tonight!! We'll definitely do more python meetings this semester so keep an eye out for those!",
  "Our class recordings will be linked on youtube! we’ll send them here (and they’ll probably get linked in our email list as well)",
  "If you can post class recordings on group me will be great I don't have slack",
  "Link to join our slack if u haven’t already!! 😉",
  "https://join.slack.com/t/bdaa1/shared_invite/zt-1exdxpah3-ZMr_IV_MYcG~m6cYOKrkhQ",
  "Yeah the slides will be posted in the slack afterwards!",
  "Are there slides if I can’t make it",
  "260! We moved to the room next door",
  "Hi which room is workshop?",
  "https://www.online-python.com/",
  "Thanks so much!",
  "Go.osu.edu/bdaasignin ",
  "It’s go.osu.edu/bdaasignin ",
  "Can someone send the qr code or something ",
  "it'll be @ 7:30 in Pomerene 250!",
  "Hey guys! Interested in learning how to use one of the most popular programming languages on the planet? Join us tonight for an Intro to Python workshop where we'll go over topics including variables, conditional statements, loops, lists, functions, and using modules/libraries. This workshop is designed for those without any programming experience as well as those with programming experience in other languages. **Potbelly will be provided!**",
  "This week it’ll be in room 250!",
  "Thanks ",
  "Pomerene",
  "Where’s the location of the meeting?",
  "Thanks ",
  "Always on Tuesday at 7:30pm in pomerene! You can always count on us for that ",
  "What time is the meeting on Tuesday? 7:30? Are they always the same time? ",
  "Yes! We will have a weekly meeting every Tuesday unless told otherwise by our eboard!!",
  "will there be a meeting Tuesday?",
  "That was me haha ",
  "Message me or ask an eboard member at the next message!!",
  "Hey everyone, someone left their water bottle at the coffee chat!!",
  "Hi all room correction but we’re in 250! Same as the flyer",
  "Free coffee! Say less!",
  "Hi everyone!! The coffee chat is tomorrow from 1-2 pm in pomerene 260!! Stop by, grab drink some coffee/tea, and come chat with us!! Excited to see you all there🤗",
  "I can check for anyone who would like me to! Just DM me!",
  "^id like to know this too",
  "Is there a way to tell if it submitted correctly? I have no idea if mine went through",
  "On this website in the subsections there’s a section called resume pool you can submit it on there",
  "https://bdaaosu.org/",
  "But we highly recommend you try to come out so you can network and it’s overall a really fun time",
  "Similar question: how do I submit to resume book ? ",
  "It’s if you want to get the tshirt",
  "No you do not",
  "Do you have to attend three rush events to be a member?",
  "I respect the grind tho 🙏",
  "Yeah let’s like keep the discussion at least somewhat tied to BDAA stuff. If you feel like something may come off as advertising or an event or something reach out to BDAA EBoard and we can approve it beforehand but otherwise this is a place to hangout and talk not to blast out ads about random stuff",
  "Hey guys so just wanted to lay out some rules for this chat: \nRules:\n1. No advertising of any sort without permission of BDAA (including surveys)\n2. No arguing whatsoever in this chat, if you don't have something nice to say, don't say it\n3. Please don't spam the chat and keep it related to BDAA this way people don't inadvertently mute the chat and miss important updates\n4. We are all adults so let's behave as such",
  "This ain’t spam ima YouTuber please give it a chance ",
  "‼️Announcement‼️\nEveryone is encouraged to watch the video above. https://youtu.be/WIQdrrR6DVw",
  "Yes of course!! It ends at 6pm ",
  "Hi!! Is it okay if i come after 5 because i have a class till 5:15",
  "Hi everyone!! Today’s the career fair and if u haven’t already, stop by the BDAA booth and sign in for it to count as an event to receive a BDAA “rush” t-shirt!!",
  "If anyone is in need of any professional attire!",
  "Woww an opportunity for professional development AND a chance to get a free t-shirt? How better can it get🤯😲",
  "Don't forget to register here: https://osu.joinhandshake.com/stu/career_fairs/32666\nHope to see you all there!",
  "Hi everyone, just a reminder that the Quantitative and Data Career Expo is TOMORROW from 2-6pm at the Ohio Union in Performance Hall (BDAA is co-sponsoring!). This is a great opportunity to network with employers coming from companies such as Abercrombie & Fitch, Huntington, Nationwide, and many more. \n\nI highly highly recommend going! Even if you aren't actively looking for an internship/job at the moment, just dropping in and checking out the vibes will make you feel a lot more comfortable for career fairs in the future. \n\nFeel free to ping me or other eboard members with any questions!",
  "Additionally, if you bring a resume we can take a look at it and give advice",
  "might have to pull up ",
  "Hey everyone! Just a reminder, today we have a resume workshop at Pomerene Hall 260 @7:30pm. In this workshop, we will help with building your resumes and give pointers on how to create the best resume and succeed at career fairs. You don't need any prior experience and again everyone is welcome. Lastly, Donatos will be provided so more incentive for you all to come!😁",
  "Has anyone here worked for Amazon?",
  "Hey guys! Thanks for those who came out to the fisher fall frenzy/ ice cream on the oval tonight. We are just getting started and looking forward to a great semester with all of you 😊 reach out to me/rest of eboard if you want to get coffee! ",
  "Couldn’t be a more perfect way to end your day of classes today, so come out and chat with us!!",
  "^^ we’ve got lots of ice cream! 🍦😋",
  "Hi all, just a reminder that the ice cream social is today at 7:30pm in the South Oval! ",
  "Hey everyone! Thanks for coming out to the meeting tonight! Ask any questions you have in here or in the slack!"
]