[
  "With the semester winding down, the top scores of the pistol competition are as follows:\n1. 82\n2. 80\n3. 78\n4-5. 73\n\nThe top 5 shooters will receive gift cards at the end of the semester.",
  "Bot be gone",
  "Another one bites the dust ",
  "An admin deleted this message",
  "Back to the lobby!",
  "An admin deleted this message",
  "This message was deleted",
  "Hey everyone!! We do have club tonight at 7pm at Converse Hall. If this is your first time, welcome! We are super excited to have you! Please arrive at 7pm so that we can get you in the class and shooting in the range as fast as possible. Come relax and shoot some targets to get your mind off of exams and homework! We look forward to seeing everyone tonight!",
  "We are off this week due to Spring Break.  See you all next week!",
  "No",
  "Will a session be held tonight?",
  "Ya we don’t do that here",
  "Guys please dont interact with the scammer",
  "An admin deleted this message",
  "This message was deleted",
  "45 minutes for each safety class starting at 7pm\nLine might be pretty long, it depends",
  "how long would it take to do the safety meeting and then shoot?",
  "Hey everyone! We do have a club meeting today at 7pm at Converse Hall! I suggest showing up a little early so you don’t have to wait in line and we can get started with the class right away for those who are new! Let us know if you have any questions!",
  "7pm for everyone ",
  "What time does the meeting usually open. Excluding the ones that need to attend the training",
  "Awesome thank you",
  "50 rounds of .22 lr",
  "I have a question regarding the boxes of ammo that we will buy. How many rounds in a box? ",
  "Richard Kelly  what's your email?",
  "If anyone is available, could they please come get me at the door thank you !￼",
  "Could someone open the door？",
  "Hey everyone! Just a reminder that class starts at 7 if you are coming for the first time this semester! We would love to see everyone there even in the terrible weather! Come relieve some stress from your hw and midterms!",
  "Yes Wednesdays at 7",
  "Meetings are only on Wednesdays am i right?",
  "Hey guy thanks again I had a great time!",
  "I have some ppl who wants to come rn if it’s not too late",
  "We are about to statt",
  "Anyone else coming for class??",
  "The one next to the Brutus statue. For the class it will be on the second floor to the left ",
  "The one with Brutus ",
  "Which door should we be looking for at 7?",
  "Please be here at 7:00. We only run as late as members attend. We do not stay open for a certain length of time.",
  "This message was deleted",
  "Up to what time today can you come shoot?",
  "Okay, thank you guys",
  "Every meeting is an initial cost of 10 dollars, if you get back in line and shoot again than the next box you buy is $5",
  "If buying additional ammo it is $5 it is the same ammo",
  "They all shoot the same round",
  "$10",
  "Is the bullet of rifle also 5 bucks a box?",
  "Yes you would need to retake the safety class at 7 Pm every student that wants to participate has to take the safety class once per semester to participate in our activities ",
  "Will I be able to take the safety class this Wednesday at 7pm?",
  "Retake every semester ",
  "Hi, I attend the club meeting about a year ago and would like to rejoin. I remember attending the safety session for new members back then. Would I need to retake it, or is my previous session still valid? Also, when would I be able to access the range?",
  "Yes DM me",
  "Should I just dm him?",
  "You might want to talk to the president @Richard Kelly ",
  "It is actually due this Sunday",
  "if it’s not urgent, come and ask at our meeting next wednesday ",
  "what’s the deadline for that?",
  "Hi, I am completing an assignment about the student organization I attended, and it requires a signature of a staff member from the organization, could someone help me out? I am very grateful for this!",
  "No safety classes are over. We usually only have one a week and it starts at 7. Sometimes if we have a lot we run multiple in a day but If you wanna shoot you have to be on time for those. You can be a few minutes late but please try to come closer to 7",
  "Safety classes will only be at 7",
  "Im also waiting outside if someone can open the door ",
  "Can someone open the door?",
  "Are you still having safety classes right now?",
  "Thanks!",
  "Every Wednesday ",
  "Every week",
  "Hi, do we have safety intro class every Wednesdays, or we only have it today?",
  "Thank you! ",
  "You are also allowed to bring people parents/friends as long as you accompany them and have your buckID",
  "As long as they have buckIDs",
  "Hey I have a question, would someone such as a research assistant (non-student) be able to go? They have a buckID & medcenter ID ",
  "Whatever works better for you they are both easy for us",
  "Do you prefer cash or Venmo?",
  "And that also means you can only use the ruger your first day as well",
  "if it’s your first time this semester you have to take the safety meeting again",
  "$10 gets you in + a box of ammo, extra ammo costs $5 a box",
  "$5 for entry fee, and $10 for two boxes of ammo",
  "Yep",
  "thank you so much you guys ",
  "So if you came one day and went through twice, you’d pay $15 total",
  "If it’s our first time this semester but we have been in previous years are we only allowed to shoot the ruger ",
  "And it’s only $10 unless you decide to go through the line again then it’s $5 for extra ammo",
  "The only fees you’ll ever pay is when you decide to shoot",
  "You only pay if you come to participate otherwise no payment is required",
  "Just verifying: we pay $10/ week that we decide to go correct? No other fee unless there’s a certain event coming up?",
  "On your second time you’re free to shoot whatever we have available",
  "If you want to try out the other stuff come again ",
  "After you finish your safety course you can come downstairs with your sheet pay your $10 and have some time on the range with our Ruger MK4’s ",
  "But only a specific gun on the day you complete the meeting",
  "Yes",
  "Yes",
  "Are we able to shoot the same day we complete our safety meeting? ",
  "Ok, thanks",
  "Cash or Venmo",
  "Cash or Venmo work",
  "cash or venmo",
  "Cash?",
  "And $10 or Venmo",
  "Ok, thanks",
  "Just your BuckId",
  "Buck ID is enough ",
  "No need to",
  "no",
  "For international students, should we take our passport with us?",
  "Thanks ",
  "There will be RSO direct you to the classroom",
  "Converse hall second floor ",
  "Yes",
  "If it’s our first time coming, we do the safety class first right? If so, where do we meet at 7? ",
  "That should be fine",
  "I’ll try to get there, but I might not be able to get there until 7:10 or 7:15 pm.  ",
  "We only have one class at 7.",
  "I meant I have to take the intro class before I can go onto the range.  What time does the last intro class end?",
  "It depends",
  "Probably 9-10ish",
  "Hey guys, what time will the last meeting be for tonight?  I have a shift that ends at 7:00 pm, then I have to drive over to the ROTC building.",
  "Yes",
  "Yes",
  "Yes",
  "Yes",
  "Is Wednesday the only day when there’s a meeting?",
  "https://groupme.com/join_group/71289728/7VKgeRiN",
  "Can some one send the link to join, the link on the insta page did not work ",
  "I stepped outside for a moment ",
  "Can someone let me in",
  "OK, thank you!",
  "Yes you can go to the range",
  "Nope",
  "Is this your first time here this semester?",
  "Do we just go straight down to the range?",
  "I'm outside",
  "I’m waiting outside as well!",
  "I got here a little early, is there anyone that would be able to let me into the building?",
  "Yup! Be there at 7:00 to take the safety class. 10$ cash or Venmo. Bring your buckID",
  "Is the club every Wednesday?",
  "Oh ok cool",
  "We will let you in to the building on pistol club days",
  "How do you access the ROTC building to the second floor? Because my friend went there and they told him he need like a special permission or membership to access that building",
  "It will be on the second floor to the left. We should be posting some signs or we will be there to guide you",
  "In what room will the training class be held?",
  "Club will be starting at 7pm. There is a good chance that no one is there yet to let you in but there should be someone there soon!!",
  "Please check the pinned comment above from Hrushi if you are new to the club or want more information on the first club!",
  "Waiting outside of Converse Hall, could someone please let me in?",
  "￼ In which floor and room will the safety class take place? ￼",
  "Yes everyone please bring your BuckID",
  "BuckID",
  "Do I need to bring my id?",
  "PLEASE REMEMBER:\nBring $10 in CASH 💵 or VENMO. These are the only accepted payment methods for each meeting.\n\nThanks,\nTreasurer",
  "Don’t worry if you can’t make it this week. Our regular safety class and club runs every week, Wednesdays 7:00 pm at Converse Hall. ",
  "Hey y’all!\nI hope everyone had a great break!\nOur first regular meeting is TOMORROW (Wednesday) at Converse Hall.\n\nAs a reminder, EVERYONE must take the safety training class once per semester.\n\nOur primary safety class starts promptly at 7:00 pm.\n\nThere will be an additional safety class for returning members only at 6:30 pm.\n\nPlease bring $10 cash or Venmo to cover your ammunition. Additional boxes of ammo are available at $5 per box after your initial box.\n\nWe look forward to seeing everyone there. Like this message if you plan on attending!\n\nThanks!",
  "Possibly depending on the turnout we might have to conduct multiple classes ",
  "How late after 7?",
  "Would I be able to arrive after 7 and still attend a safety course?",
  "Lastly, once per semester everyone will have to go through the safety course before shooting ",
  "For those that are new to pistol club, there is a $10 due every meeting you attend to cover ammunition, ear and eye protection and firearms. There is no commitment you can come to as many or as few meetings as you want.",
  "Hi everyone! Our first meeting will be next Wednesday, January 15th. 7pm at Converse Hall (ROTC building)",
  "Hello! When will Spring 2025 club meetings begin?",
  "Could some generous soul please let me in <:3",
  "The pistol competition scores for the semester are in! 1st, 2nd, and 3rd place will receive a 25 dollar gift card. 4th and 5th will receive a 10 dollar gift card. \n\nFinal Scores:\n81 by Zheng.2387\n79 by Chen.13715\n79 by Wu.5757\n77 by Metz.373\n76 by Garske.5\n\nWinners please be on the lookout for an email from pistol club. \n\nHope to have you all participate again next semester as well! \n",
  "Your school email ",
  "May I ask what the account that will send the invitation email? And when will you send it? Thank you so much!",
  "Good morning everyone! Because of finals coming up and Thanksgiving, this will be our last general meeting for the semester! For those of you who have attended a large majority of the meetings this semester, you will be invited to a private balloon shoot competition, so be on the lookout for that email. \n\nOther than that, thank you all so much for an amazing semester! We appreciate you taking the time out of your week to learn how to shoot and make memories that will last a lifetime. We look forward to seeing you next semester!\n\nPlease feel free to reach out if you are interested in becoming a range safety officer for next semester (you get to shoot for free and teach students how to shoot).",
  "@Michael Rini Yes there will be! See you there",
  "Will there be a meeting held next Wednesday still ?",
  "I forgot my watch",
  "Is the activity as usual tonight?",
  "So like you can get there at 6:30, but you'll have to wait half an hour, and hope someone is there to let you in",
  "Yea",
  "Shooting starts at 7",
  "The range opens at 7pm",
  "Well... not REALLY",
  "6:30 right",
  "I think a few weeks ago we said we wouldn't, but we changed it like last week",
  "Yes we are",
  "You guys open today?",
  "May I ask if there is someone who could let me in",
  "This message was deleted",
  "Second floor to the left",
  "What room is the safety class in?",
  "An admin deleted this message",
  "Yes still on Wednesdays at 7",
  "Hey! Are meetings still every wednesday? I thought i heard that would change when i was there last time, but i wanted to make sure",
  "Thanks ",
  "To the GroupMe? You should just be able to send the link ",
  "Am I able to add my buddy willms?",
  "Ok thanks",
  "*a better time, not another time",
  "I think recently it's been ~9ish, but don't quote me on that, someone else might have another time, and again, it depends on busyness",
  "Depends on how busy we are",
  "How late do y’all usually stay open until",
  "There's safety class every week\n\nBut I think it's over already",
  "Is there a safety class today?",
  "okie dokie",
  "Yes talk to an Rso when you’re here",
  "so if i wanna apply for RSO do i just ask? ",
  "Yes",
  "Is there pistol club tonight?",
  "Can someone let me in",
  "Got it ",
  "We are accepting no more new shooting tonight",
  "Has today’s meeting ended?",
  "Anyone inside?",
  "I had some conflicts tonight and I probably couldn’t be there until 7:30 and have not yet taken the class this semester. Any way I could still attend? If not I’ll just plan better next week. Thanks ",
  "Welcome back from break everybody!  Just wanted to remind you that the range is open tonight @ 7pm -> Converse Hall.  Training course will be taught and the rifles will be out!",
  "Nerd, you should come!",
  "I don't think I can come today, I'm gonna be really busy with homework",
  "Real",
  "Noooooo",
  "To all members,\nWe will NOT BE MEETING THIS WEEK. Please enjoy your fall break. We will see you all Oct. 15th for our next meeting. Thank you for understanding.",
  "We don’t have a set closing time. We go until the last group is done then we close",
  "Moderate",
  "How crowded is it there currently?",
  "If you come that late I cannot guarantee that you will be able to shoot. We will finish once everyone already here is finished. ",
  "im thinking of coming over at 9 pm",
  "anyways what time y'all close today? ",
  "or .22 LR :)",
  "An unorthodox stress reliever before midterms, to be sure—but when life gives you .45 ACP...",
  "I'm looking forward to tomorrow's meeting :) I think I finally have the time for it",
  "Great attacks from Jaden in this one, relentless",
  "https://v.groupme.com/71289728/2024-10-01T02:18:52Z/1bd432e1.3840x2160r0.mp4",
  "https://v.groupme.com/71289728/2024-10-01T02:18:28Z/2e2bacfa.3840x2160r0.mp4",
  "https://v.groupme.com/71289728/2024-10-01T02:18:10Z/6d52350e.3840x2160r0.mp4",
  "If you have any photos/videos, post them here",
  "https://v.groupme.com/71289728/2024-10-01T02:15:41Z/719ead94.448x256r0.mp4",
  "https://v.groupme.com/71289728/2024-10-01T02:15:29Z/2a0d539c.448x256r0.mp4",
  "Thank you so much to everyone who came out!! It was such a blasts and we hope to bring more collabs like this in the future😃",
  "Getting armored up",
  "We can take a video for you if you’d like",
  "Are we allowed to make videos on Wednesdays in the range?",
  "Yes",
  "Okay",
  "*well",
  "running late as wl",
  "Ill be a little late",
  "I know I rsvped, but I don't think I'm coming, I'm pretty busy with homework and stuff",
  "You guys still have the 22L Garand? That looks like a hoot to shoot ",
  "You will go to the church entrance that is facing the Busch House for now I’ll keep you updated if that changes",
  "Sorry for the late reminder, I Verizon has been having problems all day with their cell service",
  "Will be there late",
  "COLLAB AT 6!! If you aren’t doing anything, feel free to come out! It’s at 30 West Woodruff",
  "okie dokie 👍",
  "Trade secret 🤫 🤐",
  "btw what do you guys do with the firearms that are getting \"old\"? like the kimber 1911? ",
  "thats great",
  "The club is trying to upgrade our armory currently and will update it when we do!",
  "Thanks for input we’ll work on updating it.  ",
  "especially on range officers and armory ",
  "i took a look at the website, it needs to be updated",
  "Range will be like normal on the 2nd",
  "Will ammo be free during the event",
  "https://forms.gle/5S9FnmpS1ceXEGmk7",
  "If you are coming to the collab on Monday, I need you to fill out the Google form so we have a good head count of who is going. It’s going to be super fun so you won’t want to miss it!!!!",
  "Ah okay, I guess I'll focus on my coursework first cuz im still a freshman",
  "You’re helping run ranges all night most weeks so it’s pretty involved on Wednesday nights",
  "An admin deleted this message",
  "how much commitment is required to be an RSO? ",
  "I’m outside the building rn ",
  "Anyone inside?",
  "okay, i probably will show up later since im already a member anyways",
  "All depends on how many people show up lately it’s been between 9-10",
  "so what time today do you guys \"close\"?\nlast time it was 9pm, i remember",
  "We start @7",
  "How early can I come? I have an exam at 8 ",
  "Club meeting tonight at 7pm at Converse Hall! Looking forward to seeing everyone there!🤠",
  "Ok thank you. I do not remember the exact location but there was one apparently that had a list of restricted nations that didnt allow people to use firearms there. ",
  "It does not and let me know what ranges those bad experiences have been at so I know not to support them",
  "This message was deleted",
  "Hey RSOs i wanted to ask a quick question. A friend of mine who is a student and is international told me at ranges there may be restrictions on certain nationalities from partaking in using the firearms. Does this apply to our club too? ",
  "Awesome, see yall there tonight!",
  "there is no sign up for the class, you can just walk into the classroom",
  "Go to Converse Hall at 7 and go to second floor",
  "Awesome, will the class take place tonight? And where can we sign up for the class?",
  "Everyone must take the class once per semester",
  "Yes",
  "yes",
  "Do we have to retake the class again if this is the first time for the semester? ",
  "Ok cool!",
  "We have a member who is an advisor of a club",
  "Yes",
  "Is the club open to faculties? My professor has interest to join tomorrow ",
  "Yes we will have meetings every week on Wednesday @7 pm unless told otherwise by an executive in this chat",
  "Do we have pistol club this and next Wed?",
  "COLLAB IS NEXT MONDAY!! Fill out the form so we can get a head count of who is all going!!",
  "Hmm, didn't know that cause I left the first meeting earlt for fencing club, lol",
  "Ya it’s on a Monday not tuesday",
  "It’s on a Monday ",
  "Fencing",
  "Also, fencinf is on tuesdays. Many conflicts",
  "Dang",
  "Not EVERY Tuesday, but it kind of messed it up",
  "Damn, I really wanted to do saint Brutus, but there's these annoying scholar events that are always on Tuesdays :(",
  "Please like this message if you plan on coming and fill out the Google form above",
  "https://forms.gle/5S9FnmpS1ceXEGmk7",
  "FIRST COLLAB OF THE SEMESTER ALERT ‼️ ‼️‼️\n\nWe are super excited to announce that we willl be collaborating with Saint Brutus, a medieval club that entails armored fighting, fencing, arts and crafts, embroidery, etc. They will be coming to our club on Wednesday (10/2), and we will be going to their club on that Monday (9/30). \n\nThe event is free and all you have to do is show up! Please let us know if you are coming so we can get a head count. If you would like to fight in the armor, it is suggested that men buy a cup for protection.",
  "Literally me last week",
  "Was literally thinking about this guy just as I posted that lol ",
  "If you are going to shoot one handed you still need to be able to load and unload with both hands. I was able to do it years ago but you will have to be careful and work with an RSO to figure out what works best for you",
  "I have an injury in my left hand and this is the only activity i can think of that doesn’t require 2 hands ",
  "Yes but please ask the RSO before do so",
  "Question, is it ok for me to shoot with one hand?",
  "oh my bad, bad memory ",
  "It was the 4th meeting this semester ",
  "An admin deleted this message",
  "I can’t remember I haven’t been back out since my shoulder got screwed up",
  "I think the first meeting was like 2-3 weeks ago",
  "Was yesterday’s meeting the first meeting of the semester, or was that the week before? Seemed a lot busier then expected lol",
  "Thank you all for making Antoine's birthday a little bit more special! ",
  "A little bit of one but it’s to the door",
  "Is there currently much of a line? Might swing by",
  "The line, of course. ",
  "If we’ve been here more than once, do we join the line, or just go straight downstairs? ",
  "Meeting is still happening. Use your judgement on travel and listen to the buckeye alerts!",
  "Its really up to you to make your own judgment call based on your location ",
  "But if you live on South campus please stay indoors for more information ",
  "It's a mile away so no worries",
  "I think the class starts pretty soon tho",
  "buckeye alert says shelter in place. the shooter is at large rn pls do not be walking around campus 😭",
  "If you want",
  "so i should come?",
  "Converse hall is the official name",
  "almost there",
  "And it hasn't started yet, but probably will soon",
  "Not rpac",
  "Rotc",
  "Idk the word",
  "Has today’s session started yet? ",
  "The RPAC is closed so",
  "Entrance with Brutus wearing the military... stuff",
  "Am I still able to go or is it cancelled",
  "Now and at the ROTC building",
  "where and when is the meeting?",
  "until then imma coop up",
  "well, imma wait till they say it's okay ",
  "�",
  "its over a mile away",
  "That should not have an effect on our meeting tonight.",
  "We still have club tonight?",
  "Buckeye Alert Columbus: A shooting has occurred at 11th & High St Police are responding. Avoid the area & remain indoors. More info will be sent when available",
  "I’ve attended past club meetings, but tonight’s will be my first this semester. Am I limited only to the Ruger model pistol for tonight’s session?",
  "They have to take the safety lesson once, after that they can come at 8:30",
  "Two of my friends cannot come to the club at 7 pm to get the training 😕. Is it too late if they come around 8.30 pm?",
  "Like all the way down",
  "Downstairs",
  "Where’s that at",
  "Afterwards",
  "And you get to go to the range to shoot",
  "It's upstairs in some classroom, when You get there, someone will probably tell you where it is",
  "Is there a specific room in converse hall for the safety training? Also, where do we go after we finish that",
  "Shoot for 9 at the latest double check with someone before you head over ",
  "Maybe 10 ish",
  "What’s the latest I can show up to the range today?",
  "Just no open toed shoes",
  "I have, so I'd assume it's fine",
  "Can I wear shorts to the range?  Yes or no?",
  "Only cash or venmo",
  "No cards tho",
  "Yep",
  "And you accept both Venmo and cash?",
  "It's his birthday.\nHe still has to do safety course though",
  "Hopefully I can bring my roommate after he's done with AI club",
  "Starts at 7",
  "Hey! Looking forward to attending the meeting this week. Is the safety meeting at 7 PM @ Converse Hall or earlier?",
  "Last week we were able to end it a bit earlier, but still late",
  "Less most likely but it’s definitely been busier this year",
  "*today",
  "more or less than last week",
  "how much people are you guys expecting tomorrow? ",
  "An admin deleted this message",
  "An admin deleted this message",
  "it fits my hand really well ngl",
  "ah i see",
  "Calibre innovations just used the same conversion slide as us",
  "It is an advantage arms glock 17 conversion slide",
  "*the half-tan one ",
  "Kinda interesting, since there's not a lot of info about the model online",
  "and it was meant for the UK market",
  "So I did some research...Apparently the Glock that has .22 LR printed on the slide is a Calibre Innovations  CIP22",
  "Wednesdays 7:00 @ Converse Hall",
  "What nights are pistol club on?",
  "maybe next year for me though lol\ncuz freshman year busy af, i heard",
  "For anyone interested in becoming an RSO, I recommended attending club a few times to get a feel for our operation and understand most importantly the safety rules we practice and teach.\n\nBut the actual process is super chill. If you are interested in teaching gun safety and being a part of a team, this is the place for you.\n\nAnyone interested just ask next time you’re here!",
  "I used to work as an RSO so it was easy for me to become one but little to no experience is necessary the only thing that changes is the length of your training and trial period",
  "There is a trial period you go through and training so if you don’t have any we will teach you and get you the experience necessary if you have none",
  "How much experience is necessary to be an rso",
  "No problem ",
  "Alright, thanks!",
  "You talk to one of the RSO’s after you’re done shooting and we get the process started",
  "So how do you become an rso?",
  "Ultrasonics are d0pe. I run all my carbs thru them when they’re getting rebuilt. ",
  "Actually i have ultrasonic cleaned some part and sofar they are still ok",
  "After shooting them*",
  "Right, typically you clean firearms after cleaning them and if you’re taking apart a gas operated fire arm, hopefully you know not to leave liquid in it! (Or any firearm) ",
  "Seeing the carbon goes away in front of you",
  "Hand cleaning is still very satisfying",
  "That's true though ",
  "You need to know water is used as one of the torture tests for guns",
  "rich💀",
  "There’s an easy solution for that. Get a second dishwasher that’s used only for cleaning guns",
  "Stuck Water in gas tube could explode when fired",
  "Why would that impact a gas port? This is strictly hypothetical FYI - lots of auto parts with similar metallurgy go through dishwashers. It’s one of the most cost effective parts cleaners. ",
  "This could also cause some issues on DI guns",
  "Also probably dont want to introduce lead and gunpowder residue into the thing used to wash things you eat off of",
  "Yeah, you need to oil them after but that goes for any cleaning.",
  "Rust ",
  "Actually now that I think of it - I can’t think of a single good reason why running them thru the dishwasher wouldn’t work (plastics & woods removed)",
  "It’s definitely something that we will consider based on interest and availability. Or like griffin said you could become an Rso as well",
  "Just run em thru the dishwasher ",
  "When we clean our guns",
  "If you become an rso you can do it for free",
  "Thanks anyways",
  "I always found things like that interesting, guess I'll have to wait till I can actually buy my own firearm",
  "Unfortunate ",
  "but some youtube videos could be helpful if thats what you are looking for",
  "Sorry we don’t teach that",
  "Will we ever learn how to do something like field stripping certain firearms, or cleaning them?",
  "I've been taking them :)",
  "Take your vitamin c gummies everyone ",
  "Also Allergies ",
  "It's almost flu and cold season as well lol",
  "With everyone back on campus people are catching all sorts of stuff",
  "So I probably caught something from someone ",
  "Yeah, I've heard multiple people in my classes cough ",
  "It is very very very unlikely that a sore throat is from the range",
  "My throat is a bit sore, should I be concerned? (This happened in the past after I went to a range) ",
  "Yay pistol club!!!",
  "Fix it or replace it. Glad you had fun!",
  "I'm probably gonna try to improve my pistol accuracy next time I come...and try the lever action rifle.",
  "But other than that, I had a lot of fun today!",
  "So what will you guys do with the M&P15-22 mag that kept jamming today?",
  "@Aadil Riaz Yes",
  "Are you guys still open?? This will be my second time coming ",
  "Classroom 239",
  "I guess that would be the room",
  "That’s why I am asking ",
  "In a room with people ",
  "I am in floor 2 ",
  "Go upstairs ",
  "Hey what room is the safety training in?",
  "“Close” there have been days where we go to almost 11pm. Dw we will get everyone a chance to shoot. It should’ve be too busy today",
  "The safety class will start promptly at 7pm on the second floor of converse hall. For those who have taken the class before this semester the range will also open at 7pm but feel free to arrive earlier (6:45 at the earliest) to secure a spot towards to beginning of the meeting",
  "What time is close?",
  "Ahh okay ",
  "I just got there at like 7 on the dot, and it seemed many people were already waiting",
  "So our club only has access to the range from 7-close on Wednesday nights.  There are other ranges near Columbus that allow for memberships and gun rental but you’ll need to pay way more for that",
  "No",
  "For the safety class?",
  "7, but people seem to get there earlier",
  "Just to ask, what time is the meetings?",
  "Yep, you only hace to take 1 class per semester",
  "Also, once we do the class on Wednesday, can we only go to the range on Wednesday or any other day as well?",
  "(At least I think that's what you pay for?)",
  "Considering you're paying for the ammo I'd assume not",
  "Is there an option to buy lifetime range access",
  "And cash",
  "There's venmo",
  "For the club dues. Is it Cash or can we do Zelle or something like that.",
  "Oh okay thanks!",
  "As long as you bring your buck id",
  "A flight of stairs.",
  "Ok, and how far is it from the class to the range ",
  "Hey I just wanted to ask again. Can people who have graduated already. Come in to the meetings?",
  "But if you do the class, you'll definitely be able to go to the range afterwards",
  "Idk if it's canceled for 9/11... or something",
  "At least, I'm pretty sure",
  "Yes, and yes",
  "Is there a meeting today? Also if there is, after I go to the class can I go to the range?",
  "I wish there was tho.",
  "Till you took a bullet in the knee?",
  "This club is very fortunate to still be allowed to operate on OSU campus, given the university’s views on guns, so the safety class is important to make sure everyone knows what they’re doing and so that no one ruins things for everyone else.",
  "We used to be a proper school",
  "Not anymore atleast ",
  "Sorry about the jumpscare",
  "Nah OSU doesn’t offer such class",
  "Ohhh, no I thought he meant like a class you can take for credit",
  "Did you go to range without taking a class?",
  "You do need to take a safety class if you are a new member and retake it every semester ",
  "There’s a class???",
  "Sorry, i don’t know if I’m reading this correctly but do I need to take the class to be able to participate in the activities of this club?",
  "You can ask for a competition target ",
  "How do I join the weekly accuracy competition",
  "Yup",
  "Dope! Would my buckID get me and my s/o (graduated) in?",
  "Individual but we do have weekly accuracy competitions and a balloon shoot at the end of the semester for those who have attended the most",
  "More individual ",
  "Ayo! Trying to get a sense for how the club operates. Is this more of a team / competitive or individual come and go as you please? ",
  "I’d only do it with an unloaded, no gas, air pistol",
  "Best way to get kicked out of any range.",
  "I can do it in RDR2",
  "Looks cool but is about the most unsafe thing one could do",
  "Can anyone do this?",
  "Absolutely! They’d just have to take the class @7",
  "Can I bring my roommate this week?",
  "I might bring my roommate in the future; he's interested. But we're definitely arriving earlier!",
  "Ah okay",
  "Yes",
  "But do they have to take safety class as well?",
  "Yes as long as you present a valid buck ID",
  "Can we bring a guest to pistol club?",
  "That's a valid concern, giving what's on the news these day. ",
  "Unfortunately my dad said that people might attack me if i wear it out...since the logo's literally a target",
  "The patch design is so cool, perfect for my hat.",
  "Nvm, came back and got it",
  "What should I do?",
  "I left my backpack in the ROTC building",
  "Second floor there’s a bunch of people up there waiting",
  "Should be on the second floor",
  "Go to second floor and turn left",
  "I can't find the way to.safety class",
  "If you knock someone should be able to let you in",
  "How can i come in?",
  "Im at the brutus statue",
  "Yes",
  "Do we have to take the safety class again even if we have taken it the previous semester?",
  "Go to second floor",
  "So we just wait at the first floor for the safety class?",
  "Hi All! There is a safety class EVERY WEEK at 7:00 PM. 10$ cash or venmo at the door.\nConverse Hall",
  "Around 30-40 minutes, if I remember correctly",
  "How long the safety class will be?",
  "https://v.groupme.com/71289728/2024-09-04T22:08:25Z/5cbee1bb.1920x1080r0.mp4 https://v.groupme.com/71289728/2024-09-04T22:08:25Z/5cbee1bb.1920x1080r0.mp4",
  "OK. Thanks",
  "https://v.groupme.com/71289728/2024-09-04T22:00:19Z/6b87b379.1920x1080r0.mp4 https://v.groupme.com/71289728/2024-09-04T22:00:19Z/6b87b379.1920x1080r0.mp4",
  "https://v.groupme.com/71289728/2024-09-04T22:00:00Z/6219d879.1920x1080r0.mp4 https://v.groupme.com/71289728/2024-09-04T22:00:00Z/6219d879.1920x1080r0.mp4",
  "There's a safety corse at the start of each meeting",
  "Let's carry on the spirit of Paul Harrell and spread knowledge",
  "Thought this might be relevant...maybe https://youtu.be/M-gZuFcEu0E?feature=shared",
  "^",
  "How can I take a safety course if I missed the first one",
  "It depends. You can leave after you shoot if you like, or go back to line for another round.",
  "How long are the meetings ?",
  "But you can directly go to range today if you already completed safety lesson.",
  "Unfortunately the range doesn’t open until 7. The early class last week was for returning members. ",
  "What's the second class about?",
  "If I have already passed the safety education and just want to practice shooting today, May I arrive earlier like at 6:30?",
  "I don’t leave work until 7:00 pm.  Will there be a later class at 7:30 pm?",
  "7:00 PM at Converse Hall",
  "What time is today’s meeting? ",
  "I'm not sure if the jo lo ar was for wwii, but I DO know it was made to he shot 1 handed",
  "An interesting fact is (at least I'm pretty sure) 1 handed shooting was a lot more common wwi and wwii, even to the point of the creation of the jo lo  ar, which was specifically designed to be shot 1 handed for cavalry, and such, with a handle to pull back the slide. Though, The issue became putting in a new mag, or catching the old one",
  "@Matthew Elias One handed target shooting is at the discretion of the RSO working with you. It’s a matter of showing competence. \n\nJust ask the RSO you are with after you’ve been shooting for a bit",
  "If we’re experienced enough, are we allowed to shoot one-handed?",
  "That’s fair honestly, I’ll see yall next Wednesday then ",
  "Dylan I’m sorry to hear about your arm.  I hope you have a speedy recovery on top of that, but I think it’ll require both hands to safely experience our guns.  I would focus resting and healing.",
  "ok great",
  "It’s converse hall/rotc building on north campus.",
  "Really odd question, I screwed up my left shoulder on Thursday after an accident on my board, my left arm is in a sling, would I still be able to come shoot or is that a no go ",
  "what is adress for place. And what is the transportation info",
  "Ok👌",
  "Yes you can they would need to take the safety course if it’s their first time this semester ",
  "Can I bring my roommate to the club, he want to join it too ?",
  "Ok thank u :)",
  "Yes",
  "Do we need to bring our buck if again in wednesday",
  "Is there a separate group chat for RSO?",
  "Will it be possible to have a later class for Ofosu? Sounds like their work interupts with how early safety lessons usually are...",
  "This message was deleted",
  "What about for this kind of issue?",
  "How late you stay depends on wait times and if you have done the training or not. The first meeting you attend takes the longest because you have to take the class on top of shooting on the range. ",
  "You can be a couple minutes late though",
  "Yeah, I guess that makes sense",
  "Well if there are not many people, there will be only one class",
  "I'm just a random member, lol, nowhere near an official",
  "Cause that's just a vague memory for me",
  "I think there's like 3 or so lessons every 40 minutes? So maybe at 9? You'll have to check with whoever actually knows tho...",
  "Everyone starts with 50 rounds of ammunition, after your first time through you can buy more ammunition for $5 per 50. ",
  "Sorry, I was going to say I'm not sure",
  "Anyone can join and come shoot Wednesday at 7:00pm. All that is needed is 10 dollars cash or Venmo. There is no mandatory commitment to the club. The training classes are offered every week to try and accommodate everyone.",
  "No problem 👍",
  "What time is the latest I can get there on Wednesday, for the training.  Because I work til 7:00 pm on Wednesday.  Please answer Jacob.",
  "I will see you this Wednesday ",
  "Thanks jacob",
  "Pretty sure the fiest 50 are 10, but you can buy 100 for 15, if I remember correctly",
  "Think it's about 50, or more if you buy more",
  "How many rounds do we get to shoot? Sorry for the so many questions 😌",
  "Except for your chances to shoot at the ROTC range, I guess",
  "Mostly it's just shooting for fun, so if you miss a meeting, you don't really miss a whole ton",
  "I don't think you come to every meeting",
  "What time is the latest I can get there on Wednesday, for the training.  Because I work til 7:00 pm on Wednesday.",
  "Thanks for the quick reply jacob",
  "If I join the club do I have to come every wednesday? Or can I come whenever I get a free time",
  "It's like 40 mins or so, if I recall",
  "Yep, you'll just have to go through training",
  "Hi! I would like to join the club. Can I come this wednesday at 7 pm?",
  "Oof",
  "unfortunately, yes. ",
  "What state are you from,  California?",
  "This message was deleted",
  "but first i gotta stay on top of my assignments haha ",
  "but i hope to eventually get a chance to try the m&p15/22...to finally hold an ar with a normal grip!!!",
  "i've shot an m9 and springfield xd before, so recoil shouldn't be a problem for me. but the mk4...is a new platform for me ",
  "it's just i wanna eventually try the glock 44",
  "ok, good to know",
  "You are allowed to swap guns ",
  "Sorry idk why I can’t type tonight^^^ ",
  "With that being said you guys are allowed to swap out to request to swap which gun you want to shoot.  ",
  "After taking the class and showing you’re able to work the Mk4 pistol confidently and controllably, you will earn the privilege to shooting our larger selection of rifles and other fun pistols",
  "You can switch to other guns anytime",
  "If it’s your first meeting yes otherwise no you are more than welcome to try out the inventory ",
  "Nope! ",
  "like, we choose 1 for the meeting? ",
  "so we stick with 1 gun for the whole time? ",
  "Yep sounds good. Feel free to ask us any and all question. We’re more than happy to help",
  "Kinda random, but I've been running the proper way to load the ruger mk4 in my mind so as not to upset the instructors and I think I've got it down. It's mag, (aim, optional to aim here though), slide release, (aim if you didn't earlier), safety for loading, and safety, mag release, slide, then lock (if there's a round left), set down (ejection port up) for unloading, right? ",
  "Got it. Thank you.",
  "Never tried more than 2 boxes ",
  "Could you please tell me the max number of bullets that we can buy for each time?",
  "The second box is cheaper ",
  "That would be 15 ",
  "Can we spend 20 dollars to buy 100 rounds at once?",
  "since i didnt go this week",
  "*come",
  "wait",
  "i'll come back next week",
  "Beautiful pic😎",
  "Fr",
  "I had a ton of fun tonight! Can’t wait to come back next week",
  "I know you guys can't wait. If it's me I will feel just like what you guys did",
  "The second class is almost finish with dummy gun training ",
  "The fourth class will be starting very soon",
  "Well I hope they get you in soon lol",
  "There are many people today so it takes times",
  "No we just wait in the classroom ",
  "Did you not see the safety stuff?",
  "I know me2 but still waiting doing nothing",
  "We’re in the classroom rn",
  "I’ve been waiting almost 1h😭 when should we start?",
  "This message was deleted",
  "I will take it next time 😭",
  "wait whaaaa",
  "I didn't bring my target paper ",
  "might come a little while later....if not, next week is fine too",
  "how long do yall meeting last",
  "Thanks a lot dudes we need 30 and will arrive soon",
  "I got cash",
  "I can send zelle",
  "do anybody bring extra cash? Me and my friend just forget to bring it and don’t have Venmo, it will be so appreciated someone can lend us!!",
  "Meeting room is 239 in converse hall for the safety course tonight ",
  "Is there something we are supposed to do to buzz in?",
  "Which class room is the class in?",
  "Will tonight have range time for new people or is it just the training stuff?",
  "There will be a code at the meeting to scan",
  "How long will the meet run?",
  "Who do we Venmo?",
  "Ok thx ",
  "18 yrs old",
  "oh yeah good idea",
  "Np ",
  "How old do you have to be to attend the meeting?",
  "Thanks I'm going to high street now",
  "Or go to target and u can get cash but gotta have your card",
  "Probably one in United dairy ",
  "There is a atm in cvs on high street",
  "There are many banks on high st",
  "There should be one in connecting grounds",
  "Does anyone know where the nearest ATM is? My Venmo account dead",
  "Yes you can use a digital Buckid",
  "Can we use our online buckeye id",
  "We have tons of international students here",
  "Nope, just bring your buckid and you are good to go",
  "Ok, thanks",
  "No, just bring your buck ID",
  "I'm international students from china, does there have any problems for me to use gun?",
  "Ok",
  "Because it may be busy it’ll just be MK4s for today",
  "I mean specifically for today ",
  "I am a returner, am I allowed to use guns other than Ruger MK4?",
  "If you are a returner, show up at 6:30 so we can get you down to the range quicker because your class will be shorter ",
  "But you are not required to",
  "Also as an FYI you are allowed to bring your own ear protection, eye protection, and gloves if you have them and would like to use them.",
  "great, thtanks!",
  "Yes we have change for cash. 1s,5s,10s are recommended but we do have change to break 20s. Please refrain from 50 & 100 dollar bills.",
  "If I don’t have $10 in cash, can I bring $20 and get change?",
  "Fantastic thank you",
  "We have safety class every Wednesday ",
  "I’m unable to make it today. Will there be more safety meetings to attend?",
  "See you all this evening!",
  "Hello everyone, our first meeting is tonight at Converse Hall (ROTC Building). The entrance that we will using is the one with the Brutus Statue near the Lane Avenue parking garage. \n\nLike Richard said before, you will need 10 CASH OR VENMO!! No other forms of payment will be accepted. \nPlease wear closed toed shoes and no low cut tops.\n\nWe are excited to see all the new and returning members!",
  "An admin deleted this message",
  "Yes as long as you have a buckID you can bring a guest",
  "Can I bring my friend along with me, who is not a osu student? ",
  "Disliked “Aliana Runyon has left the group.”",
  "As stated prior if you miss the first meeting it’s alright we run the safety course every week and sometimes we run it multiple times per meeting to accommodate more people, if we decide to run it multiple times we will notify you all via the GroupMe",
  "They end at 9pm",
  "What time do the meetings end?",
  "Cool, thanks",
  "You will get to use the range the same day after the safety class at the beginning of the meeting. The safety class is only needed once per semester ",
  "One per semester, specifically.",
  "One",
  "How many safety classes do I need to attend before getting to use the range?",
  "@Peyton Eversole Absolutely!!! There is no obligation of attendance from us and we teach the safety class every week",
  "Awesome thanks",
  "There's going to be a lesson every week on firearm safety, methinks",
  "Yep",
  "If I miss this weeks meeting can I still come next week",
  "@Liam Crabtree Yes. We meet every Wednesday at 7:00 PM",
  "Is the time on Wednesday the only time you meet?",
  "That answers my question, thanks!",
  "@Gabe Harrison We have all the firearms you need. Please DO NOT bring firearms or ammo with you to club",
  "Sounds great! Are we expected to bring our own pistols, or will firearms be provided to use?",
  "Hello Everyone! Thanks for stopping by at the involvement fair it was great to meet so many of you. \n\nOur first meeting is tomorrow Wednesday 7:00 PM at Converse Hall (the ROTC building). The safety class starts promptly at 7:00 PM so please be there on time. \n\n10$ Cash or Venmo at the door covers everything you need for the night. \n\nOne safety note, do not wear low cut tops or open toed shoes!\n\nJust a reminder, absolutely no experience is necessary!!! We will work with you and teach you everything you need to know at your own pace!!\n\nWe will be running the safety class EVERY WEEK this semester! If you can’t make it this Wednesday, please feel free to come back. I expect tomorrow to be busy with so many of you showing interest.\n\nWe will be running an early class at 6:30 PM for all RETURNING members to the club just this week! ",
  "How about zelle?",
  "We accept venmo, do not accept debit/credit cards at the moment.",
  "Can you guys accept like venmo, or a debit card, or do we have to have cash, for ammo and rentals?",
  "7 pm at Converse Hall",
  "When and were is the meeting Wednesday?",
  "But personally not recommended, a bit overpriced",
  "Yes",
  "If you beat his qualifying score with an iron sight pistol on a 10m air target, i will personally pay, out of pocket, for your pistol club ammo fee for an entire semester ",
  "@Charlie If you beat his score you can go to the Olympics",
  "Do we have airsoft store in Columbus?",
  "Do we get a gift card if we beat his score",
  "Hello all new and returning members. We are happy to see all of you at the involvement fair. We will send more information in the coming days. Please hold tight while we prepare for a great semester.",
  "Or depends on the progress",
  "Hey when is the end of our meeting? Will it be 9?",
  "last year there was over 1,000 people that joined the pickleball groupme but only like 10% of them actually show up to events ",
  "It is a brand new and exciting experience",
  "I saw people shooting a gun for the first time and was scared by the gunshot, but I still see smiles on their face",
  "perfectly summarizes me",
  "This message was deleted",
  "That’s awesome!",
  "Can that many people fit into the building 🌚",
  "Unexpected but reasonable ",
  "wow almost 840 people",
  "Looking forward to seeing you guys on Wednesday!",
  "Yes we have a class before every meeting ",
  "If we can't make it to the first meeting, will there be other chances for new members to join?",
  "Wednesday 7pm Converse Hall",
  ".",
  "Would yall be able to post the first meeting info again?",
  "where is yall table located?",
  "ok",
  "Cash or Venmo",
  "how do we pay the $10? is it by cash?",
  "Thank you",
  "7pm at Converse Hall ",
  "August 28th",
  "Wednesday the 28th at 7:00 PM",
  "When is the first meeting for this semester?",
  "Yup",
  "But don’t worry. 10$ for the first 50 rounds and 5$ for subsequent boxes in the same night",
  "Is it still $10 a box?",
  "@Drew Granger Unfortunately not. For the same reason as before transporting ammo on campus is a no go with the university and unnecessary risk.",
  "Can we bring our own ammo?",
  "Can't wait to have fun with you all",
  "@Charlie Yup. Just show up to a meeting and we can get you rolling on the process",
  "@Jace Park Unfortunately not. The firearms policy on campus means all the guns used are owned by the club",
  "Come to a meeting and ask one of us",
  "How should I apply to be a RSO",
  "An admin deleted this message",
  "Nope! You do not have to be 21+",
  "Can I bring my own 22?",
  "Absolutely! You can bring a guest with you as long as you have a valid buckID",
  "Do we have to be 21?",
  "but with an valid id",
  "sure",
  "Are we allowed to bring non OSU students to shoot if they take the course ",
  "See you on 28th",
  "Thank you guys for the info! ",
  "The first class will be on Wednesday in the second week of the semester ",
  "Hey all! Hope you’re excited for the fall semester. Our first meeting will be August 28th at 7:00 PM at the ROTC Building Converse Hall.",
  "After semester starts, there will be class every Wednesday",
  "Hi when the class is going to start in coming semester?",
  "If you do get a group together I’d recommend visiting some of the public Ohio ranges if you already have firearms. It’s only $5 and you bring your own weapons/ammo/targets. However if you do not have that then LEPD, Range USA, Vance outdoors are all good options",
  "Thank you Jack for you response! :) I would be interested to come over the summer if that option becomes available ",
  "If anyone has interest and is around this summer maybe send me a dm. I would put together a groupme for like minded peeps if there is enough interest ",
  "Unfortunately there are no meetings until the fall semester",
  "I think they’re closed down once the semester ends as far as I understand. That said, and this goes for anyone, I am an older master’s student who was involved with the club briefly and I now frequently go shoot and am looking for more of a community ",
  "Hello pistol club, I was wondering if I can come on Wednesdays meetings in May or June",
  "I just saw Kevin's face as soon as I click into the photo😂",
  "https://v.groupme.com/71289728/2024-04-18T01:23:17Z/62a4c34e.1920x1080r0.mp4",
  "Competition scores are NOT ACCURATE as of 6:50pm",
  "I'm outside ",
  "Cool, do I need to bring it downstairs or is there a room on the first floor?",
  " Yup!",
  "Can I bring my scooter indoors?",
  "So much Rain ",
  "Just a reminder: todays meeting is the invite only balloon shoot. Check your email for the invite :) (was sent sunday)",
  "NROTC rifle: 461, pistol:914\nRSO rifle: 522, pistol: 1022\nClub rifle: 379, pistol: 860\n\nTotals:\nNROTC:1375\nRSO:1544\nClub:1239",
  "Hey everyone! So as you know we are competing tomorrow Wednesday the 9th against NROTC in shooting competition. We are in need of 2 people to compete in the pistol section. Selection will be based on who shows up tomorrow. If you have any questions feel free to ask.",
  "Shared a document: https://group.me/11bo68sLk6IGGG",
  "Military and law enforcement have exemptions and different rules",
  "Jaden you can absolutely take the course but as military you are not required to. All you need is your dd214 and your fee will also be waived",
  "Got mine over a year ago so I don’t remember some specifics ",
  "Nice",
  "Got mine a couple weeks ago",
  "67",
  "I think the license is about $60",
  "That also",
  "When I went I could choose between 5-10 years",
  "They then take your picture and send you your license in the mail",
  "Also if anyone would need a ride out there from campus it’s an hour drive.  I would be willing to drive a few for $",
  "Also when you go to the sheriffs office - at least here - you need to bring the money in cash, certificate of completion of the 8hr course, and ID",
  "It’s 5 years for Ohio ",
  "Last I checked you full out paperwork at the county and the they perform a background check and you pay for however long you want the license",
  "There’s an application process with the sheriff dept. There’s also an initial background investigation on your first application",
  "You still gotta make an appointment with the county and get the actual license ",
  "Soo is it you do the class then you can get your CCW? Is there anything else you gotta do?",
  "You do not need your own gun. But if you have one it is suggested you use it!",
  "I’m confirming with instructor now",
  "When I took mine my instructor let people rent a .22 from him and encouraged people to either purchase their own while providing places with good prices or borrow from family and close friends",
  "I would double check the course as when I took mine (in a different state) they made us have our own gun\n\nNote: they allowed other people in the class to volunteer their guns as well",
  "It’s possible the instructor will lend you one, but likely will need your own",
  "Do you have to have your own firearm for the course",
  "Hello all. This message is separate from Pistol Club but just wanted to gauge any interests.\n\nFor those unaware, in order to obtain a concealed carry license in Ohio you need an 8 hour basic handgun course certification. There is a course being offered in Zanesville, Ohio that will satisfy this requirement. \nApril 21 8am-4:30pm. $75. You will need to figure out your own transportation. \n\nDM me if you’re interested and I can get you in touch with the instructor ",
  "Created new poll 'Pistol Club vs NROTC attendence'",
  "Hey everyone just a reminder that Pistol Club is not having a regular meeting on april 10th, 2 teams from Pistol Club will be facing off against 2 teams from NROTC. We encourage everyone who can to come out and watch.",
  "This message was deleted",
  "Legends!!",
  "Club is hosting a friendly Competition vs ROTC club on April 10th, range will be open for returning members, but there will be no class for new members.\n",
  "Our last regular meeting is april 3rd",
  "When’s the last day of the pistol club?",
  "Yes! Meeting at 7pm at Converse Hall!",
  "Do we have meeting tonight? ",
  "Ok I'll check it out. Thanks for the info!",
  "we have a bunch of other guns including rifles. You can find it on our website",
  "For the first time it will be a Ruger mark IV",
  "What kind of pistols we shooting?",
  "💀",
  "Why is Rifle School two days long?",
  "Might actually be able to go to this…",
  "Heard great things about the firing schools! I will be going to the national matches this year if all goes as planned ",
  "Opportunity to shoot at Camp Perry - NOVICE Shooters encouraged - Shared a document: https://group.me/59swnQaLMCY5l4",
  "Sweet. We still planning to give Curtis an OSU welcome or has that been rescheduled?",
  "Thank you, you too!",
  "There will be no club this upcoming week.\nHave a fun Spring Break everybody!",
  "Did club open during the break?",
  "Hello I assume I’m late",
  "Facing Tuttle Park place",
  "The door next to a Brutus statue",
  "Which door should we come in from? ",
  "Classroom 215 i think",
  "2nd floor of converse hall :)",
  "Where is the meeting for first timers?",
  "Yes, starts at 7pm",
  "Will there be a training session tonight?",
  "Door by Brutus. Knock loud",
  "Knock ",
  "How could I get in converse hall? My BUCKID can’t access it\n",
  "Absolutely pookie!",
  "Hrushi will you be my Valentine tonight 😍",
  "Bring your valentine and make it a date!",
  "It’s that time of the week again!! Super excited to see everyone tonight! Class and the range start at 7pm at Converse Hall. Make sure to bring at least $10 cash or Venmo. Let us know if you have any questions!",
  "Is this anyones?",
  "This message was deleted",
  "Yes. As long as you’ve taken the class already",
  "Can we show up late?",
  "We got SpongeBob going on in the classroom right now. Come join us if this is your first time this semester! We are getting started now! ",
  "Hey everyone! Just a reminder that we have club tonight at 7pm at Converse Hall! It’s a beautiful day to come out to the range and have some fun with friends! \n\nMake sure to bring $10 (cash or Venmo) as well as a BuckID.\n\nWe can’t wait to see you there!😎😎",
  "Unless otherwise stated, yes. ",
  "Yes class starts at 7 at Converse Hall",
  "Is there a meeting tonight",
  "glasses are ok",
  "Is there like a dress code? I figure no open-toed shoes. But is there anything about wearing glasses?",
  "🫡",
  "For the class try to be there by 7",
  "Make sure to arrive before 19:15",
  "Yes. That also begins at 19:00",
  "Sweet! For newcomers theres a safety class too right? Will that also take place today? ",
  "It's always on Wednesday at 19:00, at Converse Hall",
  "When will the next session take place? ",
  "Wow",
  "Oh that’s mine",
  "Wow",
  "Wow",
  "Wow",
  "Mom",
  "Palindrome moment",
  "🤯",
  "Wow backwards",
  "Wow",
  "Wow",
  "Wow",
  "Wow",
  "Is this anyones?",
  "Anyone else on the way to the safety class?",
  "Next to the Brutus statue on the left side of the building",
  "Is there some specific door we have to go through ",
  "Problem is the rain. If it breaks because of the rain, then I'm screwed. Also I've had an accident on it so it may not be waterproof anymore idk",
  "Yes",
  "Can we use our own eye and ear pro?",
  "You can definitely bring a scooter if you’d like to. Also there’s parking kiosk things next to the parking lot you can use",
  "Ah, cool",
  "Lucky for me I don’t live on campus",
  "Cool just wanted to know",
  "Only club ammo is permitted on the range as a safety precaution",
  "I don’t really recommend having ammo on campus in the first place",
  "Hey if we have our own .22lr ammo can we use that or can we only use the ammo that we buy there?",
  "Okay this really helps because last time I asked the question I got confused how to register a plate. Can I bring a personal scooter into the building if it pours when I come? If it's a light drizzle I'll lock it in the back",
  "Probably easier and cheaper to find street parking and walk over if you can",
  "Oh yes they do. Dont risk it",
  "Campus parc doesn’t care after 4pm",
  "I would advise paying for parking through campusparc (app or by plate in the parking lot). They will write tickets unfortunately ",
  "It’s possible",
  "It's gonna rain all day. I'm driving, and it's fine to park there right? Won't get a ticket or some shit like it?",
  "That's the sauce",
  "Look forward to seeing everyone tonight 7:00 PM!",
  "@Matthew Always happy to field questions here in this GroupMe. For anyone unaware, intro information can always be found at our instagram, club website, and student org website.\n\nInstagram:\nhttps://www.instagram.com/osupistolclub/?hl=en\n\nClub Website:\nhttps://www.osupistolclub.com/how-to-join.html\n\nStudent org page:\nhttps://activities.osu.edu/involvement/student_organizations/find_a_student_org/?i=0e5aebc4-9905-4dfb-95f8-b160ae11e31c&l=P&c=Columbus&page=4",
  "If you have one of those numbers dm me or email the pistol club ",
  "Hey guys sorry about the delay, the winning numbers for the raffle of free ammo are: 6855552 , 6855551. ",
  "I've been tagging along in the Groupme for a bit now. Crazy people ask that every couple of days. Is there a spot the people aren't getting the information from? Student org info website, an introductory readme email? Idk seems low effort for people to not to read previous messages  but when I was interested in joining the info was buried/non-existent.",
  "Unless otherwise specified",
  "Yep every wednesday",
  "Yes 7:00pm",
  "Will there be a safety meeting today?",
  "The safety meeting (only have to attend once a semester) lasts 30 minutes, the range time is 15 minutes but you can get back in line to get go again",
  "How long is each meeting? Like an hour?",
  "7",
  "7pm",
  "And thats at 730?",
  "Yes",
  "Is Wednesday the only day the club meets weekly? ",
  "Okay thanks ",
  "Converse hall second floor. There will be a sign",
  "Where is the safety meeting this Wednesday ",
  "You have to stay with him all along, including the safety lesson",
  "Thank you all so your responses! 👏",
  "We always have safety lesson at 1:900",
  "Just make sure you bring your BuckID ",
  "I believe so",
  "Great, thank you! Will he be able to attend this Wednesday a safety course at 7pm? ",
  "Yes you can bring at most one guest ",
  "Hello everyone, somebody please confirm if I can bring a guest who is not an OSU student? Thank you! ",
  "Thanks ",
  "You can bring like a backpack if that’s what you mean, we just have people keep them along the back wall of the range so they are out of the way 👍",
  "Dumb Question: If we’re just getting out of class can we take our bags over there?",
  "If you are asking whether you can bring a guest with you and if they need to go through the safety course, then yes.",
  "you’re",
  "then your good",
  "I got training yesterday ",
  "but you have to redo the training each semester",
  "after you get the training ONCE you are free to shoot immediately",
  "if it’s your first time",
  "yes",
  "it’s",
  "Does guest have to get training before shooting?",
  "Sounds good, thank you all!",
  "We do a course every week at 7",
  "There are safety meetings every wrek",
  "they do it all the time every wednesday ",
  "We have one at every meeting",
  "just come next week",
  "If I missed the safety lecture yesterday evening, is there any way that I would be able to participate this semester or will I have to wait until next semester?",
  "Anyone open the door plzzzz",
  "We are meeting tonight in classroom 215 of converse hall. Safety meeting will begin at 7pm",
  "We are going to stick to 7:00 class time",
  "We are still deciding whether to do the early 6:30 class due to the involvement fair also being today. We will let you all know as soon as it gets figured out",
  "I think the lesson starts at 7",
  "Yeah, but I mean like should I come earlier at 6:30 pm or everyone attends the safety lecture at 7 pm no matter what",
  "Everyone needs to attend the safety lecture at the beginning of each new semester",
  "You just go once per semester",
  "Thanks, earlier for people who had attended pistol club before for the semester gun safety lecture right? Been a while",
  "7pm",
  "What time was it? I forgot",
  "Correct!",
  "So pistol club starts next week right?",
  "Sounds good!",
  "thanks",
  "Our first regular meeting is going to be Wednesday, next week",
  "or next meeting?",
  "hey when is meeting starting ",
  "Hello everyone!! We hope you had a relaxing break! Our last regular meeting of the semester is THIS WEDNESDAY and we hope to see all of you there!! \n\nBalloon shoot invites will be going out by the start of the meeting \n\nSee you Wednesday!",
  "Announcement. We wanted to make people aware we allow members to bring up to two guests with them when they come to club meets, more than two requires express permission from OSU Pistol club.  ",
  "Hey everyone! I hope y’all have been having a fantastic week so far! We have a club meeting tonight at 7pm at Converse Hall. If it’s your first time this semester, arrive at 6:45pm to attend the class. The other RSOs and I are super excited to see you guys send some rounds down range so come on out!",
  "Sure thx ",
  "https://discord.com/invite/GzAyhqsj",
  "My DC said something went wrong when scanning the code, can u provide another way to add to the dc channel ?",
  "*long trousers and court shoes recommended",
  "Hi, everyone\nI’m happy to announce that we are doing a collab event with OSU Fencing Club this week.\nOSU Fencing Club is a fun place where you can come and learn fencing!\nAnd they are inviting us to join their regular practice on Monday, which will be held at 19:00 in RPAC South Gym.\n\nDon’t worry about fees or gears as the club will be providing you with everything.\nSo, feel free to come and give it a try!",
  "Can someone open the door please ",
  "Normal time",
  "Yes",
  "Is there meeting today?",
  "An admin deleted this message",
  "Calling all gamers! As part of its mission to promote the safe use of firearms and to provide training for all citizens, the CMP has initiated the design phase of its own esports game platform, Sightline, with gameplay features participants can access right from their own homes. \n\nThis opening leap into esports, Combine 1, follows a first-person training platform, where users play from a perspective set behind rifle, pistol and shotgun firearms to simulate nine different real-life range scenarios. Download and play as much as you’d like – all free of charge!\n\nLearn more about Sightline through the CMP website at \nhttps://thecmp.org/cmps-new-sightline-esports-game-for-home-training-available-to-users-in-november",
  "Could someone open the door please?",
  "Hey everyone! Hope you all are having a wonderful week so far! We have club tonight starting at 7pm. Class will start roughly around that time as well. Come out and have fun!",
  "https://docs.google.com/spreadsheets/d/1doIN25cv31xu6RYCeZq3ulIZNkekf2T8FJa5wC_ssMU/edit#gid=375748284",
  "Hey guys! If anyone needs a penn state ticket i'm selling mine for a good price ",
  "No range nor class tonight.\n Enjoy autumn break.  ",
  "Ah I bet the 10/22s that I’ve used had the “auto-release”",
  "I see",
  "I believe if the bolt has been manually locked back that wont work. There is a much more in depth explanation here if you are interested: https://1022companion.wordpress.com/2015/04/02/how-the-1022-bolt-lockrelease-works/",
  "Can’t you also just tug on the bolt and it releases it?",
  "Additionally, ive made a diagram showing how to release a locked back bolt on the Ruger 10/22 rifles (this includes the m1 garand and g36 style rifles). Its not a very intuitive process so hopefully this helps.",
  "Hey guys. Unfortunately we wont be having a meeting next week on Wednesday, October 11th because of fall break. It appears most people are leaving campus Wednesday afternoon. To those who aren’t, I apologize for the inconvenience. We will resume normal meetings after fall break. ",
  "Thanks",
  "Oh, advisor i mean LOL",
  "Hello guys will visit today’s meeting ",
  "Yeah he still is an advisor",
  "Hi is Josh still the supervisor ?",
  "All good. We hope you feel better!!",
  "I'm probably not coming for the next few weeks",
  "The class starts right at 7 and we only do one class each week!",
  "Meetings are Wednesdays at 7pm at converse hall aka the rotc building. $10 fee can be done through Venmo as well. We will teach you everything you need to know and help you out ",
  "Make sure you wear close toed shoes and avoid loose clothes.",
  "The first time you attend you would need to sit through a safety briefing",
  "There is a $10 basic fee that covers firearm rental, shooting time, and 50 rounds of ammo.",
  "hey what’s up I saw a flyer for this club at the library, only have shot a gun once before when i was a kid and interested in joining. Am I able to go to meetings and when would they be, is there a fee, and is there anything i should know or do before i show up? Thanks",
  "Sig Sauer match at cardinal shooting center",
  "📸 Check out this posthttps://www.facebook.com/100064517331271/posts/pfbid02jP7PGg7j2rfYLVSo4YmsPphATmx5iUXWCXrXQusPNzCpCjUUjLHzDNwy1bk5RNqol/?mibextid=EBYMS6",
  "😘",
  "Ayo?",
  "🤨",
  "🧐",
  "Sec",
  "Yes I’ll be there in a sex",
  "Could someone please let me in? I left something on the range.",
  "Could someone please open the door",
  "Could someone please open the door ",
  "Hi, we are outside ",
  "Oh my I hope you feel better Hugo!! Can’t wait to see you at the club again!",
  "I don't think I can come tomorrow. I broke my collar bone and it still hurts. Plus it's far from where I'm living at",
  "Bring $10 in cash or Venmo. And wear closed toe shoes ",
  "Ok thanks",
  "Be at converse hall at 7pm on wensday for the training class. ",
  "Hey guys. I would like to join the club. What all should I bring my first time coming and what time should I be there? I have so many questions.",
  "see you all this evening",
  "Selling a ticket for rlly cheap if anyone needs",
  "Anyone wanna buy a football ticket tmr",
  "Best pic today",
  "If you've already taken class, we will still be shooting tonight at 9.  If you need to take the class, sorry... next week at 7pm",
  "Room 239",
  "Is the first box for new people free?",
  "I went to where I was directed but there was another club there. Where is the room at?",
  "Knock hard on it and you'll get in",
  "I'm new and out side the doors, is it too late to be let in?",
  "Hey so can’t make it today at that time, but will try next met.",
  "Hugo you are good",
  "Since you're new, you have to go through the safety course. So, pls arrive by 19:00",
  "Converse Hall, 19:00",
  "This message was deleted",
  "Hey, new here wanted to attend where to?",
  "Hey I'm gonna be 1 hour late, does it end on 9pm as usual?",
  "It really depends on how many people show up",
  "How long does it usually run for?",
  "The club meets here on campus in the basement of the university ROTC building Converse Hall at 7pm Wednesdays. \n\nThere is a range in the basement we share with ROTC and university pistol/rifle teams. ",
  "Go to Converse Hall (ROTC building) the range is in the basement",
  "What range do you guys go to for the club? Is there one nearby?",
  "Yes. We hold a safety course every week at 7 ",
  "Will there be a safety course available tonight?",
  "Yes",
  "Is the price the same for them? $10",
  "Yes. they still have to do the class and sign the waiver",
  "Can I bring someone who doesn’t have a buckId on Wed night? ",
  "Btw, this club is NOT labeling either side as the bad guys. Just saying.",
  "If anyone is interested. I saw a flyer in university hall",
  "Yeah I understand that ",
  "And if you choose to store your gun at someone’s house make sure you trust them and whoever they live. It will still be your gun and your responsible for it",
  "I still need to get a car before all anyway",
  "I definitely need to rely on the range USA membership before reaching 21 yrs old😂",
  "Think it through and don’t rush into anything. Don’t get yourself into a jam",
  "For me Range USA was a good thing to hold me over until I was in a situation where I could responsibly own and store my own. I personally wasn’t comfortable with storing my gun at someone else’s place so I just didn’t. But up to you",
  "Yeah put it in someone else's home is also a choice.",
  "DM someone that has their own place off campus and work out a personal arrangement.   Lots of people off campus have guns and appropriate storage.  \n\nAgree with Range USA membership, but I agree, it's not ownership.  ",
  "I am getting a membership as soon as I start my part time job here",
  "I know that but😢",
  "Range USA is my range too, value is great.",
  "If you are looking for the ability to shoot outside of pistol club you don’t need to own a gun to do it. Range USA (grove city or Lewis center) offers a membership that gives you free firearm rentals and range time. It’s only like $40 a month and pays for itself after 1-2 visits. I use this all the time",
  "Yeah honestly just wait till you can move off campus ",
  "Your best option is to just wait",
  "I know there are people breaking into cars. Just thinking of possible ways.",
  "Columbus has a lot of car break ins, I think finding a range that offers storage or waiting until you live off campus is your best option",
  "Not a good idea at all but technically allowed",
  "Definitely do not do that",
  "I think putting them inside your car and park the car off campus is also a possible way?",
  "Some ranges offer membership switch storage ",
  "I would call gun ranges and stores in columbus and see if they offer anything like that but they probably wont.",
  "Probably not it would be better to wait until you have your own place and can store them yourself",
  "Yeah, I mean store off campus ",
  "This message was deleted",
  "I think he means off campus?",
  "No. You are not allowed to have a gun on campus or carry a gun on campus at all and the school does not offer any alternative methods of firearm storage to my knowledge. ",
  "Are there any places to store guns? Since I live on campus.",
  "The City of Columbus is providing free cable gun locks at all fire stations for anyone who is interested.",
  "Thank youu",
  "No thank you for coming ",
  "Thanks for coming tonight y’all! ",
  "The 1911 iron sight is great",
  "can someone get the door pls?",
  "7",
  "When do doors open for regular club members ",
  "Where do I go if I’m here early for RSO training?",
  "Got it ",
  "Thanks for answering ",
  "That's great ",
  "Yes",
  "Venmo too",
  "I have a question about the payment, only cash is accepted? ",
  "7!",
  "Or early or later?",
  "Is the first class at 7 tonight ",
  "This wensday at 7pm",
  "I’m ngl Ive only shot a gun like once in my entire life can’t make it tonight when’s the next meeting though I just wanna learn",
  "Lines shouldn’t be as bad as last week since most have taken the class now",
  "yeah, definitely for the first meeting this semester ",
  "Was there a line last time?",
  "7pm but if you don’t want to wait in a line, come a little before to be one of the first groups out",
  "What time are we starting tomorrow?",
  "^^",
  "Just the fee for the Ohio ranges. You will have to take someone with you for privately owned ranges",
  "Purchase a range permit online then you can go to any public range I think",
  "Wolf creek ",
  "Sure. Otherwise any membership needed or do I just pay the fee when I go? ",
  "Any place that allows you to bring any targets like water melon or soda cans to shoot?",
  "I’m pretty sure Vance’s and Blackwing have an outdoor area as well",
  "Both are owned by the state and it’s a $5 fee. But yes you do need your own firearm and ammunition ",
  "But you need to bring your own gun I think",
  "Deer creek and Delaware wildlife shooting area",
  "I think you can go to some public range?",
  "Any good outdoor ranges around? Lots of indoor recommendations so far",
  "Anyone interested in going to RANGE USA this Sunday?",
  "Thanks ",
  "That's helpful ",
  "😯",
  "^^forgot to mention that thank you",
  "Be sure to go there with at least one other person because they require at least two people there if you do not bring your own firearm",
  "If for some reason you are unable to make any of the meetings on Wednesdays but would still like to learn to shoot. Your best bet is to go to a local shooting range and take a class there. Some ranges are LEPD, Range USA and Vance outdoors",
  "Got it, thanks for answering😊",
  "Yes the club only operates on Wednesday nights ",
  "Yes",
  "Are we only allowed to shoot on Wednesday nights? ",
  "Range USA, Grove city ",
  "LEPD on bethel road",
  "Any recommendations of off campus range?",
  "for ppl running late, ring this bell, and rso will come and open the door for you :)",
  "That will be perfect🥳",
  "About an hour I believe ",
  "How long will the safety training last?",
  "Ok thx",
  "Everyone does it for their first meeting too ",
  "Only the first time ",
  "Each person does it once a semester at their first meeting that semester",
  "Are safety training required for the first time or for all time",
  "Yes ",
  "Are there safety trainings each Wednesday ",
  "I can only be there after 8 so that’s why I’m asking ",
  "Yes",
  "The training starts at 7",
  "When is the latest safety training? ",
  "Can I bring my own safety glasses and ear protections?",
  "No open toed shoes or low cut tops :)",
  "Hi! Is there any requirement in terms of what we wear to the session? Like no open toe shoes and such",
  "Sure!! Thank you!!",
  "Come in through the door near the Brutus statue. Someone will let you in.",
  "Aka rotc building",
  "Converse hall",
  "Hi, can someone please confirm where is the meeting tonight?",
  "Since my schedule isn’t as open as it used to be on Wednesdays, I’ll attend tonight as a regular member, then help with the cleanup. Then we can discuss if my semester schedule affects my ability to be a proper RSO again.",
  "Didn’t expect to be reinstalling this app after I graduated in 2022. But now that I’m back for my Master’s, guess I can lend a hand a little while longer.",
  "Oh, sad to hear that. See you all this afternoon then",
  "Unfortunately, we didn’t get a table at the involvement fair. Not sure why the GroupMe link didn’t work. It should be all good to go.",
  "I did not find this club at the involvement fair and the groupme link didn't work at that time. What happened?",
  "You could check out local shooting ranges. They should teach beginner classes",
  "Thanks",
  "Venmo or cash",
  "Do you guys do card or just cash?",
  "Our club only meets on Wednesday. You have to go through our safety class to be able to shoot. I’m sorry that you have a class during that time because we would love to see you there. Hopefully you will be able to come later in the semester or maybe next semester.",
  "I won’t be able to make any of the Wednesday meetings because of a class, are there any other safety classes offered thru OSU or CPD that I might be able to take?",
  "Do we just send the email concerning the raffle to pistolclub@osu.edu",
  "Yes it’s only on Wednesday ",
  "And is it always on Wednesdays only? Do you do any other days?",
  "Yes we will have a class before shooting every week @7pm",
  "Can newcomers join next Wednesday? I can’t come tomorrow. ",
  "So it is behind the building from the entrance right?",
  "Okay good, I can lock my scooter there",
  "Yes theres one on the other side of the building",
  "Oh whoops Hrushi already said that nvm",
  "The lot is also pay by plate if you’re okay with paying for parking",
  "*then",
  "Yikes is there a bike rack instead them? I honestly do not want to risk my car getting towed or ticketed",
  "7:00pm for newcomers and 6:30pm for returning members. ",
  "What time is first meeting?",
  "I got a warning at midnight",
  "Luck of the draw ig",
  "I did it the past few semesters and got nothing ",
  "They don’t care about passes after 4 so you would be fine",
  "Nope first time I did that I got a warning at 8pm. I wouldn’t unless you want to risk a ticket ",
  "They don’t care about passes after 4 so you would be fine",
  "You would need a c pass or pay for parking ",
  "Can I just park in the parking lot or do I need a pass?",
  "Created new poll 'Are you coming to the first meeting wednesday?'",
  "Hello everyone. For those who didnt see the email, the winning raffle numbers are: 6855514, 6855517. If you did not receive the email and want to be added to the mailing list please message me. ",
  "We are working on getting everything set up now but we will be on the north oval near the jazz club tent",
  "Are you guys doing a booth this year for the involvement fair ",
  "Hello everyone, welcome back! Hopefully everyone is getting settled in for the school year ahead.\n\nWe will be having our first general member meeting on Wednesday, August 30th at 7pm at Converse Hall as usual. \n\nJust as a reminder, everyone will have to attend the firearm safety meeting before shooting as it is the beginning of the semester. This will be at 7pm, so please arrive a little earlier than that, with your Buck-ID and your $10 (cash or Venmo) to shoot! Please feel free to ask any questions, and we hope to see you all there!",
  "He flagged his hand when he dropped it too",
  "That guy dropped it like five times 😂",
  "Glock using metal mags is cursed",
  "This guy is clearly a professional ",
  "https://youtube.com/shorts/cdayNWhyo3s?feature=share",
  "It's kind of a project gun",
  "They are just standard irons but I made a new front post and filed in a grove along the top about .040\" deep so I have a little dot to aim with if I'm getting really precise",
  "When is the first meeting this semester?",
  "Are the iron sights super small?",
  "I tried shooting 80yds with my enfield the other day and man i have no clue how you can do that",
  "authentic ar pistol",
  "New holster for those who enjoy the fishing life",
  "Lmao😂😂",
  "It’s a fishtol ",
  "What the heck😂",
  "What if...?",
  "And that is why I love the p320",
  "Bad experience with Sig Sauer?",
  "Ah understandable",
  "Yeah as of now we still plan to hold our weekly meetings on Wednesdays at 7pm",
  "I might not be able to attend at that semester due to unforeseen time slot changes in a class if it's still held on Wednesday at 7pm as usual",
  "Hey is the fall 2023 semester also Wednesday and at 7pm?",
  "I went to Blackwing for mine and was very happy with it",
  "^^",
  "https://www.lepd.com",
  "Pretty sure range USA does ",
  "Does anyone know any ranges around Columbus that does training and/or CCW training?",
  "Thank you all for a great spring semester! \nCongratulations to the top three finishers in this semester’s competition!\n1- Daniel Flippo (92)\n2- Panyu Chen (83)\n3- Sean Osborn (82)\n3- Hugo Man (82)\n\nThe balloon shoot email has been sent out so be sure to check your osu email for an invite if you attended enough meetings this semester \n\nGood luck on your finals and we hope to see you all in the fall!!!",
  "Coming",
  "Can someone get the door ",
  "This is the LAST regular meeting of the semester and we hope to see you all there!! An email will go out during the meeting to those eligible for the balloon shoot. More details will be sent to the applicable people by 9pm tonight",
  "The class will begin at 7pm!",
  "6:30pm ",
  "Class is still a thing today correct? ",
  "I have a friend who wants to shoot tomorrow for the first time with the club but, won’t be able to come until 8:10 will the class run that late?",
  "Oooo she’s pretty",
  "Put a new buffer tube and stock on my 6.5",
  "If i could afford it id buy it myself",
  "I'll brew teas in range if we actually get that added to our armoury",
  "That is an iconic ww1 weapon ",
  "Fairly rare one, but a cool 22",
  "Got a pistol to request we purchase: https://www.gunbroker.com/item/980301901",
  "Let us know if you have any questions!",
  "Hello all! This message is full of updates so be sure to read the whole thing!!\n\n- the last regular meeting of the semester will be 4/12 at 7pm\n- If you have attended at least 6 meetings by then, you will receive an invitation to our balloon shoot on the 19th\n- The competition results are updated. Aim to score above a 79 to secure your gift card!! (Top 5 scores will receive one at the balloon shoot!)\n\nWe hope you all have had a great semester and we hope to see you tonight!!",
  "Hey guys, can you guys please fill out this form? It is greatly appreciated!\n\nhttps://docs.google.com/forms/d/e/1FAIpQLSd0Lk02EZzkPEq-KmYZc5uKmjGpmJ_lB5JcTX9qZ_TUP_j9rg/formResponse",
  "Just a heads up: our last regular meeting will be 4/12 followed by our invite only balloon shoot on 4/18! Thanks for a great semester ",
  "Test",
  "Can someone open the door please?",
  "That’s a smart idea ",
  "I found a cool way to display the Pistol Club patch. I super glued the loop side of the Velcro that comes with the patch to a luggage tag. Now I can display the Pistol Club patch or any other patch wherever I want.",
  "^",
  "Can someone let me in?",
  "Can someone get the door please ",
  "We hope you all had a fantabulous spring break!! We will be having a meeting tonight at 7pm and hope to see you all there. As always the safety meeting begins at 7 pm sharp for everyone new this semester. \n\nOn a positive: shirts are in!!!!!! Pickup will start today!",
  "No, we will not have a meeting this week",
  "Are clubs still open with it being spring break?",
  "Can someone open the door please?",
  "Can someone open the door please?",
  "Heya a lot of people is outside and we can't get in",
  "Hope to see you all tonight at 7!",
  "Same here plez",
  "Can someone let us in it’s raining",
  "can someone please let me in?",
  "https://docs.google.com/forms/d/e/1FAIpQLSck1P_anqCX06GDOFDtFi_QLhjwUO9NpvKG8Fhs-qipUOSSWA/viewform",
  "Hello all. Just a few updates below\n- the competition results are updated. If you have discrepancies with your results please dm me and let me know\n- this is the FINAL WEEK FOR T-SHIRT SALES!!!! The design it linked in the form below. $20 payable to the venmo at club meetings or cash (front design is our club logo)\n- please arrive to the class on time. Starts at 7pm sharp in the classroom on the second floor. Range will be open for all members starting at 7\n\nHope to see you all tonight!",
  "Could someone open the door, please?",
  "can someone let me in?",
  "Can someone let me in",
  "someone open door pls ",
  "Cool",
  "Okay then you will be okay",
  "No, something came up in the last 15 minutes, quick fix, but puts me off schedule ",
  "Is it your first time?",
  "Is it okay if I’ll be 15 minutes late or so?",
  "Hello all!!! Same as always! Safety meeting is to begin promptly at 7pm with the range opening at 7 as well\n\nFeel free to respond with any questions. See you all tonight!",
  "Yes",
  "Is the safety class at 7 ?",
  "Wednesdays at 7. ROTC building. If it’s your first time you have to go through the safety class",
  "When are meetings at?",
  "Yes I am here did you get in?",
  "Could someone open the door please ?",
  "Could someone open the door please?",
  "Can anyone come to open the door please?",
  "Ok thanks",
  "Yes but they will still need to take the course and sign a waiver",
  "May I bring a friend who is not a buckeye",
  "Meeting tonight!! \n\nIf have yet to attend the safety meeting THIS semester, one will start prompty at 7pm (no late people accepted) on the second floor of converse hall room 215\n\nFor all that have, the range will open at 7pm :)\n\nSee you all tonight!",
  "$20 through cash or venmo @ meetings. Please have all orders in by march 1st!",
  "https://docs.google.com/forms/d/e/1FAIpQLSck1P_anqCX06GDOFDtFi_QLhjwUO9NpvKG8Fhs-qipUOSSWA/viewform\nForm is updated and ready for responses!!",
  "The guys at AIM are great. They love skyline 😂",
  "Aim surplus sells good cheap ar triggers",
  "Look up Aim Surplus they’re out of Dayton and I think will let you hand pick stuff if you go to the location.  Lots of LEO trade ins",
  "A good option is to look online for LE trade-ins. You find Glocks, Sigs, and some other brands for a bit cheaper than usual.",
  "Not looking for an AR, but if y’all or anyone else has a 12 gauge (preferably Remington 870), let me know! I’d be interested.",
  "I hear hi-points are pretty sweet",
  "No but I am looking for a 9mm handgun for cheap",
  "Hey, is anyone looking for a good AR? We have some in stock that we are trying to get rid of, radical firearms, 223, flat-top, pretty standard issue $414",
  "Door, please!",
  "Wait if I still need to do the safety class for the semester is it too late to come",
  "Can someone let me in",
  "Can someone let me in",
  "Pistol club starting right now!! Come on out!!! ",
  "350 legend revolver vibes",
  "https://youtube.com/shorts/YreBKs9J6PQ?feature=share",
  "Can someone let me in",
  "If you plan on attending tonight, please arrive by 8pm :)",
  "Can someone let us in ",
  "Nvm",
  "Can someone let me in?",
  "Which room is the safety meeting at?",
  "Safety meeting (as always) is at 7pm tonight\nIf you have taken the class THIS SEMESTER just go straight to the basement ",
  "Shirt order form will be back up soon. We just had to make a few changes :)",
  "Yep!",
  "Safety class is at 7pm?",
  "Of course! ",
  "Okay thank you ",
  "Usually the class takes a while so they should be fine if they came after their class on Wednesday ",
  "How late can the safety course be run on someone’s first day, I have a friend that wants to join but he has a class that ends at 7:30pm on Wednesday ",
  "Can the T-Shirt order form be refreshed? It says that it is no longer taking any orders.",
  "Door by the brutus",
  "How do I get in the building 😂",
  "It really depends on how many people show up. If you get something to eat you should be fine",
  "I’m sorry guys that I didn’t make it, because my parents are tired from work",
  "After this week you’re free to shoot whatever ",
  "Yes. You’re required to attend the class the first meeting you go to each semester ",
  "If you did safely class last semester do you need to do it now ",
  "Also what’s the Venmo I can send money to?",
  "How late will you guys be going? I need to eat something before heading over",
  "https://forms.gle/wKHyNksMTaPDqrLa6",
  "THE WAIT IS OVER!!! T-Shirt order form is now available!!! Fill out the google form below if interested \n\nAll money must be collected before the order is placed. All orders must be placed by midnight Feb 10th\n\nSee you all tonight at 7!",
  "We have venmo not cashapp",
  "We have venmo",
  "Do we need $10 cash or can we cashapp or Venmo?",
  "L they say every week at 7pm",
  "7:00pm",
  "What time is todays meeting? ",
  "Pistol club is one of the best kept secrets on campus. You learn a ton about marksmanship and you have a blast doing it. If anyone is interested, you can become an RSO and help the club out!",
  "Looking forward to this",
  "Thx! See you all tmr evening",
  "It can vary sometimes depending on a different group that meets up there at the same time. Head to second floor and turn left down the hall out of the stairs and you’ll see a sign in front of the right room",
  "So, no specific room is assigned?",
  "Second floor of converse hall ",
  "I saw on your website that new memer must ho through safety briefing. Where should I go for tomorrow's session?",
  "Yes",
  "If i have friends who arent in this groupme can they still come ",
  "Yep! Every week at 7pm on the second floor we hold a safety meeting for all new shooters and returning members who have not attended this semester ",
  "Will there be a training session for more new members tmrw? ",
  "Converse hall. Wednesdays at 7pm",
  "Hi. Where and when is the shooting practice?",
  "6855322\n6855355",
  "Congratulations to the winners of the spring semester raffle. DM us a photo of your MATCHING ticket for one free box of ammo and rental each week!",
  "i’d still manage to miss ",
  "That’s what we call ✨a safety violation✨ lol",
  "This message has been deleted",
  "^^^",
  "Unless otherwise noted ",
  "Not an RSO but it’s every Wednesday at 7",
  "Here’s my question. When are you making a schedule so I’ll know what time to be here?",
  "I can’t wait to see you there!",
  "The raffle is tomorrow ",
  "I look forward to meeting you chaps next Wednesday!",
  "Did I miss the raffle?",
  "Thank you both for answering my questions!",
  "Yes",
  "And yes",
  "You don’t need to bring eye or ear protection unless you want to. We have enough to let you use.",
  "I am guessing that is per session?",
  "It’s free the only thing you pay for is ammo ($10)",
  "One final question. Do you guys rent out all the necessary gears?",
  "Thanks for answering!",
  "Show**",
  "That will be okay if you showed up at 1945. I’m not entirely sure about the dress code but definitely wear closed shoes.",
  "Also, do you guys have any dress codes? I saw your guys at the booth earlier today wearing red shirts and tactical pants.",
  "So, I have fencing club practice until 1930 at RPAC, so if I get to the ROTC building ASAP, I would be able to get to you guys by 1945. Would that be okay?",
  "Thank you!",
  "Yeah you can DM me or any of the other RSO’s",
  "May I ask some questions regarding the club activities?",
  "Hello, I am Chan Lee, and I wanted to join you guys! And my giveaway ticket number is 6855391.",
  "Ayo WHAT😭",
  "https://www.legislature.ohio.gov/download?key=6359&format=pdf Heres the bill if you want to read it. (IANAL)",
  "Its a misdemeanor ",
  "^ especially since we have multiple nearby that you can drive to pretty easily",
  "My recommendation?  If anyone has any personal firearms they want to shoot, make a separate group chat and figure out a range trip (not to OSU Pistol club) ",
  "Class 1 felony ",
  "Yeah good luck to whoever makes that decision 😂",
  "You’re not allowed to have them on campus anyway lol",
  "Just don’t.",
  "Has anyone ever tried to bring their own?",
  "Do not bring your own personal firearms or ammo. We will supply both of those and we do not allow outside firearms or ammo. ",
  "You have to use the club’s firearms.",
  "Do we have to use the club’s firearms? Or how does that work? ",
  "I will be at the front to let people in for the time being so you won’t have to worry about waiting outside",
  "Hi! I’m trying to get into converse hall and the door is locked. Could someone please let me in!",
  "I was told to tell everyone it’s room 215 ",
  "Just a clarification of club structure because I have been getting a few questions. \n\nWe are NOT affiliated with the rifle and pistol varsity teams. We just use the same range. Anyone that attends a meeting is considered a general member of the pistol club. \nRSOs are officers for the club that have training to teach others and we have a Eboard that helps run the club. \n\nTo be an RSO all you have to do is ask one of us and we will start you on the training path",
  "Yup! First time attendees each semester will use the Ruger MK IVs and will be able to pick at their next meeting.",
  "I'm guessing we're only able to shoot the rugers after the safety meeting right?",
  "@Rio Ellison \nSafety meeting is around 30-45 mins. Actual shooting goes in rounds of 15 mins (so it all depends on when you show up)",
  "Awesome thanks!",
  "@Rio Ellison we will not be at the booth tomorrow but we will be there Thursday ",
  "Also, will there be a booth for the club for tomorrow’s Involvement Fair?",
  "Hey @Kimberly Davis! How long will tomorrow’s meeting last? Not sure how much of my evening class will overlap with the meeting.",
  "Hello all,\n\nTomorrow night will be the first meeting of the semester. Starting promptly at 7pm we will be holding a general safety class (for all members). At 6:30 pm we will be holding the first safety meeting for RETURNING MEMBERS ONLY. \n\nPlease remember closed toed shoes, no food, buckid, and $10 (cash or venmo) \n\nIf you have any questions feel free to reach out!",
  "https://docs.google.com/forms/d/e/1FAIpQLSdMeNGGtT6QY1TC6RRCLZJ5Dgf2Vkl5H3kXF7iCZ3zSMtQZVg/viewform",
  "Hey guys! If anyone has any thoughts, suggestions or any comments about the club feel free to fill the anonymous survey! We appreciate the support and can’t wait to see everyone again at our first meeting of the semester next Wednesday, Jan 18th at 7pm! ",
  "No first meeting is next week ",
  "Hey is there a safety class @ 7 tonight?",
  "I wish i bought an sks when they were 299",
  "Yup ,and to my surprise when I got it, thats the original wood on it",
  "Norinco 56? I got one too, still have the original wood.",
  "Just gotta duct tape a PEQ-15 on it and it will be complete ",
  "The scope is lowkey cursed on that, still cool tho",
  "Yeah, it was my grandpa's and he gave it to me before he left. Had to replace the bolt and pin but it runs great ",
  "Rifle is fine",
  "SKS? ",
  "Pog?",
  "This message has been deleted",
  "This message has been deleted",
  "Thought I’d repost. - https://www.linkedin.com/posts/lionesstactics_proud-selfdefense-selfdefenseforwomen-activity-7017642146002345984-npnw?utm_source=share&utm_medium=member_ios",
  "Ever heard of the Remington E-tronix system",
  "Eta?",
  "Anyone here ever heard of a Voere laser bolt? https://www.voere.com/en/history/laser-ignition.html",
  "Steel jacketed 300 PRC doesn't even scratch it",
  "The one in the pic is on its 3rd painting",
  "Nah man theese are bulletproof",
  "It’ll last a really long time unless you use it incorrectly",
  "To me, $30 seems like a lot for something you’re going to destroy.",
  "Or something else to shoot at that doesn’t cost a bunch of money.",
  "You can get used target plates?",
  "Why not get a used one. You’re just shooting at it anyways.",
  "No, that's the regular price",
  "A few varieties if anyone is in the market",
  "https://www.ruralking.com/catalogsearch/result/?&q=Ar500&rows=24&view=grid&start=0",
  "Damn they running a sale? ",
  "Just got a 9\" AR500 going from rural king, I literally cannot believe how much fun this thing is, best $30 I've ever spent",
  "http://speedy-essays.gq - US-incorporated custom paper writing service",
  "http://speedy-essays.ga - Getting professional academic help from us is easy - Get your custom written paper done for you in 4 simple steps - Fill in the order form - Calculate the price - Submit payment details - Get your paper done",
  "http://speedy-essays.ga - US-incorporated custom paper writing service",
  "We are currently planning on holding the first meeting of the semester on Wednesday, January 18th at 7:00 P.M.",
  "When is first meeting this semester?",
  "This message has been deleted",
  "http://extraessays.gq - cool writing service",
  "Good job!",
  "If it isn’t difficult it isn’t worth doing. Keep it up!",
  "Thanks, it took a lot of work ",
  "Awesome hit",
  "That was an awesome clip ",
  "That’s ice cold @Gustav Barnes  🥶🥶",
  "🎶\nYou better watch out.\nYou better not cry.\nYou better not pout,\nI’m telling you why:\nGustav Barnes is holding a gun\n🎶",
  "https://youtu.be/VwU8UawuC8A",
  "Made a little video of my furthest shot to date. ",
  "http://extraessays.gq - A custom academic writing service provider with over a decade of extensive experience in the academic and business writing service domain",
  "me too",
  "Saw it on LinkedIn",
  "Thought I should share this,",
  "No go away ",
  "Could someone let me in please",
  "Correct",
  "We're gonna forfeit but I've gotta come back for the top 3 reward don't I ",
  "Logan said we were out regardless 💀",
  "Double elimination 😂",
  "@Nate Long We’re still in btw lmao",
  "Yeah we did don't tell me were still in",
  "@Logan Salatin @Dylan Hunter did you leave?",
  "Anyone invited to the ballon shoot still coming",
  "Just a reminder: Tonight is an INVITE ONLY event. Thank you all for a great semester and we will be in touch with the start date for spring semester soon!",
  "I wanted to push this out to you guys. Kyle Morgan is a former Delta Force operator. I had the pleasure of training with this guy and got to learn a lot about his story. I know the podcast is long but it’s important to take the time to learn and understand what our service members sacrifice for our safety and freedom. \n\nHappy Thanksgiving and I hope you all are having a lovely break!",
  "https://youtube.com/watch?v=3IyCgm_vyOE&feature=share",
  "Remington ultra MUG",
  "An ode to 300 R.U.M.",
  "Congrats to the three winners! Some good scores right there. Gives the rest of us something to work for! Thank you everyone for coming. ",
  "Balloon shoot email will be going out sometime tomorrow so be on the lookout!",
  "smith.13045\t(87)\nseng.28\t        (84)\nhunter.1136\t(82)",
  "Hello All!!! \nWe hope you are having a fantastic break and we hope you had a great fall semester with us Wednesday nights. The Pistol Competition is finalized and posted on our website so check it out. The top 3 are as follows:",
  "^",
  "Can someone get the door pls",
  "Can someone let me in pls",
  "Negative ",
  "Does anyone remember this person?",
  "This message has been deleted",
  "Someone get the door please",
  "May someone open the door please",
  "It’s cold as shit outside is someone available to open the door",
  "Christmas targets?",
  "HAPPY WEDNESDAY EVERYBODY!!!\nI hope you are having a great end of the semester and we cant wait to see you for our LAST REGULAR MEETING!!\nTonight 7pm as always ",
  "(Its tomorrow) ",
  "Created new poll 'Last public meeting of the semester! Will you be there?'",
  "Can someone let me in please",
  "Can someone let me in ?",
  "can you please let me in",
  "Reminder! Meeting tonight at 7pm\nWe will be closing the main door at 8:15. So if you want to shoot please arrive before then\n\nSafety class at 7 on the second floor. If you have any questions please reach out :)\n\nHope to see you all there!!",
  "What day?",
  "Where is it for?",
  "Anybody interested in buying paintball fighting all day pass tickets for $40",
  "Meeting day* not last day. My b",
  "Update on the last official day of fall semester: \n\nDue to thanksgiving break being the 23rd, the last regular meeting of the semester will be 11/16 at 7 pm\n\nWe will be holding an INVITE ONLY balloon shoot on 11/30 and will have the invitations out before thanksgiving break\n\nIts been a great semester so far and we cant wait to see on all Wednesday!",
  "Someone open the door please",
  "Can some one let me in",
  "Meeting tonight at 7pm! \nMandatory saftey meeting (1x per semester) will be held in a classroom on the second floor as always. \nFor those keeping up with the competition, the spreadsheet posted on the website is updated. The top THREE people will receive gift cards.\n\nSee you all tonight!",
  "DM’d you",
  "You’re going to go over proper range safety and etiquette in the class, fill out some waivers, and also learn how to properly handle a pistol. You’ll be limited to our Ruger Mark IV for this week but you can shoot whatever you want next week.",
  "Ok sounds good, thank you",
  "Bring your BuckID and a pen, there will be a safety class at Converse Hall 215 (I believe that’s the right classroom)",
  "Its all good I wasn’t looking to hold a spot in line lol just trying to get some info ",
  "We don’t really hold spots in line. It’s first come first serve and the Venmo you use will be posted when you pay. ",
  "Do I need to fill out any paperwork or bring ID?",
  "Ok",
  "Yes",
  "Just show up Wednesday @7",
  "Ok sounds good, is the next meeting tomorrow?",
  "You only venmo whenever you come and shoot for ammo and eye/earpro ",
  "Hey guys, my name is Matt, I just got back from an ROTC event and kinda sucked at shooting, this looks like the place to get better, who do I venmo to be able to  join the club?",
  "#glorifiedgarand",
  "Better than the M1A/M14 at least",
  "More like FN FAIL",
  "FAL supremacy ",
  "Too poor :((",
  "Need FAL",
  "https://ifunny.co/video/In2YJL7w9?s=cl",
  "Happy FAL Friday everyone",
  "Hey, could someone get the door for me? 🙂",
  "can someone get the door pls ",
  "east*",
  "there’s 4 of us are at the west door",
  "i’m outside if any one can let me in",
  "Yes",
  "7 at rotc tonight? ",
  "Created new poll 'Coming to meeting tonight?'",
  "can someone open the door please ",
  "Can someone open the door?",
  "Can I get let in?",
  "Can someone let me in",
  "Without pens, I don't see the point",
  "We should have enough pens for everyone but feel free to bring one",
  "Bring a pen/pencil",
  "Do we need to bring anything to the safety meeting?",
  "If you are coming to the safety meeting try to arrive by 7. I will start promptly at 7:15 and once I start I cover important content. If you come late you’ll have to come another week because you can’t miss that content. Thanks!",
  "Reminder about the meeting tonight: 7pm in the basement of converse hall. If you have yet to attend a safety meeting this semester, that will begin promptly at 7:15 on the second floor. Score a 76 on the pistol competition this week to enter the top five! \n\nWe hope to see you there! 🎯",
  "Only actual purpose i can think of is for subsonic suppressed use where it would perform better ",
  "THATS WHAT IM SAYIN!!!",
  "Read this ",
  "https://nebula.wsimg.com/479b61ac5754635b087ca4b14aa727c4?AccessKeyId=D0DCC35FC05D0FC60556&disposition=0&alloworigin=1",
  "Created new poll 'Settle a debate for me'",
  "Not long",
  "Thinking about attending tonight. How long is the line looking?",
  "It varies. If you’ve already taken the class maybe hour ish, if you need to take the class probably around 2 hours ",
  "How long will the meeting last tonight?",
  "Today we can go to gun range ",
  "Doooh! That's funny Ryan!\n\nAs a Student Life sponsored club we are inclusive of  all University Affiliated members ( even dead ones) ",
  "Boooo….. the targets might be a little less scary :)",
  "No it’s just a picture of @Kimberly Davis ",
  "is it zombies 👁 ",
  "Might be too spooky for me. @Richard Kelly Can you hold my hand",
  "If you are still in town for fall break and want some stress relief post midterms JOIN US! \nTonight 7pm in the basement of converse hall\n\nWe are trying out some new targets that are a little spooky 👻",
  "Yes! Same time same place",
  "Are we meeting this week with fall break?",
  "Heck yeah",
  "BRNO",
  "Wait what",
  "Had Persian lettering ",
  "Ah I think I know the one you’re talking about, it was just labelled K98 on the side of the receiver.  No crest.  Probably Spanish civil war",
  "Thinking back i think its actually a czech mauser they mislabeled",
  "It wasnt sporterized. Can’t remember if it did or not ",
  "Recall if it had the Polish crest still?  Sporterized?",
  "The finish was pretty worn but the rifling looked ok from first glance. The m48s were like brand new but had kinda crappy fitting wood",
  "Guess I’m making a trip to cabelas lol",
  "Welrod supremacy for life",
  "Any garbage rod > mauser",
  "Five hunnid",
  "How much was the pole laddy ",
  "Cabelas had a polish, spanish, and yugslav mauser if anyones interested in that",
  "The competition is every week you can just pick up the comp target with your normal paper target and spend 10 of your rounds on it while you're shooting",
  "How often are there competitions?",
  "Clothing line I started use code PISTOLCLUB for discount  ",
  "Www.5ht2agarments.com",
  "Griffin I see your Savage and raise you a Ruby https://v.groupme.com/71289728/2022-10-07T12:54:45Z/11c03182.360x640r0.mp4",
  "New AK pretty good",
  "Can someone open the door thx",
  "can someone open the door i forgot my water bottle ",
  "@Kimberly Davis So I’m at the end of the line again, and it ends next to the black fan; am I good to go another round of I wait in line?",
  "Hey, could someone let me in? Thanks!",
  "Can someone help us to open the door Thx ",
  "19 in class, 2 or 3 were already trained are sitting in with friends",
  "Start with one box today!",
  "Yes, but only the Ruger Mark IV",
  "First timers can shoot after the safety class right ? ",
  "Yes, After your first meeting ",
  "Yes, ask one of us to change it out and we’ll show you how to shoot another gun of your choice",
  "Can we shoot more than one Gun in the range ",
  "Range opens at 7 and the safety class starts at 7. Please be at the class on time! The content I cover is required for you to be able to shoot so you need to be there for all of it. Thanks! ",
  "Yes",
  "The range opens at 7 too right?",
  "I believe the safety class will start at 7 at converse hall",
  "Hey, I have never attended the session.\n\nCan I join today? And what’s the time?",
  "Heck yeah man and yeah first mass production double stack that’s awesome ",
  "I wish it was .380, those ones go for a lot more",
  "Very cool especially for 80 bucks ",
  "Correct ",
  "First double stack I think ",
  "Savage 1917 that I also bought for 80$",
  "Created new poll 'Coming tonight?'",
  "Hold up hold up what .32 do you have?",
  "Ah I gotcha I was gonna say lol",
  "It was pretty neglected when i bought it",
  "I spent 120$ alone on a firing pin and safety for it tho",
  "Bruh ",
  "I got it for 75$",
  "I’m still hunting a carbine but if you guys are into mil surp it’s worth a trip out to Newark and visit Axis Arms",
  "Nice, now I want a carbine even more.",
  "firing pin and safety arent original but the bolt matches the stock and receiver ",
  "Kinda looks like a 5th, is it matching?",
  "That’s pretty nice type 38 short rifle, it’s hard to make out the series mark but Nagoya only did series 4, 5 and 6. If ",
  "Only thing i figured out is that its nagoya made in the 30s. Couldnt find an exact date range",
  "Night force? You must be doing some long range shooting",
  "Deets on the type 38? I have a late koshikawa.",
  "Ha the nightforce on it hangs on for its life ",
  ".300 rum? Bruh that'll turn a $3000 Leopold into a kaleidoscope after 2 shots",
  "6.5 jap is 6.5x50 right? ",
  "I feeing that pain owning a 300rum $2.50 a finding imr4350 powder seems impossible lately and the barrel burns up after 10 shots ",
  "I know a place 👀 ",
  "Yeah, you're probably not going to find a whole lot of 6.5 jap at Cabela's ",
  "Theres not many places you could walk into and see any of those on the shelf ha",
  " I have a gun in .303, a carry gun in .32acp, and a gun in 6.5mm jap. I really should reload",
  "That's the only reason I felt confident going for such an uncommon caliber",
  "Oh hell yeah I reload",
  "Oh thats cool, heavy bullet moving very fast it looks like. Do you reload at all or do you have to tough it out at the store? ",
  ".300 PRC, it's the wig-mag's meaner cousin",
  ".300 win mag you say? ",
  "It think it was like ar AR-50 or something",
  "It was an armalite",
  "Ironically my .300 out performed it in penetration but fell a bit short in the coolness department",
  "What gun is that? ",
  "It was",
  "Looks fun",
  "💥 10 dollars 💥 10 dollars ",
  "Yeah it makes a lot of noise ",
  "Holy shit that’s quite a boom",
  "Shot my first .50 BMG last weekend https://v.groupme.com/71289728/2022-10-04T19:16:52Z/7d5bec5c.1920x1080r0.mp4",
  "1cm",
  "The next big thing ",
  "Double stack mags 🤝",
  ".40 S&W",
  "Common calibers summed up.",
  "That's honestly impressive",
  "Well first it wouldnt cycle right, then i replaced the magazine, then the safety broke so i had to machine a new one, then it would light strike really bad so i reassembled the trigger assy. ",
  "Did it just stop cycling or misfires?",
  "Honestly, still not sure",
  "What broke on the last one?",
  "Here’s hoping that this one won’t break. 🙁",
  "Cal 22 ak?",
  "You guys are gonna like our new ak. It was made in Romania in the same factory as the originals.",
  "Hey yall! If you have any interest in becoming an RSO, we will be holding a info session tonight at 6pm in the basement of converse hall. We WILL be cleaning guns and going over some basics on becoming an RSO. if interested, like this message and we will see you at 6!",
  "Can I be let in please?",
  "^",
  "Can someone let me in",
  "Can someone help open the door",
  "Nvm it’s just as busy here 💀💀",
  "Before people get too excited that’s a flashlight not laser sorry. Laser might be an idea on the future though👀 ",
  "That’s gonna be the talk of the meeting today!",
  "*queue James Bond theme song*",
  "Meeting tonight 7pm in the basement of converse hall. For those of you that have been to 4 meetings, this one is FREE* if you want a second box of ammo it will be $10\n\nWe are capping rounds at 100 for this week due to midterms and the demand for the range. We want to ensure all shooters get to shoot!!",
  "Thank you",
  "Ok",
  "Venmo or cash",
  "I know they take venmo ",
  "Because today be first dat attending an meeting ",
  "Do they take cash app or just cash ",
  "Yup",
  "I have question the safety class are only on Wednesday correct",
  "Not if you shoot fast enough ",
  "Had attendees been limited to using only one box of ammo due to time constraints like the first couple of meetings?",
  "Not quite. ",
  "Hey everyone. I hadn’t been to any meetings for the past couple of weeks. Were they as busy as the first couple of meetings?",
  "Yes you can. They are also .22",
  "Can we shoot the rifles too? R they the same caliber?",
  "🤠🤠🤠",
  "Love those clicky bangy things at club",
  "CHECK IT OUT!!!!!!!",
  "Hi everyone! Last week’s competition scores are up on the website! The armory page was also updated and now has pictures of everything we have! Head on over and go check it out! Hope to see everyone at our weekly meeting tomorrow night!\n\nhttps://www.osupistolclub.com/",
  "Exciting news!!!! \nWeek 1 comp results are up on the website :)\nhttps://www.osupistolclub.com/competition.html",
  "If anyone is at all interested in becoming an RSO (Range Safety Officer with a fashionable red polo shirt and electronic hearing protection) either DM me or show up early to the meeting and talk with one of us and we can give you info",
  "Its not a Glock, we should be okay.  ",
  "Please nobody break this! Lol",
  "More specifically this:\nhttps://www.osupistolclub.com/armory.html",
  "https://www.osupistolclub.com/",
  "Where can we find of a list of the currently available guns?",
  "Dibs",
  "Weekly reminder we have a meeting tomorrow, Wednesday the 28th, at 7:00pm. We are adding a brand new taurus TX22 pistol to our lineup this week. Id recommend trying it out. ",
  "Sounds great",
  "This range only takes .22 but if anyone ever wants to shoot higher caliber we are more than happy to make a group shoot of people that are interested and go to a different range",
  "Best exoerience ever. Do u guys higher caliber guns too?",
  "Can someone open the door please ",
  "Can someone open the door pls?",
  "can someone open the door ",
  "Could I show up around 7:40-45 and still get in?",
  "Not long",
  "how long is the line rn??",
  "Can someone let me in please?",
  "Any following meeting where you don’t have to take the class tends to be much quicker",
  "If you’re a new member, around 2 hours since it takes about an hour with class and waiting in line takes some time too",
  "how long are the meetings?",
  "We are sticking with the steel sight pistol for this week. Plans may change for next week",
  "What type of firearm will be used for todays competition?",
  "Meeting tonight in the basement of converse hall starting at 7pm\n\nIf you are returning member head straight down. The safety class (for new members) will begin promptly at 7:15 pm on the second floor room 215 \n\nCLASS IS MANDATORY ONCE PER SEMESTER \n\nIf you have any interest in becoming an RSO please speak to someone in a red shirt at the meeting tonight\n\nSee you there!",
  "Nah only on Wednesdays at 7 ",
  "Every meeting day starting at 7",
  "is there safety classes everyday?",
  "Created new poll 'Coming tonight?'",
  "Wednesday at 7",
  "When is the next club meeting?",
  "If you have access to converse you can do whatever you want but you will still have to wait for us to set up everything.",
  "Do we need to wait to be let in even if we have access to converse?",
  "Where is the address of our club",
  "For those that don’t know there is a casual ticket exchange group me for all of your ticket exchanging needs. Just be careful some people are trying to scam people in there. Get a Buck ID verification or something 👍🏻",
  "I also wanted it, but not anymore",
  "I dont want ur ticket anymore ",
  "Hey guys can we keep this chat club related? Please take this to DM’s",
  "This message has been deleted",
  "Lol",
  "$70?",
  "$85?",
  "$80?",
  "Selling a ticket for tomorrow’s game if anyone’s interested￼￼",
  "Wednesday at 7 every week",
  "When r the safety classes?",
  "Yes, you will fill out a safety waiver during the safety class",
  "As a new member, are there any forms that I need to fill out?",
  "Just a reminder that someone left this water bottle a couple weeks ago",
  "@Chandler Fleming Kimberly will be right up ",
  "Can someone let me in :)",
  "How’s the line looking",
  "Can someone let me in ",
  "Unfortunately you will have retake the safety class (1 per semester). The class is upstairs in room 215",
  "Nope, you gotta fill one each semester ",
  "im in line rn, does the safety waiver i filled from last semester count for this semester? ",
  "I’m outside the front.",
  "The building is a secured facility, you need to wait for an RSO to let you in ",
  "Can we just walk in or we need to be let in?",
  "Well there’s a few people here",
  "Check the above messages yourself ",
  "Okay.",
  "Does the safety class start at 7 as well?",
  "Aight you gotta wait till about 6:50ish to 7, we can’t let you in too early ",
  "Yes, I am!",
  "Are you a returning member?",
  "I’m outside right now and would like to be let inside, please :)",
  "Created new poll 'Coming Tonight?'",
  "Converse hall",
  "Always Converse Hall",
  "Where is the meeting for today?",
  "Every Wednesday starting at 7",
  "Yo, when is the next safety meeting?",
  "Also make sure to pay close attention in the class. It makes everyone’s lives easier and creates a safer environment ",
  "(That’s mad cheap)",
  "I think it’s like 10$ for 50 rounds",
  "How much for each session?",
  "Just show up to the safety meeting ",
  "Nun",
  "What's the requirements for a beginner?",
  "Yup! We hold the class every week",
  "I have a friend who wants to join can beginners still do the class next week ",
  "Not mine but A+ presentation ",
  "Haha ",
  "Anyone missing a water bottle?",
  "Could someone open the door?",
  "Could someone open the door please",
  "Can someone let me in please",
  "Can someone unlock the door?",
  "If you have a class conflict that prevents you from showing up at 7 dm me and I’ll try and work something out ",
  "If you get here at 7:20 we can make that work but if it ends at 7:20 and you don’t get here until like 7:30-7:40 the. That’s too late to attend the safety class. ",
  "Just show up on time. Safety class starts at 7. We will give you the waiver then.",
  "Do we have to fill out any form to register for anything, or I can just show up there on time? ",
  "I’ve got a class till 7:20 on Wednesdays, is it ok if I arrive to the safety class a bit late?",
  "Created new poll 'Are you coming tonight?'",
  "Yes! Meeting today in the basement of converse hall at 7pm. If you attended the safety class last week head straight on down. If you have yet to attend a safety meeting when you arrive please go up to classroom 215 on the second level. We will only have one safety class this week so please be on time (7pm)",
  "Are we having a meet today? ",
  "Start time postponed to 10 on Sunday at Cardinal shooting center pistol range.\nhttps://www.rememberingthebrave.org/rtb-eafmg\n",
  "Wowza!  Standing room only then in the classroom ",
  "Right now we are at 80 and still more in line",
  "So do we have a final head count for the evening?  Curious over here ",
  "yes thank you so much",
  "Did you get in?",
  "can anyone open the door？\n",
  "Can anyone unlock it again",
  "Ill be down in a second",
  "Or I’m just dumb",
  "All the doors are locked ",
  "yup",
  "It’s the rotc building right?",
  "we are still waiting to get in so you’re good",
  "Nope! Come on over!",
  "I assume it’s too late to come rn?",
  "Created new poll 'Are you coming tonight?'",
  "Same here!",
  "^",
  "Can someone open the door?",
  "I’m at Brutus ",
  "Okay",
  "Converse Hall, the ROTC building ",
  "At what building?",
  "Room 215. Walk up the stairs and turn left. There will be a sign pointing you in the right direction ",
  "Rooms? ",
  "Army or AF ",
  "2nd floor**",
  "3 floor go through the double doors and turn left down the hallway and you will see a sign ",
  "What room are we meeting in ",
  "And the email if you got it.",
  "For anyone else who just joined, read through all the other messages posted here the past couple of days before asking more questions. 🙂",
  "Great thanks!",
  "If you go to the OSU app on your phone and sign in there is a digital copy of your buck id you can use",
  "If you have the ohio state app there is a digital one you can use.",
  "Hey everyone new member here. Is there any way to use your BuckID# or state ID instead of your BuckID card? I'm looking for it now but if I don't find it in time can I still attend?",
  "So we normally only hold one class. Obviously that can change as needed. For this Wednesday we are expecting a large turnout so we are holding two safety classes to be more efficient. One is at 6:30. Ideally all returning members can attend this class so we can get you guys shooting asap. If you are a new member and 6:30 works better than 7 that is okay. The second class will be at 7 and this class is intended for all new members. If there are a few returning members that can’t make 6:30 it’s fine if you come to the 7:00 one. We just don’t want everyone to come at one time otherwise people will be waiting for a while to shoot. ",
  "We may be able to make something work for you and other people who cant make it to the 7:00 class but that will not happen this week",
  "👍",
  "Yeah the class will end around 7:30. Sorry. ",
  "Returning member here: if I have a class that runs until 7:20, am I out of luck?",
  "6:30 is only for returning members ",
  "But it’s going to be at 6:30 tomorrow right?",
  "We hold a safety class every meeting at 7pm",
  "Yes the safety course runs every week at 7",
  "If I’m missing tomorrow is there another time I can do the safety class?",
  "7pm. We provide all the safety gear you’ll need to shoot.",
  "When is the safety class? And do we need to bring our own eye/ear pro?",
  "Yes you do",
  "do we have to do the safety class every semester ? ",
  "I also lost my ticket at the involvement fair lol",
  "The word meeting itself is a little misleading. You are free to come to whatever meeting you are available. There is no commitment to the club",
  "^",
  "So what do I do if I can’t make it to tomorrow’s meeting ?",
  "Don’t dare say that to our treasurer. LOL",
  "All the handguns other than one have iron sights, one has a red dot. \n\nTwo of our rifles have red dots ",
  "😬",
  "They are beautiful and definitely look good on your mantle but the ones ive shot felt like a Taurus with the reliability of a HK",
  "Thats a lot more than I thought you had, nice. ",
  "Do they all have stock iron sights or ghost rings? Etc",
  "It’s pretty tho lol. Just never got to shoot one yet",
  "Ehh Kimber's overrated",
  "That Kimber tho👀",
  "Hey, the .22 M1, those are cool",
  "Looks like rugers colts and s and w’s",
  "Yeah what are we talking here, Walther's, anschutz's finwerkbau's?\n",
  "A full list of our firearms is on our website:\n\nhttps://www.osupistolclub.com/armory.html",
  "What .22's do you have?",
  "We currently do not have a cashapp account ",
  "Can we use cash app ",
  "There will be a Venmo option too",
  "Is it $10 cash?",
  "An email has been sent out with more information regarding the winners of the raffle tickets. \n\nWinners are as follows:\n\n6855224\n6855130",
  "10$ each time you come to the club. This pays for the ammo you shoot each week",
  "Sorry, I meant ￼fee per meeting￼",
  "do we always meet wednesdays at 7? ",
  "Monthly charge is still $10 correct? And is there still that t￼ special with the come to for sessions? Get the fifth one free?\n￼",
  "We supply all the guns! Dont bring your own. (Osu doesnt like it) ",
  "You may only use the firearms we provide",
  "Do we need our own pistol for this club or are there some we can use?",
  "Enter the door right next to the brutus statue wearing camouflage Converse Hall\nhttps://maps.app.goo.gl/3dP7Rxp8DWuWHy82A?g_st=ic",
  "7pm this Wednesday!",
  "I’m so sorry I meant what time does the club meeting start 😂",
  "We are working on compiling the emails so once that is finished the winners will be announced ",
  "what time",
  "We will be announcing the raffle winners tonight!!\nOnce we get the email list together we will pull 2 winner. They will be posted here, on the email list, on the website and on the Instagram!! \n\nOur first meeting is THIS WEDNESDAY in the basement of converse hall (ROTC building)",
  "When are they announcing the raffle?",
  "Hey guys! I hope everyone is pumped for the involvement fair. Our table will be in the orange sports and recreation section so feel free to stop by and say hi! Has Griffin said we are handing out stickers and having a raffle. ",
  "Also feel free to check out our involvement fair booth this sunday. We will be handing out free stickers and having a raffle ",
  "Wednesday the 31st no problem sorry if you were waiting out there",
  "Sorry for confusion",
  "So went to building and no one there",
  "I thought you meant this wed",
  "Cool",
  "Next week! Wednesday ",
  "When does the club start?",
  "25 Yard timed fire",
  "50 Yard slow fire",
  "Want to see what Bullseye Shooting is all about?\nNational Trophy Pistol matches this Saturday 16th July at Camp Perry in northwest Ohio. \nFREE admission.  Rifle matches start next week and continue into August\n\nhttps://thecmp.org/cmp-national-matches/national-trophy-pistol-matches/",
  "Thank you for the info ",
  "Based on previous semesters, Pistol Club will resume on the second Wednesday of the semester. You’ll need to attend a safety class before you shoot and the cost of ammo is $10 for 50 rounds",
  "I think so, I joined late last year so I can’t tell you exactly when ",
  "That’s cool. So it will start during autumn?",
  "I don’t think they have anything for the summer and during the school year you just have to show up and take a mini training course which takes like an hour then you can hit the range ",
  "Hi,\nThis is Moni. I am a PhD student in ECE. I have joined last semester and I would like to join pistol club. I have no previous experience ",
  "Remembering the brave match postponed.  To September 3&4.",
  "I might be able to do the remembering the brave competition.",
  "Yes",
  "You competing Paul?",
  "https://www.rememberingthebrave.org/rtb-eafmg",
  "https://www.thecardinalcenter.com/",
  "Yes. ",
  "This event to attend is free of charge, correct?",
  "Reminder that tonight's balloon shoot is \"invite only\" . Members that attended at least five (5) meetings this semester received an email.",
  "Come to the door by Brutus",
  "if someone can let us two in",
  "we’re outside near the flagpole",
  "Can someone let me in",
  "Can you come to the door by Brutus? ",
  "We’re outside ",
  "Hey could someone let us in please?",
  "I'm waiting at the front door. Could someone please let us in?",
  "^^^",
  "Waiting at the front door to Converse Hall. Could someone please let me in?",
  "Unfortunately no ",
  "No",
  "No club or range accessibility over summer?",
  "Awesome, thanks so much. ",
  "ROTC shoots Thursday morning so we shoot wednesdays so the pistol and rifle team don’t have to move their expensive target system more than necessary. As long as ROTC still shoots Thursday then we will be Wednesday but we can confirm in early august. ",
  "It won’t be open in the summer and should still be on Wednesdays. ",
  "I was wondering if it is open in the summer as well",
  "Just out of curiosity, will Pistol Club be the same date and time for fall semester? I’m trying to make sure I don’t have any classes during. ",
  "Waiting outside now; could someone please let me in?",
  "Cool, I should be there by 8:20.",
  "+ 8 in the class, so there should be room on the last relay.",
  "Looks like 8 in the que for the  next relay",
  "You can definitely stop by. ",
  "Would it still be too late for me to try and come in? Are most of the stalls in the range already full?",
  "Can someone let me in plz",
  "We’re outside",
  "Could someone let me in? ",
  "sweet",
  "Yes we have a meeting. It starts at 7:00pm at converse hall ",
  "Hi is there a shoot tonight?",
  "Thanks for coming! Glad you had a good time. ",
  "Had a lot of fun tonight. Thanks for having me out. I am looking forward to coming back as much as I can",
  "Never mind we got it",
  "Can someone let me in? ",
  "No problem, someone will be at the door soon and then you can come up to 215 and we will get you through the class ",
  "sorry about being late",
  "im outside the front",
  "Can someone let me in",
  "Can I be let in",
  "We're outside ",
  "Hi, we are waiting outside the door. ",
  "Correction: for every 4 purchases, the fifth one of free 👍",
  "ok ",
  "It starts at 7, you’re still fine",
  "Hey I think i might be a little late for the safety meeting, i’m guessing i can’t attend? ",
  "I believe that’s correct yes",
  "we also*",
  "Correct me if I’m wrong, but don’t we get a free box of ammo after every five purchases?",
  "Jk",
  "Are you the guys that are hoarding all the .22 rounds lol",
  "Okay sweet!",
  "$10.00 covers targets, rental, and a box of ammo. We take cash or Venmo ",
  "Yes you will have to take the class at 7, and will get to shoot after. ",
  "Hi based on what I’ve read from the people that have asked before, all new shooters are required to attend the safety brief tomorrow at 7 and then have $10 for a box of rounds? Also are we shooting tomorrow? ",
  "Okay thanks!",
  "The door you go in is the one with the Brutus statue outside of it. East entrance ",
  "Ok",
  "You can text on the group. Someone will open it for you",
  "The website mentions that it’s a secure building. So I need to text here once I get there, correct?",
  "Converse Hall, next to the Shoe ",
  "Can someone share the location again, for the meeting tomorrow ",
  "Okay great, thanks!",
  "Safety meeting starts shortly after 7 so get there at 7. You can pay there either cash or Venmo. It’s $10 for a box of ammo",
  "Okay thank you, so what time would you suggest I come tomorrow? 7? Since I need to do the safety training, do I need to come early? Also, can I make the payment there?",
  "The only available times for students, staff or faculty to use the range is during the pistol club meetings Wednesdays at 7:00pm. The pistol and rifle teams, and ROTC have it booked every other day of the week. ",
  "You will have to do the safety training your first time ",
  "Everyone who shoots is technically a “member” but you can only come once if you really want to",
  "I don’t know everything, but I wouldn’t try to ask to use the range for what you said above. OSU is not very gun friendly and typically reserved the range for organizations to use, such as ROTC, the pistol and rifle teams, our club, etc.",
  "Hello, I’m new to this group. I’m interested in trying out the shooting range at OSU for recreational purposes. Could someone tell me what’s the procedure? Is it necessary to be a member of the pistol club to use the range for recreational purposes or can a student use the range a few times without being a member? ",
  "Valid valid 👍",
  "Valid valid 👍",
  "We are all adults, so we will trust that you have good judgement until you prove otherwise. ",
  "@Paul Kruggel wE tAkE thE sHoOtErS WOrD",
  "Technically, safety glasses are required, but we do not inspect personal eyewear; we take the shooters word that their eyeglasses meet safety standards.   ",
  "Yes, if you have normal eyeglasses, you can just use those ",
  "Terrific!  Thank you everyone.  As far as eye protection goes, I normally use my normal prescription eye glasses, is that alright?",
  "Also the only main rule we have on types of hearing protection, is that they have to be actual hearing protection. While electronic hearing protection is allowed, they can’t be noise cancelling headphones or AirPods. ",
  "@Konrad England We provide everything you would need including all firearms and ammunition. Please don’t bring your own firearms or ammo, but you are welcome to bring anything else. ",
  "You are welcome to use your own eye and ear protection, but u don't need to.",
  "Other than the $10 for your 50 rounds. We provide everything else! Make sure to attend the safety class at 7 (I think) at Converse Hall 215",
  "Hi everyone!  I am a new “member” (I don’t know if there is any official membership) and I am going to try to make it to next weeks meeting.  I am no stranger to the shooting sports, andI have my own range bag. Is there anything specifically I should bring besides standard eyes and ears?",
  "I have that notebook. I sent you a message on GroupMe",
  "I think I left a small red notebook at the range against the wall. Any way I could get that back?",
  "Can someone let me in please",
  "^^",
  "The class will be in room 215 ",
  "Can someone open the door for me",
  "Hey everyone! I hope you had a good spring break. \n\nOn April 3rd one of the guys I intern with is teaching an NRA basics handgun proficiency course from 8am to approximately 4pm. This includes 6 hours of classroom time and 2 hours of range time.\n\nFor those of you interested in getting your CCW in the near future this class is necessary for you. It is essentially a pre-requisite to the CCW qualification process that you would get at a range somewhere. It is necessary to have a certification in this before being able to get your CCW. \n\nIt is about $80ish (which is reasonable compared to other range pricing) the certification is included. If you have your own gun you are encouraged to bring it, however if you do not have one he has a few. You will need to bring about 100-150 rounds for the range time. If you are interested dm me separately and I can work on getting you signed up. \n\nIf you aren’t 21 don’t worry! The certification lasts for 3 years. \n",
  "Aight 👍",
  "Nah we got spring break",
  "Is their a meeting this Wednesday?",
  "Grammar is not my friend. Their*",
  "For the individual that didnt put down there actual name for the pistol competition: Thanks for the laugh but dm me for your score to count :)",
  "Yum",
  "Forbidden special dark",
  "The reactive targets look like chocolate ",
  "How many?",
  "Can someone let me in please",
  "Hey can someone let us in please?",
  "Nvm someone let me in lol ",
  "At the front of Converse, would anyone be able to let me in? Thanks!",
  "At the door!",
  "Can someone let us in?",
  "Can someone let me in at the East entrance ",
  "Can someone let me in? I’m at the East door",
  "Can someone let me in please",
  "Or 239",
  "I believe so but if it isn’t just look around the floor ",
  "Still Room 215, right @Brandon Young?",
  "What room is it in converse hall?",
  "Would anyone be able to let me into Converse Hall?",
  "If you have a C lot parking pass I think? ",
  "The parking lot right there is for French field house, the hockey rink, and st johns, so as long as you have student parking you can park in the lot",
  "Can we park at the rotc building?",
  "We could need some more RSOs, it’s worth it",
  "Venmo, cash, or indentured servitude ",
  "Nope",
  "What about Zelle?",
  "Bet",
  "Yup",
  "U take venmo?",
  "Will bring that. Thanks!",
  "$10 for a box of ammo (50 rounds)",
  "10$",
  "Its gonna be my first time today. Do we need to bring anything other than buckID?",
  "So 7:00 not 7:30 ",
  "Good*",
  "Yep! Safety meeting and returning members at 7 in converse hall",
  "Sounds goor ",
  "Yes we are hoping to get the class started earlier. ",
  "I’m bringing some new people tonight that need to go",
  "Oh shit I thought safety brief was 7:30, is it permanently switched to 7 now?",
  "Yep! Safety meeting and returning members at 7 in converse hall",
  "Is there a meeting tonight?",
  "Yep!",
  "will you guys be holding the competition each week? that was really fun!",
  "https://instagram.com/osupistolclub?utm_medium=copy_link",
  "What’s the name of the Instagram?",
  "Week 1 pistol shoot competition results are up on our Instagram!",
  "Unfortunately for your first time you will have to sit through the class. I know we get a lot of first timers here that have prior experience with gun safety. It’s our procedure. While I believe you, we have to treat everyone in the club equal regardless of experience. It’s only about 30-40 minutes. The only reason I am doing it a little differently with Ethan is because S&I club did an event with us a couple weeks ago so he has already sat through the class, I am just giving him a touch up since he hasn’t actually shot here yet. He isn’t being treated special he just has unique circumstances. I know it’s a pain sorry :/",
  "Is that possibly something I could do as well? I'm on the NROTC pistol team, so I already know gun safety",
  "Yeah I’ll just run you through the basic safety fundamentals again and have you run through the dummy gun a couple times and you’ll be good to go. Dm me separately before you come so we can get that figured out.",
  "You will have to sign the waiver and do a quick overview but besides that we should be able to get you sorted",
  "I took a safety course through Security & Intelligence club but wasn’t able to make the next meeting, will that count as a safety course so next time I come I can shoot?",
  "Had no idea what I was missing out on til now, looking forward to attend next week!",
  "You’ll have to message an RSO here I think to ask  and open the door for you.",
  "how do i open the east door?",
  "I think so? That’s where I entered at least.",
  "Are we supposed to come in the east door",
  "Nvm, found Ben's message about it being in Room 215. 👍",
  "I was told that the safety class is in room 215 in Converse Hall? Or is it some other floor/room?",
  "I’m probably a bit early, but I’m waiting out in front of Converse Hall!",
  "Yup, we only meet on Wednesday’s",
  "@Shuyi Liu  Looks like it, based on this response.",
  "Is shooting also only available on Wednesday？",
  "Past*",
  "If you’ve taken the safety class this semester already you can go straight down to the range. It starts at 7 but you can show up whenever just as long as it’s not passed like 8 or 8:15 ",
  " If I have taken the pistol training course this semester, can I go and shoot directly?\nIf I go to shoot directly, does it also only on Wednesday and start at 7:00?",
  "Thanks, much appreciated, looking forward to tonight 👍",
  "No you can shoot any of the guns down there if you’ve been before. All you have to do is re-take the safety class! ",
  "Even if I’ve attended sessions last year, would I still be restricted to the starting pistol since this would be my first session to attend for this semester?",
  "Nvm just saw the above message lol ",
  "Hi there, I plan on attending the safety meeting tonight at 7 PM; how long is the meeting usually, and will we still have a chance to practice on the range afterwards?",
  "We have it on the third floor of converse hall (rotc building) Wednesday and it starts at 7. When you get to the building an RSO will tell you which room to go to. It takes about 45 min and you shoot after. If you’ve been here before you can shoot any of our guns down there. If it’s your first time you’ll stick with our starting pistol",
  "How do you go about taking the class?",
  "If you haven’t taken the safety class this semester yet you will have to take it again. The stuff we cover in the class is perishable knowledge so we have our members retake the class every semester. We only meet on Wednesday nights at 7. ",
  "If I have participated in this course before, can I go to shoot directly? Is shooting only open on Wednesday night?",
  "We are one of the few Universities in the country that has a range that lets students shoot! Definitely a unique opportunity. ",
  "Hey everyone! I has just sent this GroupMe. I had no idea that OSU had a pistol club!",
  "OK",
  "At door 🙏🏻",
  "^",
  "Could someone let us in please?  ",
  "At the door ",
  "Can someone me in please",
  "Can somebody let me in",
  "The class is in room 239",
  "I’m in!",
  "A reminder to those who are new, the safety class starts at 7:00pm in room 215 ",
  "What room will safety brief be in? ",
  "Ok, if no one is there yet, then I will be there soon to let you in.",
  "I’m at the door ",
  "cool!",
  "Yes ",
  "just double checking; do you guys have a safety class and meeting tomorrow at 7?",
  "Those things keep joining tons of group me’s. Just ignore it",
  "Just reported it for being spam",
  "this looks like a scam…",
  "hey i know this is still a rough time for people right now. i just wanted to introduce myself and say that i have some rlly cool and interesting groupmes open to everyone all over the world!! def join if you’re interested or want to learn more. just say that you’re interested in joining the groups in the request welcome question and you’ll be added!! \n\n*note i am probably not part of your uni or organisation* these groups are for ppl all over the world \n\nYou're invited to my new group 'The Welcome Group' on GroupMe. Click here to join: You're invited to my new group 'The Welcome Group' on GroupMe. Click here to join: https://groupme.com/join_group/59300102/B9iUJPxc",
  "can someone let me in",
  "Can someone let us in?",
  "I’m at the door for RSO shadowing ",
  "I apologize, I cannot make it tonight",
  "This is just a reminder to people coming to the safety class tonight.  The class will start at 7:00pm. Please show up by then so we can begin the class on time and get everyone through the range. ",
  "Can someone open the door?",
  "At the door ",
  "can u open door ",
  "There’s a couple of us at the door ",
  "I’m at the door ",
  "I just pulled up. I can swipe us in",
  "How do i get in?",
  "When I answered I was talking about something else.",
  "For some reason my phone said this was in the RSO chat. Sorry for the confusion.",
  "Just to make sure we are all on the same page. We hold safety classes every week for new members, or if it is your first meeting of the semester. The safety class will start at 7:00 beginning this week and moving forward. ",
  "Yes, there is a general membership safety class this wednesday.  Feb 10 is a first aid class for RSOs.",
  "No, Feb 10",
  "Is there a safety class tomorrow? ",
  "At the door ",
  "can someone open door",
  "I’m outside ",
  "Red door near Brutus ",
  "How do I get into the building?",
  "Yes. If you still would like to be a rso, show up a little early as well so we can sort that out",
  "So, if we went to the safety meeting last week, we can just go straight to the range from now on right?",
  "I’m interested in being in the social chat.",
  "can someone open door",
  "Can someone let us in?  ",
  "I’m outside",
  "The meeting is actually going to be in room 239",
  "It should be by the parking garage /buckeye link building ",
  "Go to the east side door please ",
  "What side of the building should we go to?",
  "Thanks ",
  "Close to the stadium ",
  "Converse hall, ROTC building ",
  "Can anyone guide me the location ",
  "The safety class will be in room 215 tonight. ",
  "If it is your first time ever shooting at pistol club, then we will have you shoot the same type of pistol that we have in the classroom ",
  "If you have been to pistol club before, you can shoot pistols or rifles after the class. ",
  "Pistols only today?",
  "The current plan is 7:30 but if the classroom is full at 7:15 we will start early. ",
  "@Ben Martin Is the safety brief at 7:30 or 7pm since it’s the first meeting of the semester?",
  "Does that mean we meet at 7:30 instead of 7?",
  "Yes, we require it each semester. Depending on how many people we have tonight, we might hold two classes, but we will try to make it a quick review. ",
  "Do we have to do the safety class every semester? ",
  "Meetings do start next Wednesday, not tonight. ",
  "OK thats good",
  "^^^",
  "I thought it started next Wednesday ",
  "I will attend meeting tomorrow ",
  "We do. We have a few different styles from 10/22’s to AK’s, AR’s, M1 garand, mp5, lever action, and a bunch of others. We also have a bunch of pistols and revolvers to pick from. ",
  "Do you have riffles",
  "Also, Range safety officers monitor the range regulations and assist members during meeting range operations.  After the regular members finish shooting the RSOs usually shoot. Still a  .22 cal limit, but if you want to shoot your own pistol and ammo that's the time to do it.  ",
  "RSO’s have the opportunity to go on a shotgun shoot at the end of the semester where we can shoot bigger caliber guns than the range at OSU allows ",
  "Can you explain?",
  "Join as an RSO and you have more options!",
  "The range is only rated for a specific type of ammunition ",
  "Ok great thanks",
  "No we provide the ammo and firearms ",
  "Are we allowed to bring our own ammo and pistol? ",
  "Yes, the club will resume meetings the second Wednesday of the spring semester. You can come to the ROTC building at 7:00pm and take the safety class then shoot that night. ",
  "Hi everyone, I am an absolute beginner and would love to try out pistol shooting. Would the club have meetings in spring semester?",
  "Reminder there is no regular meeting tomorrow!",
  "Hey I’m up here",
  "Hey, could someone open the door for me? Thanks!",
  "can someone open door",
  "Would somebody be able to let me in?",
  "Could someone let me in?  ",
  "Hi everyone, just a reminder that there is NO meeting this week because thanksgiving break. We will have 1 last general meeting Wednesday December 1st. Wednesday December 8th will be an invite only meeting for the members who have attended a certain amount of meetings this semester. Keep an eye out for an email from us if you think you have attended a lot of meetings this semester. As always you can email pistol club if you have any questions, or you can ask here as well. ",
  "^",
  "Can someone let me in?",
  "Can someone let me in?",
  "Could someone let me in?",
  "Can someone let us in?",
  "Class starts at 730, yes.  ",
  "7:30 for new people correct?",
  "We’re outside",
  "We’re outside",
  "We are outside as well",
  "We’re outside!",
  "Outside the east side entrance rn",
  "Would someone be willing to let me in?",
  "Ok, if you come to the east side by the parking garage we will let you in. ",
  "I was by the flags",
  "Are you at the east side entrance? ",
  "I’m outside",
  "Sounds good thank you",
  "The class starts at 7:30 so if you want to show up by 7:20 that would be great ",
  "If it’s your first meeting 7:30",
  "Hi guys I’m new. Am I supposed to show up by 7pm or 7:30pm?",
  "My bad ",
  "@Dylan Seng Im literally not even a student here anymore 🙃",
  "Just a heads up the class is now in room 239 tonight ",
  "Thanks ",
  "Just come to one of our meetings Wednesday’s at 7pm at converse hall. You will have to take a safety class at your first meeting but you can shoot once it’s over. ",
  "Hi, guys, I am new to the club, how can I join?",
  "Hey everyone. I just wanted to remind you that we have a meeting tonight, 10/20 and not Thursday. Moving forward we will have meetings on Wednesdays not Thursdays. ",
  "I can just grab it next meeting, thanks for getting it!",
  "Or if one of the other RSO’s is gonna be in the range between then, they could grab it for you",
  "Yes, we hung it up in the back room so you’ll be able to get it at the next meeting",
  "Hey guys, did anyone find a blue sweatshirt that was left at the range last night?",
  "At the door ",
  "I’m at the door ",
  "We are waiting outside could someone let us in?",
  "Yes",
  "If we already attended the safety meeting are we able to just go down and shoot ",
  "Hi everyone. I just wanted to send a reminder that we will have a meeting tonight at 7:00pm. We hope to see you there. ",
  "This week's meeting is Thursday,  Oct 7th ",
  "Hi is there a meeting next Wednesday ",
  "At the door",
  "At the door",
  "At the door ",
  "Maint meeting tonight",
  "You're invited to join my group \"OSU Pistol Club\" on GroupMe. https://groupme.com/join_group/71289728/0dj5FaVj",
  "Use this group to post access qr code on door on range days so we don't have to have a door watch.  Members can join the group and send a note they are here so a member can go let them in."
]