[
  "Everyone remember to pack your cues",
  "guys I’m so pumped this is gonna be great.",
  "LETS GOOOOO",
  "Shared a document: https://group.me/1WXC6WF19Thtzz",
  "Evan, we play each other when the mixed teams and OSU team match up",
  "This is who everyone will be playing ",
  "This is the ruleset for the tournament ",
  "https://www.vnea.com/rules",
  "https://www.airbnb.com/trips/shared/cotraveler-invitation/d209a6d7-2455-453d-9a50-f33328275960?viralityEntryPoint=169&s=76",
  "Since no one said they were against it, I'll just book that place. Will also have to figure out transportation down there",
  "Ah",
  "Two extra people are joining a \"mixed\" team",
  "But we only have 4 in the team?",
  "There are 6 of us now going",
  "Works for me too. I just wonder why 4 beds are not enough.",
  "That works with me 😎",
  "Guys, I'm going to need confirmation from everyone saying that works, and that you'll be okay with splitting the price before we book it.",
  "If the space is not enough, I can book a hotel by myself",
  "Someone would have to crash on the couch",
  "Would this Airbnb work for everyone?",
  "https://www.airbnb.com/rooms/45115328?viralityEntryPoint=1&s=76",
  "Yes, I can drive you. We still need to figure out an Airbnb with Song and Min",
  "Can i go with u also i need to share air bnb with someone ",
  "I’m thinking about booking a hotel or Airbnb. If anyone is interested in it, please let me know",
  "Also, if anyone is interested in traveling together/sharing accommodations like an Airbnb, let me know and we can work out those details ",
  "It will*",
  "I got confirmation that I will be on March 29th starting at 11am ",
  "Thank you so much! I am wondering if I can book the hotel earlier to get a good price. : )",
  "I never got the official word. I'll check with him ",
  "Do they make sure that the tournament will be on Mar. 29th? ",
  "It will likely start at 11am",
  "They will have one-piece house cues available to use",
  "He said that most other colleges prefer it to be on March 29th so that will likely be the date",
  "Yeah I think so.",
  "Would you still be able to make it if it were on the 29th Min?",
  "april 5",
  "I prefer April 5th",
  "Hey everyone. I have to get back to CMU about the tournament. Does anyone have a preference between playing on March 29th or April 5th?"
]