[
  "Make sure to come through the side door, not the door near the front desk, as you need to swipe into the game room if you go that way",
  "Just a reminder that our weekly meeting is today at 2pm at Blackburn, hope to see you all there!",
  "Sure",
  "7:30 work?",
  "When do u wanna go?",
  "Not pretty sure yet",
  "What time?",
  "I may play in Suzi tonight. Anyone wanna play together?",
  "Hey everyone. Tomorrow we'll have our weekly meeting at Blackburn at 2:00pm. I look forward to seeing you all there!",
  "Hey everyone. We will have our normal meeting this week at Suzi Cue at 2:30. I look forward to seeing you all there",
  "I may need to wait for a table then",
  "I might show up around 7:45-8",
  "Around 7:30",
  "just on the way",
  "What time?",
  "I cannot",
  "Anyone wanna play in suzi tonight?",
  "Sure, I can come tomorrow.",
  "I got some homework I gotta finish up when I’m done there but I’m going tomorrow for league @Min ",
  "I went for a while when they opened. Small chance I’ll go back after class but we’ll see",
  "I'd like to play with you, Evan",
  "But I have an exam from 6:30-7:30...",
  "Going around 5:30",
  "I do",
  "Anyone wanna hit Suzi cues today?",
  "Just a reminder that our meeting is today at 2:30 at Suzi's. If we get enough people to show up we might run a little tournament!",
  "Hey everyone. Tomorrow we will have our meeting at Suzi Cues at 2:30pm. Hope to see you all there!",
  "I hope everyone enjoyed their break! Safe travels back to Columbus!",
  "Just a heads up, we will not have a meeting tomorrow as people are still rolling in from break",
  "Good job guys!",
  "Congrats lads, take it home",
  "I'm happy to announce the results of the tournament yesterday. Sanjay, Min, Song, and Matthew will all be participating in the tournament at Carnegie Mellon. Congratulations to them!",
  "https://swisssystem.org/tournament/4fd66a07a13b4178867f4c403dd547a9/rounds",
  "https://swisssystem.org/tournament/22a911e4b3694e128cfaef4227542be0/rounds",
  "tournament is starting AT 2:20 on the dot!  if you plan on being late, please reach out to me or anthony now",
  "Hey guys, just a reminder that the tournament is at 2:00 today. Plan on arriving before 2:00 so we can organize the tournament properly. I hope to see you all there!",
  "If anyone needs a ride, send me a message and we'll get it all worked out",
  "Okay everyone, based on the poll, we'll have the mini tournament tomorrow at 2:00pm at Suzi Cue. I'll give more details about the format and rules at Suzi's",
  "Going to suzi around 7-7:15 if anyone wants to accompany",
  "Please also select all dates you are available ",
  "If you have any other questions please send me a direct message and I'd be happy to answer them",
  "Please answer the pool above if you are interested. The mini tournament would be held at Suzi Cue on a 9' table, as the CMU tournament is on 9' tables",
  "Created new poll 'If you are interested in the CMU tournament, when are you available for the qualifying tournament? (To determine who is going)'",
  "Evan 🙏",
  "When and where",
  "To determine who is going, we decided we would host a mini tournament of our own and the top 4 players would attend ",
  "Hey everyone! The Ohio State Billiards club was invited to compete in a Intercollegiate 8-Ball Pool Tournament at Carnegie Mellon University in Pittsburgh, and we need to determine which 4 members will attend. The tournament at CMU will be held on either the 29th or March or the 5th of April (they're waiting for feedback from all schools to pick the date that works best for everyone) ",
  "Here",
  "Have to go back",
  "Gonna be late I forgot a pancake in my car",
  "Can someone let me in? ",
  "Just a reminder that we are having our meeting today at 2pm!",
  "Remember, come in through the side door, not the front desk",
  "Hey all. We'll have our weekly meeting at 2:00pm tomorrow at Blackburn. Hope to see you all there!",
  "Update: There will be no meeting tomorrow. Feel free to use this chat to meet up if you still want to play pool tomorrow. Have a great weekend!",
  "Just a reminder that our meeting is today at 2:30 at Suzi Cues. Please let me know soon if you need a ride. I look forward to seeing you all there!",
  "This semester we plan on alternating our meeting between Suzi's and Blackburn",
  "Hope to see you all there. As always, feel free to reach out if you need a ride. If you live on or near campus you can also take the CABS East Residential bus and it'll drop you off right in front of Suzi Cues ",
  "Tomorrow*",
  "Reminder that this week's meeting is at Suzi Cues at 2:30pm",
  "Can somebody open up?",
  "Yeah, we'll still be here Caroline ",
  "Can someone open door please?",
  "Will you guys still be there if I get there around 2:30?",
  "Can someone let me in please",
  "Also, for whatever this year we can't prop the doors open because it's sets off an alarm. So lmk when you get here and we'll let you in",
  "Should be a good time!",
  "Go through this door",
  "We'll have the side door propped open, so there's no need to go in by the front desk ",
  "Just a reminder that our meeting is today at 1:30 at the Blackburn game room. Hope to see you all there!",
  "Hey guys, this week we'll be meeting at the Blackburn game room on Sunday at 1:30pm. Hope to see you all there!",
  "I’ll be there soon",
  "Hey all, we will have our normal meeting today at 2:30 at Suzi Cues. Hope to see you all there. As always, feel free to reach out if you need a ride",
  "Hey guys, no official meeting this week at Suzi’s.  As always, free to use the group chat to meet up anytime!",
  "The meetings are typically at 2:30 on Sundays at Suzi Cue pool hall. This weekend might be different however because I can't  make it on Sunday. More information on this weekend's meeting soon!",
  "When/where are the meetings?",
  "I’ll be there in about 20 minutes ",
  "Ill be there around 6:45-7",
  "Sorry, I can't tonight ",
  "Anyone wanna play pool in suzi tonight?",
  "I’ll be there around 2:45 just got caught up w some laundry ",
  "This message was deleted",
  "Also, anyone who needs a ride, feel free to message me",
  "Just a reminder, the East Residential bus route will take you there from campus",
  "Hi everyone. We're still figuring out the official schedule for this semester, but we'll have an unofficial meeting at Suzi Cue today at 2:30. I look forward to seeing you all there",
  "All good",
  "Terrible habit",
  "I may have lied my bad",
  "Ok. Thanks ",
  "Hey! 2:30 on Sundays",
  "My name is Colin. I’m new to the billiards club. What time are the meetings regularly?",
  "Okay any other fine ppl need a ride? Faith I’ve got you",
  "I can prob make it too ",
  "Anthony do you want a ride too?",
  "I should be able to play tonight as well",
  "I would appreciate a ride",
  "Lmk if you need a ride I can pick anybody up",
  "Woohoo! Let’s do it",
  "7 would work for me!",
  "How’s 7 7:30 ish?",
  "I could before nine",
  "Would anyone like to run some pool tn?",
  "I’ll be at suzi at 7",
  "Sweet",
  "I can do that ",
  "Like around 7? I have to go shopping during the daytime",
  "What about tonight?",
  "I can't make that, sorry ",
  "Maybe 2:30 or 3",
  "Around what time?",
  "I may play in the afternoon today",
  "I’m down!",
  "Anybody wanna meet up at suzis in the next few days?",
  "Thank you king 🙏🏼 good luck everybody we’ve got this",
  "Damn if only you wished me good luck on finals last week💔",
  "There will be no meeting today because of finals week. Good luck on all of your exams everybody!",
  "Anyone there already? I j parked ",
  "Like this message if you would like a ride and dm me with your address",
  "Okay so let’s plan on meeting there at 12:30 for anyone who’d like to come",
  "I Can also fit 3 people in my car ",
  "^ concerning the mozz sticks",
  "Alright everyone, how’s 12:30 tomorrow at Matt and Tony’s? I can drive people there if anyone needs a ride",
  "Created new poll 'mozz sticks ??'",
  "You are cordially invited to come eat mozzarella sticks Thursday at Matt & Tony’s for lunch ",
  "Due to the holiday break, today's meeting will be an unofficial meeting at 2:30 at Suzi's Cues ",
  "Anyone selling any more Michigan tickets for Saturday? Looking for 2 more, doesn’t matter and where and they don’t have to be in the same section",
  "We will have our weekly meeting today at 2:30 at Suzi Cues. Hope to see you all there!",
  "I may go and play tonight",
  "No official meeting tomorrow since both me and Anthony won’t be able to host.  Y’all are welcome to still meet up at Suzi’s and play!",
  "Are we meeting tomorrow?",
  "Also we will not have our a meeting tomorrow ",
  "I can't this weekend",
  "Anyone wanna play later tonight?",
  "Reminder that we have our weekly meeting today at 2:30 at Suzi Cues. Hope to see you all there",
  "No worries. It happens ",
  "Wait I’m retarded. I thought it was Sunday",
  "No, we are meeting tomorrow though ",
  "Are we meeting today?",
  "Another reminder, anyone who lives on campus can take the ER bus directly to Suzi's, and you can always message me if you need a ride as well",
  "Reminder that we have our weekly meeting today at 2:30 at Suzi Cues. I hope to see you all there!",
  "I’d play around 7",
  "I can't tonight ",
  "what time?",
  "Anyone interesting in possibly playing later?",
  "Yeah I’ll come to that",
  "I mean, we have league on Wednesday night if you wanna watch. There's a lot of down time to play as well",
  "I am also gonna miss next Sunday sorryyy I’m going home ",
  "Anybody wanna do an impromptu meeting this week? Sorry I missed yesterday",
  "same ^^",
  "I’ve been lackin with meetings lately",
  "I might make it, but if I do I’ll be like an hour late",
  "Reminder to everyone that our weekly meeting will be held today at 2:30 at Suzi Cues. Hope to see you all there!",
  "Due to the break, we won't have an official meeting today. That being said, I'll still be at Suzi's at 2:30 today to shoot some pool if anyone wants to join me",
  "Awww",
  "Just a heads up, our weekly meetings will now be on Sunday, meaning that we will no longer have meetings on Tuesday nights",
  "Just a reminder for the meeting today, I look forward to seeing you all there!",
  "And for all the football fans, enjoy the game today!",
  "Heads up, we will be having a meeting tomorrow at 2:30 at Suzi Cues, hope to see you all there! If anyone needs a ride, feel free to reach out to me for one",
  "Wasn’t she already here lol",
  "☕️",
  "An admin deleted this message",
  "By the way, we will NOT have our weekly Tuesday meeting tonight. We will meet this Sunday however!",
  "Just don't open the fridge and you should be fine",
  "My precious food!! I need our fridge to turn back on stat!!",
  "Hopefully mine is close to being back on",
  "Wait we live a couple blocks from each other right?",
  "Oddly enough the house across the street from us had the power out for an extra hour or so before we lost power",
  "I never realized how quiet houses are when the ac isn’t running in the background",
  "With it being overcast too it’s dark in our house lol we’re gonna have to break out the candles at this point",
  "Okay mine should hopefully be back on soon then cuz it’s still out as of rn",
  "Mine was for like 30 minutes but it came back. My internet is down still though ",
  "Is anybody else’s power out?",
  "Naurrr",
  "I left my pool stick in Youngstown☠️",
  "Slow brain moment",
  "I totally forgot to come yesterday :/ sorry",
  "They'll have the NFL games on all day and at 5 Suzi Cues will have a 9-ball tournament",
  "Hey all! This is a reminder that we'll be having our bi-weekly Sunday meeting today at 2:30 at Suzi Cues",
  "A few mins away",
  "Correction I will def be coming tn",
  "Who all is going tn? I might be able to make it",
  "Hey everyone, just a reminder that we'll have our weekly meeting tonight at 7:00pm at Suzi Cues. Hope to see you all there!",
  "Gonna be there around 2:20",
  "Yes, at 2:30 today!",
  "Are we doing an unofficial meeting today?",
  "I’d play, there wasn’t many people playing pool last Sunday bc of the games, I can’t imagine we’d have issues finding a table",
  "Yayyy",
  "That being said I'm also down for an unofficial meeting if I can't get Suzi's on board with an official one",
  "We technically only have meetings every other Sunday rn. I plan on asking if they'd do every Sunday though ",
  "I’m down for an unofficial meeting on Sunday if anybody wants to play!",
  "Do we play Sunday this week?",
  "Anyone playing at suzzie ",
  "Woohoo! I am so ready to play some pool 😆",
  "Just a reminder that we'll have our weekly meeting tonight at 7pm at Suzi Cues. I look forward to seeing you all there!",
  "🏎️🏎️🏎️",
  "Sheeesh",
  "The buckeye donuts I brought are here waiting 👀",
  "Just had to finish my lunch",
  "I’ll be there in 20-25",
  "And for anyone who is interested, they will have a 9-ball tournament today that starts at 5pm. It's $10 to play in the tournament ",
  "Reminder that we have a meeting today at Suzi Cues from 2:30-4:30. I look forward to seeing you all there!",
  "Sorry, I can't tonight ",
  "Anyone thinking of playing tonight?",
  "That’s even better",
  "So this Sunday at 2:30 we'll have a meeting there! They always have football games on too for those who don't want to miss any games",
  "I can make those",
  "Love to see it",
  "Cool beans",
  "Hi all! Suzi Cues is letting us meet there from 2:30-4:30pm every other Sunday. Directly afterwards at 5pm on every Sunday they are hosting a 9-ball tournament as well.",
  "Just a quick reminder for the meeting tonight at 7! I'll be there until around 9:30 so feel free to stop by anytime!",
  "Hi everyone! This is a reminder for our first meeting this semester. It's tomorrow at 7pm at Suzi Cues pool hall. For those who live on campus, the East Residential bus line will take you right in front of Suzi's. They also have plenty of parking for those who drive. Anyone else who may need a ride, feel free to reach out to me before 6pm tomorrow and we can coordinate something. I'm excited to see you all there!",
  "Created new poll 'I can't make the Tuesday meeting, but I could go to a meeting if it was: (Select all that work for you)'",
  "We are also planning on having another meeting time for those who can't make it to the Tuesday meeting. This second meeting time would be every other week. If you cannot make the Tuesday meeting this semester, fill out the poll below ",
  "For transportation to Suzi's: They have plenty of parking if you have a car. If you live on or near campus you could take the East Residential bus line. For those who live in the campus area but still need a ride, you can always reach out before the meetings and we can coordinate for someone to drive you!",
  "Hi all! This year's meetings will be at 7:00pm every Tuesday at Suzi Cues",
  "It's at 7:30. Also I believe you wouldn't have to go every single week because only a certain number of team members need to play every week",
  "What times? My Wednesdays aren’t that free but I’d like to jump in",
  "No, it's on the 7' tables I believe ",
  "Do they play the league on the 9fters?",
  "If anyone is interested in joining a pool league this semester at Suzi cues (on Wednesday nights) message me and we might make a team",
  "No worries though ",
  "Yeah, I think we're all here rn",
  "Is everybody gonna be there at 7? I need a little more time",
  "Also if anyone needs a ride just message me and I can pick you up",
  "I was thinking around 7, I can't do any sooner than that",
  "What time are we meeting today",
  "That's a good question ",
  "Awesome sounds like a plan",
  "I’m in for tomorrow as well",
  "I also can't today, but tomorrow night I could ",
  "I can’t today but I’d play tomorrow",
  "Anyone want to play pool at suzi tdy?",
  "Around 9 probably ",
  "Till what time?",
  "I can’t tonight unfortunately :/",
  "Does anyone want to play pool at Suzi cues tonight? Probably around 7",
  "We haven't decided on all of our meeting details yet for this year. We'll send a message soon with all the info!",
  "Do you guys know when we’re meeting this year?",
  "No, we weren't at the involvement fair this year",
  "Are you guys setup at the involvement fair? ",
  "Sanjay and I are still working on this year's schedule. We'll let you know when we decide!",
  "When’s our first meeting?",
  "Use this link to join: https://groupme.com/join_group/100592105/lBgiyDZb",
  "Because many members won't be in Columbus this summer, I made a separate GroupMe dedicated to people wanting to meet up to play pool in Columbus during summer break. If you're going to be in Columbus over the summer, and want to play pool with other members please join the new chat below.",
  "Maybe, I'll get back to you ",
  "Anyone playing later?",
  "I am at home lol",
  "Any of you ladies and gents at suzi tonight?",
  "Ok I’m finishing an assignment up, leaving in like 5-10mins",
  "I'll just head over now",
  "I’m in, what time?",
  "Maybe not, but we could try lol",
  "Think we’d be able to get a table at Suzi’s?",
  "I was just thinking about playing ",
  "Anyone wanna shoot a few games tonight?",
  "I'll be there in 5",
  "I’m here",
  "Sounds good",
  "I'll try to get there around 5:30-5:45. Anyone is welcome to join ",
  "Sure I’ll come play for a bit ",
  "Probably just Suzi's ",
  "Ya I’ll play then, where at?",
  "I'm down. I can do it earlier, around 5-6ish",
  "I can’t sorry :/ big final tomorrow morning",
  "Anyone wanna play pool tonight?",
  "Hey guys, no more official meetings for the rest of the year since finals are coming up.  Feel free to keep using the group chat for pool meet ups !!  Thank yall for a great year of pool🎱",
  "There’s only one group ahead of us if anyone else wants to come play a few games",
  "I’m by the front door",
  "Here",
  "One group ahead of me, I put my card down for one",
  "Imma see what the wait is like for a table",
  "Here",
  "Leaving now",
  "On my way",
  "That’s fine!",
  "Nice, I gotta shower and stuff but how’s 9?",
  "Works for me",
  "Maybe suzi or something, I’m down for wherever",
  "Where at?",
  "Ik it’s finals so definitely id understand if ppl are busy",
  "I’d play",
  "Anybody wanna maybe play pool tn?",
  "For anybody who’s looking",
  "Stopped by suzi and they only had xl so I went to rubys",
  "As long as they’re open lol",
  "Yea for sure ",
  "So you think I can drop by suzi and get one?",
  "Bar crawl is on the 30th",
  "When is that btw?",
  "Oooh fr?",
  "For anyone who needs senior bar crawl t shirts, suzi’s has a bunch still ",
  "I would love to, but I have way too much school work until finals week",
  "Anyone wanna play pool tonight?",
  "Same here",
  "Coming soon",
  "Hey guys, I’m on the back 9 ft table !",
  "Like this message if you plan on going to Suzis today ->",
  "No meeting tomorrow.  Reminder our next meeting will be on Tuesday at Suzi Cues at 7pm.  Can’t wait to see yall there!!",
  "I’m gonna pass on second thought. I have an embarrassing pile of laundry to get to 🫡 ",
  "I’d play if people go",
  "Also reminder to everyone since it hasn’t been mentioned in a while, Suzi’s has free tables on Tues and Thurs for students with a BuckID !!",
  "Yeah, feel free to have an unofficial meeting. Sanjay and I are just busy tonight and can't host it, or else we would have an official one tonight ",
  "If anybody is gonna be there I wouldn’t be against an unofficial meeting lol",
  "No, we're going to have Suzi's next Tuesday!",
  "Susie’s tonight?",
  "This is at the Ohio  State University  Union ",
  "That’s a very good picture, awesome event",
  "Full solar eclipse",
  "Sweet thank you",
  "Delaware would be fine, but I would recommend high banks park",
  "How about delaware?",
  "I need answers ppl where should I go for the eclipse?",
  "Hey all, reminder we have a billiards meeting in Blackburn tomorrow.  It’s going to be at 3pm (please note: not usual time).  Can’t wait to see yall there🎱‼️",
  "No meeting tonight, but we are having a meeting on Sunday at Blackburn House ",
  "Anything at suzi’s tonight?",
  "I'll be at the rpac playing pool for the next hour or so if anyone wants to play",
  "Probably another hour ",
  "Y’all staying there much long?",
  "Anthony and I are on a quarter table, the last one in the row",
  "anyone here",
  "Created new poll 'Which time works better for  future Tuesday/Thursday Suzi’s meetings (select all)'",
  "This message was deleted",
  "Also, if anyone needs a ride, feel free to message me and we can get something worked out",
  "We're having a meeting tonight at 7pm and Suzi Cue's. Hope to see you all there!",
  "We didn't get last place! But it was a lot of fun either way",
  "How’d you guys do at the tournament?",
  "Today is no good for me either unfortunately but sometime later this week maybe",
  "Heard, heading over around 1 if anyone wants to join",
  "I would join you, but I think I've played too much pool the last few days. Maybe another time!",
  "Nice to meet y’all",
  "Hey guys, my names Evan - been playing for a while, mainly @ Library and Out-r - getting rather sick of the dirty tables, uneven floors, broken cues. Saw there was a club, automatic join. I heard the rpac’s section for pool just got redone and was gonna go later today if anyone wants to join for 1 on 1’s or 2’s that’d be great",
  "Good luck to y’all in the tournament! Let us know how ya did!",
  "No meeting this week since Anthony and I will be out of town at the CMU tournament.  Next billiards meeting will be Thursday at Suzi Cues, we’ll figure out the time later !!  Enjoy y’all’s weekends ☀️🐰🌳",
  "I hope everyone had a good spring break! Just a reminder that we're meeting at Suzi Cue's tonight around 7pm. Hope to see you all there. If there's enough interest we might run a small tournament for prizes too!",
  "We'll be having a meeting at Suzi cue's Tuesday at 7pm. Hope to see you all there! Anyone who might need a ride feel free to message me to let me know and we can figure something out",
  "We're at a coin table atm waiting for a 9' table",
  "i just arrived",
  "Just a reminder, tournament at Suzi Cue's tonight at 7pm. We'll probably take 20-30 minutes for everyone to warm up and such and start it at 7:30. All are welcome to participate, and feel free to come even if you don't wish to play in the tournament. ",
  "I haven't read the whole rule sheet, but I believe jump shots aren't allowed, and 3 fouls is not a loss",
  "I just wanna know if it treats 3 fouls as lose and if jumpshot is available in the tournament. lol",
  "thank you so much",
  "Other details on the tournament will be decided based on how many people show up to participate ",
  "The rules will be the same as the tournament, which is \"VNEA\" rules. https://www.vnea.com/rules#tabs__tab-69",
  "Also, everyone is welcome to come and watch/play outside of the tournament as well",
  "what’s the rules? And how many rounds?",
  "Okay, it seems that many people can make it tomorrow night. Let's aim for 7pm tomorrow (assuming that works for everyone). Everyone is welcome to participate, and the winner will get to go to Pittsburgh as the 4th member of the team",
  "Sorry for this being so last minute. Hopefully many of you are available, but if not we'll have to decide the last spot some other way",
  "Created new poll 'When are you free for a tournament at Suzi Cue's'",
  "Hi all! We have one spot left for the tournament. We were hoping to fill the last spot with the winner of a tournament of our own! Due to time constraints on registering and spring break though, we would need to host this either tonight or tomorrow. Can everyone who was interested in going to the tournament (who hasn't already been contacted) please fill out this survey on your availability",
  "Running late, I’ll be there tho",
  "Reminder that we have a meeting tomorrow at 1pm at Blackburn. Hope to see you all there!",
  "Created new poll 'Tournament??? ت'",
  "Like I said, I'm not sure who all is going. Once we figure out who all is interested we can figure out who is going!",
  "Lol ",
  "We must have song on the team ",
  "May I also join in the tournament?",
  "I am also interested in going ",
  "I'm not sure if you would be able to watch if you aren't participating ",
  "If y’all need a 4th I’d play, but if other people want to play I won’t, can we go just to watch our team play?",
  "I’ll actually be close that weekend bc I gotta go home on the 21st lol",
  "Yes, sorry, it is in Pittsburgh ",
  "Is that near Pittsburgh?",
  "I'd be interesting in going too! Plenty of room in the Tesla for cue sticks and supplies if anyone wants to carpool too :)",
  "And I assume we'll figure out carpooling and lodging and stuff once we figured out who all is going",
  "Just to note, we can only bring a few people (each team is 4 members, but we might be able to bring more if some other schools are bringing less than 4)",
  "I will be down as well, I will be able to carpool if needed.",
  "I’m super down. Anybody wanna carpool?",
  "I’d be down",
  "Yessir we gotta represent ",
  "That sounds super fun",
  "Also to note, this tournament is \"open to all skill levels\" so don't feel discouraged from participating based on your skill level.",
  "Hi all! A grad student from Carnegie Mellon reached out to us about a tournament they're hosting. It would be on Sunday March 24, from 9:00am-5:00pm and would cost $20 a person (we may be able to cover this fee). 8 different schools will be competing. We are only able to have a few students go so anyone who is interested feel free to dm me and we can discuss details.",
  "Either works tbh",
  "Do y’all bring your own cues and stuff or use theirs?",
  "Table 1",
  "What table we at?",
  "I am",
  "About to be ",
  "anyone else here",
  "Yeah, it should be at 7pm!",
  "I think at about 7pm",
  "What time is the meeting tonight?",
  "also, no meeting tomorrow in blackburn.  just the suzi’s meeting on tuesday !",
  "An admin deleted this message",
  "meeting at suzi cue’s this tuesday at 7pm!  there mayhaps be a drunk spelling bee at 8pm as well (for those who are old enough).  see yall there🎱‼️",
  "If you are looking for a pool activity in the middle of this week, I'll be doing a \"Physics of Pool\" event in Morrill Tower on Wednesday (Feb 21) @ 6.30",
  "I have so much laundry and housework to do, it's gonna keep me from hanging out today. :(\n\nI'll catch you guys at the next meeting tho! ",
  "regular meeting in blackburn today though !",
  "no suzi’s this week, next suzi’s meeting will probably be next tuesday (2/27)",
  "You mean this week that just ended, or the one we're going into?",
  "regular meeting this sunday in blackburn rec room at 1pm!  see you all there 🎱",
  "No, no Suzi's meeting this week",
  "Are we meeting at suzzies tonight ",
  "Running late as well ",
  "I’m gonna be late but I’ll be there",
  "Reminder we have a meeting tomorrow at Blackburn House at 1pm. We'll have the door just north of the main entrance propped open for you guys",
  "It was awesome meeting all of y’all! Had a good time, thanks!",
  "I'm here, can someone meet me at the door? :)",
  "What table y’all at?",
  "I’ll be on my way ",
  "I am in front of the bar",
  "I am at the front of the bar, if anyone is here. ",
  "We’ll be there around 7:20",
  "I was talking to Frank",
  "Yes",
  "Is it the bar on 4th and 19th?",
  "I am suzies do you guys want me to get a table? ",
  "I might swing by around 8 o'clock if I'm feeling up to it! -- I had a loooooong day and my brain is Jell-O haha ",
  "Awesome i will be there. ",
  "Yeah, of course you can!",
  "Hey, i am new, and i am interested in joining your club is it okay for me attend todays meet? ",
  "Reminder, meeting at Suzi Cue's tonight. I'll be there by 7 and we'll probably stay until about 9-9:30. If anyone needs a ride, please DM me by 6pm",
  "It starts getting busy after 9 pm",
  "I put it in my calendar so I'll be there! I've never been to Suzi's ... Is it very big/crowded usually? lol",
  "Of course! Everyone is welcome ",
  "Can I bring my friend?",
  "Yep, it's free on Tuesday and Thursday to students",
  "Is it still free for OSU students if it's on Thursday? ",
  "I'm a vote for moving it to Thursday, at least for this semester",
  "I think just for this week, but if more people prefer it on Thursday I'm open to moving it permanently to Thursday ",
  "Is it being permanently or only temporarily moved to Thursday?",
  "Probably around 7 on Thursday, I'll give more exact details on Thursday ",
  "Oh! I might be able to make it now! Still at 7:30?",
  "Okay, thanks for the update",
  "Sorry, this week the Suzi's meeting is moved to Thursday, so we won't have a meeting tonight ",
  "Is there a meeting at suzi-cues tonight?",
  "Reminder that we have a meeting tomorrow at 1pm at Blackburn House",
  "Ope ",
  "It's a spambot",
  "Please don't use this chat to sell things",
  "This message was removed",
  "I have to eat first but I was gonna try to come hang out around 1:30 or so! :)",
  "Last week some of us were talking about all the different variants of \"bar rules\".  As it happens, the famous Dr. Dave addressed the topic just this week.  Search Youtube for \"Dr Dave bar rules\" or follow the link below.   He has videos on everything, including another topic from last week, pool etiquette.  https://youtu.be/x8sI73wlyoM",
  "Hey all! Just a reminder that our weekly meeting is tomorrow at 1pm at Blackburn House. We'll have the side door (north of the main entrance) propped open",
  "There’s three of us here already ",
  "Im on my way",
  "Are you guys at Suzzies?",
  "I may go to Suzie cue at about 2 pm today and leave around 4 ",
  "I am not able to go at that time. : (",
  "I should be able to drive you as well. DM me details if you could ",
  "I’m down to go but I would need a ride there and back",
  "Probably until about 9. Each person can stay as long as they want though ",
  "Thank you so much 🙏🏼",
  "How late are y'all going to be there? I might be able to make it around 7:45-8:00-ish",
  "I should be able to",
  "Hey question, I have a ride for later but is someone able to drop me off after? My friend is driving me and then won’t be able to pick me up after",
  "We'll go ahead and have that meeting at Suzi Cue's tonight at 7pm. If you want to go and need a ride, reach out to me before 6pm and we'll be able to arrange something. I look forward to seeing you all there!",
  "We might have a meeting this Tuesday at 7pm @ Suzi cues if there is enough interest. Please answer the poll if you are interested!",
  "Created new poll 'Would you be interested in going to Suzi Cue's this Tuesday at 7pm?'",
  "Okay! See you guys soon!",
  "Yeah, don't worry about running a little late",
  "Okay! I have to hop a CABS from west campus so I'll probably be another 20 minutes or so. I take it you two will be there at least? :)",
  "Yeah, I'm here",
  "So come in through that entertainment ",
  "Also is anybody there yet?",
  "Yes, but we prop the door open on the west side of the building ",
  "Hi! I'm still kinda new to campus but I was wanting to attend today and say hi. :) The only Blackburn on campus is Blackburn House right? 😅",
  "I'll be picking up donuts from buckeye donuts so make sure to get to Blackburn before they are all gone!",
  "Meeting tomorrow at 1pm in Blackburn !",
  "Ends whenever",
  "I think it starts around 1 tmrw",
  "What time does  the club  start  and end?",
  "It's at 1pm in Blackburn",
  "what time for meeting tomorrow ? ",
  "That works for me",
  "How about 5?",
  "I'm only free till about 7:30, so if you'd like to meet earlier I'm down",
  "Haven’t decided yet but around 7 probably",
  "About what time are you thinking?",
  "Anybody wanna go to suzi cue tonight? Ik it’s cold as hell out",
  "We won't have a meeting tomorrow because everyone is just getting back to campus, but we will have a meeting next Sunday at 1pm! ",
  "Same",
  "I wish but I’m out of town",
  "Anyone wanna play pool in Suzie cue today?",
  "Well in that case I’ll be there in 30",
  "i may leave around 4:30pm",
  "Ohh I thought you meant later, I’m like a mile walk from there",
  "Head to there from campus now :)",
  "Or 40",
  "maybe around 2:30pm",
  "Depends what time but I’m hella down",
  "Anyone wanna go to Suzie later?",
  "thanks!",
  "sweet, I’ll check out suzis then",
  "Well Suzis is a solid place to practice and it’s close, also Blackburn dorm (where we meet) has 3 tables if you can get in, also I think Suzi’s is free on Tues/Thurs for students",
  "dang, I’m neither 21 nor have a car",
  "note about bankshots though, you do need to be 21 after 8pm unless they change it ",
  "@Daanish Ghanchi You can definitely find randos to play with at Suzi’s, but it’s mostly just people chilling. Bankshot in Hilliard has more enthusiasts and serious players.",
  "is suzi cue a good place to go as a beginner and play against random people?",
  "Yeah that’s just rude ",
  "Please don't use this group to sell tickets",
  "I’m giving away DOJA CAT tickets for Tonight @Nationwide Arena, Columbus,OH DM if you’re interested \n(442) 284-0335",
  "Yes",
  "Still in Blackburn today?",
  "Last meeting of the semester tomorrow at 1pm!  See yall there 🎱",
  "Reminder there’s no club meeting today because of Thanksgiving break!  Enjoy the last day of break!!",
  "Ahhh I see",
  "The side door north of the main entrance is propped open",
  "Does somebody need to let me in or can I just come in?",
  "Reminder we have our weekly billiards club meeting tomorrow at 1pm in Blackburn rec room !  See you all there 🎱",
  "I also play pool on Fridays from 12:30 to 2pm lol",
  "Sounds good! I haven’t played in a while, a little rusty😂",
  "In rpac ",
  "5pm to 7pm",
  "I usually play on Mondays",
  "Any of you guys ever play during the week? Like Monday through Friday? Or just on Sundays?",
  "No meeting tomorrow, enjoy the rest of your long weekend!",
  "See y’all tomorrow in Blackburn for billiards club at 1pm !!  🎱🎱",
  "Just a reminder that the meeting today is at 1pm at Blackburn. See you all there",
  "Next meeting is next Sunday at 1pm again! 😜",
  "/meeting schedule ",
  "When’s the next meeting? ",
  "Sorry for last minute change but we’re gonna have our billiards club meeting at 1:00pm today in the Blackburn Rec Room !!",
  "No billiards club this weekend.  Enjoy your fall break!",
  "do we have a meeting on Sunday ? ",
  "Just a reminder, we are meeting at Suzi Cues today at 3pm, and will not be at Blackburn. See you all there!",
  "This week’s meeting with be Sunday October 8 at Suzi Cues at 3pm!  Can’t wait to see you all there",
  "This message was deleted",
  "Sorry, fill out the second poll !",
  "Created new poll 'Sunday October 8th at Suzi Cues'",
  "Created new poll 'Sunday Oct 8 at Suzi Cues'",
  "Hey guys, we’re thinking about holding next meeting at Suzi Cues next Sunday at 3pm.  It’s the pool bar by fourth and 18th st, but you don’t need to be 21 to get in!  If everyone could fill out this poll, that would be great ",
  "Yes. Meeting today at Blackburn at 3pm",
  "Do we meet a blackburn  today  at 3pm?",
  "I will be bringing some buckeye donuts, so make sure to get there early so you can grab one",
  "Remember we have a meeting today at 3pm at Blackburn House",
  "Yes, we're meeting this week. 3pm at Blackburn House ",
  "So again, are we meeting this week or not?",
  "Bro 💀",
  "selling tickets dm me if interested",
  "Do not use this chat to sell tickets please ",
  "Im selling my Morgan wallen tickets text me if you are interested ",
  "Are we meeting this week?",
  "I  got the  doors  open already",
  "Not yet, I’ll be there in around 45 minutes!  ",
  "Hey the doors  are open ",
  "i think ill have to come next week since midterms are this week 🥲",
  "Yep!",
  "same location and time?",
  "We are!",
  "Are we meeting tomorrow?",
  "This message was deleted",
  "I am going to sell these cues, if you are interested, please let me know. ",
  "If anyone tried to enter in the last 5 minutes, the door got unpropped.  Sorry, it’s open again!!",
  "Selling my season tickets ",
  "👍",
  "I don't believe so. I'll be there in about 10 minutes though to prop the door open",
  "Are ppl there already",
  "This is the entrance that you'll want to go in",
  "Hey guys, reminder that the first meeting is today in Blackburn House at 3:00pm!  You can enter through the side entrance to the rec room (across from Scotts dining hall), the door will be propped open.  \n\nThere will be donuts for anyone who shows up, no experience required.  Look forward to seeing you all there!",
  "Thanks 👍",
  "Yes 👍🏻",
  "Is there  pool  tomorrow  at 3pm?",
  "Its got 3 tables",
  "Does Blackburn have enough pool tables for 15 people?",
  "Is there  going to be  billers  club tomorrow  because  of the holiday?",
  "I’m selling my season tickets text me if you are interested",
  "@Jake Fisher I can definitely help you with that! Straight potting, cut shots, jumps, banks, masse, all of it man. Feel free to dm and we can get things set up! ",
  "I won’t make the meeting this week, but I will next week and I would want to better my skills.",
  "If anyone wants to learn to play any of the other game variants, let me know! I'll be bringing my regulation balls, pocket reducers (to practice accurate potting, or to better play snooker which I'll be bringing balls for!)",
  "Please vote in the poll so that we have an idea of how many people will be showing up this weekend !!",
  "Created new poll 'Who plans on attending the first meeting this Sunday at 3pm ?'",
  "Meetings are casual, I am usually there from 3 until 5-5:30 but you’re welcome to play as late as you want ",
  "What time does the meeting end?",
  "Ok",
  "No, we have a few cues for members to use!  Blackburn should have cues as well",
  "I'm selling my season tickets text me if you are interested",
  "Do we have to own a cue to join this club?",
  "If anyone wants to buy pool cues please text me.  I have a variety of shafts, maple or carbon fiber, and different tip diameters. The shafts are all from predator or cuetec which are very famous billiard manufacturers. Please let me know if you are interested  ",
  "awesome, thank youu",
  "The meetings are mostly just people meeting to play pool, so there is no obligation to go, and not much to miss",
  "Will i be missing a whole lot for the first meeting? I’ll be home on that weekend so I won’t be able to make it",
  "Anyone interested in learning games other than 8/9/10-ball? I can teach ya how to play Kaisa equivalent for a pool table, 6 ball, one pocket, straight pool, 15 ball rotation, seratoga, etc. For new people and those who don't know me I'll be getting sponsored by McDermott Cues in October and started my professional career this year. Going to be playing in the October Ohio Open. ",
  "No club today, first meeting September 3rd at 3pm in Blackburn Rec Room !!",
  "Is there billiards club  today?",
  "especially considering we don’t have classes on sundays ",
  "balance*",
  "i think weekends are nice, and if there’s pop up meets then i feel like that’s a good balence ",
  "I personally prefer the weekends",
  "I prefer Friday ahaha",
  "Honestly, for me I have more time on Friday and Saturday.  :(",
  "First few meetings are Sunday at 3pm but they might change if it works better for most people.  We’ll also do some weeknight casual meetings this semester!",
  "just asking because I work only Sundays from 4 to 9",
  "are the meetings only on sundays?",
  "In Blackburn",
  "Where?",
  "The first meeting is going to be 3pm on September 3rd",
  "When will meetings start back up? ",
  "We still in blackburn?",
  "Tentatively , yes",
  "And I believe that the Sunday meetings are at the Blackburn rec room?",
  "Right there I think",
  "Where is that?",
  "Sundays at 3pm, but we also occasionally go to Suzi Cues during a week day",
  "When do meeting take place?",
  "Hello anyone have the ticket exchange group??",
  "Hello @everyone,\nPlease join our Discord server. A place for students to pay vetted tutors to do their homework , online exams, write research papers, complete online classes and back assignments.\n\nDiscord: https://discord.gg/QN24TRp98D\nhttps://tenor.com/view/homework-kowalski-penguin-slap-slapp-gif-18197338",
  "Selling 2 Taylor swift tickets hmu @(669) 732-8663 If you’re interested ",
  "Selling 2 Taylor swift tickets hmu @(669) 732-8663 If you’re interested ",
  "This message was removed",
  "Anyone want to play today at Suzie? I'm here and looking for a game",
  "OK. See u then",
  "Yeah",
  "Are u free then?",
  "I can be there around 3:15",
  "What time? ",
  "i can",
  "Who wants tobplay at suzies today? ",
  "I'm bringing pocket reducers, snooker and my magic racks. ",
  "Thanks everyone for the great memories these past few years. And great friends. I believe that we have built a pool community at OSU that will endure years from now. President out 🎱✌🏻",
  "Hey everyone! We’re going to have our last meeting of the semester at Suzi Cue tomorrow. 3pm as usual. Message me or Sanjay if you want a ride there.",
  "For a couple more hours ",
  "How long you plan to stay there?",
  "I'm at suzies rn ",
  "Anyone wanna play pool around 5:30?",
  "salata.15",
  "wright.2577",
  "Stivland.1 ",
  "song.2107",
  "Shinkle.34",
  "Hey y’all!  I need a certain amount of “registered members” to re-list billiards club as an official org.  If you attend meetings somewhat regularly, please drop your name.number in the chat (or send to me) to be added as an official member ",
  "Yes, last meeting is next week",
  "Is the last one next week? My friend and I might try to come",
  "We’ll decide what to order when we meet at 3pm.",
  "Hey everyone, today is the second to last meeting of the semester! Let’s celebrate with some pizza 🍕",
  "ok see you later",
  "nick and I ",
  "We are already here ",
  "Rpac",
  "I may play pool in road around 3:30. And welcome to join me",
  "Sounds good",
  "i may go there later",
  "At suzie cue if anyone wants to join! In the mood for a 10 and 9 ball race ",
  "He's not retiring this year",
  "Cap",
  "Ronnie O'Sullivan's final season",
  "World champs starts I won't be leaving my house for 17 days",
  "Sorry I'll be busy watching snooker",
  "If I were in the area I would. ",
  "Anyone wanna play pool tomorrow?",
  "Happy Easter! We’re playing poker and pool at Blackburn today.",
  "I'll be ar suzies now and for the rest of the day. Feel free to join me! ",
  "Who wants to go to Susie's tonight? I'll be there around 630",
  "Hey everyone, club meeting at 3pm in Blackburn today as usual!  See y’all there",
  "Anyone want to play tonight? ",
  "Anyone is welcome to join ",
  "I will be at suzies until 630",
  "I can also go there tonight like after 5:30",
  "I can go later tonight, like anytime after that but that's not very helpful.",
  "I'm at suzie cue if anyone wants to join. I'll be here until 445",
  "I’m at rpac now if anyone wants to join",
  "Anyone wanna play in the afternoon?",
  "Hey everyone, the club is meeting at Blackburn today. See y’all there.",
  "Hello I’m selling 2 Taylor swift at an affordable price 4085384650",
  "I'm at Suzie cues if anyone wants to join ",
  "Anyone who's in the area want to play? ",
  "No club today since some people are still getting back from break.  Club resumes next Sunday at 3:00pm in Blackburn as usual!",
  "Club today? ",
  "But last night he only charged me $3 for me and my nephew to play for 3 hours. ",
  "$3/ person/ hour all 9ft tables and two 10ft snooker tables",
  "Anyone want to play at valley billiards? ",
  "My nephew and I played some snooker at Valley Billiards tonight. I got a break of 80 on my first game and a 63 on my second! Only 4 points were from fouls from my nephew lol. ",
  "Balls*",
  "I would but am in Wilmington. Also getting pocket reducers so that it's more appropriate for the snooker balks. ",
  "im playing pool in rpac now if anyone wanna join",
  "Anyone wanna play pool together these days?",
  "Thanks. ",
  "Yes",
  "Is rpac open during spring break?",
  "No meeting today, y’all. Have a good break!",
  "No, that noise was in fact the pool balls lol thought you were talking about the gears shifting lol my bad ",
  "I’m selling SZA tickets at a cheaper price Dm if you’re interested \n(210) 446-9722",
  "Yeah, transmission needs checked ",
  "Dang, so was the noise the other day your car then?",
  "I am In Wilmington because of car issues, but when I'm back in the area most definitely :) I'm excited to test out the cue! ",
  "Nice snooker set man. You want to bring it to Suzi Cue later?",
  "But yeah I plan on playing on the tables at suzie to just play and practice, couldn't find pocket narrowers:(",
  "Haha ur good",
  "I thought I typed 10, surprised I didn't type 120 lmao ",
  "Yeah they're 10, sorry I just looked at my previous message, my phone was at 4% and could hardly see my screen 😂",
  "Rumors on the internet say the tables in dayton may be 10 ft",
  "Especially for 17 days in April",
  "I know the rules-I watch a large quantity of snooker",
  "I can teach you ",
  "Just harder to play in this country",
  "Would be fun. I play pool (obviously) but I basically exclusively watch snooker",
  "They have diamond pool tables with simonis cloth as well ",
  "We can go sometime ",
  "The snooker tables are at valley billiards in Dayton. ",
  "I know they're bigger, but I can still play. I know the rules of billiards, Song. ",
  "Anyone wanna play around 3:10 in rpac?",
  "Bro the pockets in suzies are too big for snooker",
  "Oh shit where at",
  "12",
  "10 ft or 12 ft?",
  "Is there any snooker table around the campus?",
  "I'll play at suzies on the 9ft tables, but there are two snooker tables in Dayton I play on ",
  "Where tf you playing snooker",
  "Look what goodies came in the mail! ",
  "I’m selling SZA tickets at a cheaper price Dm if you’re interested \n(210) 446-9722",
  "I might be able to tonight",
  "Hey does anyone want to shoot pool at Blackburn",
  "Thanks! On my way.",
  "Side door is propped open 🫡",
  "I'll be there in 10 ",
  "I definitely want to be a part of this",
  "Hey everyone, pool club is today! We have an important announcement:\n\nWe are calling on our most committed members to consider being involved in club leadership for next semester. If you want to throw your hat in for an officer position, or have ideas for how to make this club even better, please come to today’s meeting, or get in touch with me.",
  "I'll be going to suzie in 30 minutes ",
  "anyone wanna play in road now?",
  "Hi everyone! I sent out a survey a while ago, and someone pointed out some flaws with it and helped me revise it a little bit to be more precise.  For those of you that don't know about the survey, it is a questionnaire about the current state of the pool equipment on campus. \nIf anyone has the time to (re)do the survey, I would greatly appreciate the responses. Thanks for the feedback and apologies for the inconvenience to those that filled out the previous one!\nhttps://docs.google.com/forms/d/1s8otI1drx0QdsXiuVqQWDwnu-dVjiRXsA_Rechih1YQ/edit",
  " I can't play at the R pac but I am down for pool at a pool hall later tonight or tomorrow ",
  "anyone down for pool",
  "Robert and I will likely still be here",
  "Will anyone still be at Suzi’s around 9:15. Im have class till 9 but can come after",
  "Would anyone else like a ride to Suzi’s? Picking up around 5:45.",
  "I may play at Suzi Cue from 3 to 5, if anyone wanna come, see you then. :)",
  "So, @everyone, soft announcement…\nIf you want to come hang out at Suzi Cue this Thursday, we’ll be meeting around 6.\nLeave a like if you’re interested? If anyone needs a ride, let me know.",
  "I can drive a few people.",
  "Yeah, 6pm works for me. I'll need a ride though. I'm at Morrill Tower, so I can meet at the RPAC drop off if someone is able to drive me",
  "Does 6 p.m. sound like a good time?",
  "@Nick K    I certainly think we should. I’m thinking this Thursday…",
  "@Trent Sandstrom (Pres.) Are we going to Suzi-Cue's Tuesday or Thursday, and if so, what time?",
  "Happy Sunday, everyone. See y’all at Blackburn, 3pm 🎱",
  "I'm at the RPAC shooting some pool if anyone wanted to join",
  "I’m free to play pool from 3 to 5",
  "Ok",
  "I'll be free later tonight to do something tho ",
  "I'm sorry :( ",
  "I’m free around 3",
  ":(",
  "Won't be available then ",
  "I mean I may play around 3",
  "Oh",
  "I'll be there in 15",
  "Anyone wanna play today?",
  "Little behind walking in now",
  "Ill be there in about 25",
  "just left :(",
  "There’s a table open atm ",
  "good luck christopher…",
  "I'll likewise come ",
  "Rpac",
  "Rpac",
  "Cool where do you want to play?",
  "I can in about 15",
  "Hey everyone,  I know I am new here but i was wondering if anyone wanted to play today?",
  "Anyone available to play now? ",
  "Anyone available to play tonight? Can't make the meeting; currently studying ",
  "You guys still there?",
  "Texas hold ‘em poker today for anyone who wants to play. Pool will still be going on.",
  "sadly can’t make it i’m home for the weekend",
  "How many people will be playing pool today instead of poker? ",
  "Yes, 3pm today in Blackburn as usual!",
  "is there billiards club today?",
  "Anyone want to play tonight? ",
  "I'll be there in 5 for anyone else",
  "Sounds good",
  "I may be there around 1:30",
  "Rpac, bringing my regulation balls",
  "Where do you wanna play?",
  "I can not, sorry",
  "I can play",
  "Anyone free to play before 3? ",
  "Dm me",
  "Did you want a ride? ",
  "takes me a while to get to rpac lol i’ll start walking. will be closer to 20min",
  "I'll be at rpac in 10! Bringing my regulation balls and feel free to use my cue if you don't have any ",
  "sure",
  "Anyone want to play today? ",
  "Hahaha thanks :)",
  "Don’t worry, we’ll save one for you!",
  "Ugh, I definitely would but I was planning to come by a bit late today :')",
  "Yo, who wants donuts at today’s meeting?",
  "Anyone want to meet before club to play? ",
  " I will be back on Sunday",
  " I would play but I am in Washington DC for the March for life",
  "anyone wanna play at rpac?",
  "I can play after 5:20",
  "I'm at the RPAC",
  "Anyone wanting to play until 5p? I brought my own regulation balls and cues ",
  "WOO!!",
  "Thanks to everyone who came to the first meeting! This is going to be a great year for Billiards Club.",
  "heading over now",
  "Is anyone here yet?",
  "To any newcomers, please enter at the side door to the pool room, not through the main entrance.",
  "@erik You bet, man! See you then.",
  "I will not make it tomorrow; I will be there on the Sunday the 22 can you tell me what we did this weekend next week. thanks Erik.",
  "Hello everyone! Hope the start of your semester is going well.\nDue to the enthusiasm in the chat, we will have our fist meeting tomorrow! Like usual, we will meet at 3pm in the Blackburn Dorm House.",
  " ^^",
  "^",
  "when is billiards club Starting up again?",
  "i can play anytime afterwards",
  "i finish classes by 12:30 pm on tues and thursdays",
  "heyy",
  "My number is 614-867-1154, hmu if you ever wanna play",
  "Anyone free to play Tuesday or Thursday mornings? I don’t have class until 11 but I’m usually on campus by like 9:30",
  "When will the first session be?",
  "This message has been deleted",
  "http://extraessays.ml - cool writing service",
  " Hey if anyone is in cbus and wants to play pool tonight lmk",
  "Arps garage is close",
  "Is there any parking garage around Blackburn?",
  "Hey y’all. Reminder that our last meeting of the year will be at 3pm in Blackburn! See you there.",
  "http://extraessayz.ml - the very best in the writing service industry",
  "http://extraessayz.ml - the very best in the writing service industry",
  "Thanks a lot",
  "Good to have you, Song! I’d say pool club is on for this Sunday. Anyone who wants to take a break from their studies to shoot some pool should stop by Blackburn at 3pm.",
  "Play pool, the \"official\" meeting usually lasts like 2 hours, sometimes people will stay later than that.",
  "Do we usually meet on Sundays to play pool or just a normal meeting?",
  "Get it",
  "Speaking of, will there be one this Sunday with finals ongoing?",
  "We meet at Blackburn every Sunday at 3. Super casual meeting ",
  "I just joined the billiard club, is there anything I need to know?",
  "Hello",
  "hello ",
  "http://speedy-essays.ml - Consider a chance to get essay written by professionals - It will save you much time and effort necessary for other undertakings - You will forget about anxiety once and forever",
  "thanks�",
  "Definitely! 3pm at Blackburn.",
  "is there billiards club tomorrow?",
  "Meeting today will be at the RPAC at 4pm.",
  "Hey y’all, last day of break. Let’s get a count on who wants to meet today. Like this message 👉",
  "Seems like it's hunting season for bots",
  "http://extraessays.gq - the very best in the writing service industry",
  "http://extraessayz.ga - cool writing service",
  "150",
  "How much? ",
  "Selling 2 tickets to the Michigan game this weekend",
  "http://paperz.gq - Professional academic help for you!",
  "Dope, we’ll meet you there",
  "id be down and i might have a partner too",
  "Anyone tryin to play doubles with a roommate and me at like 9:30 tonight at the rpac?",
  "http://paperok.ml - Professional academic help for you!",
  "Meeting at 3pm today in Blackburn. See you there!",
  "I saw Jason",
  "Anyone in yet?",
  "Yes, we’ll be there!",
  "No meeting today?",
  "Does anyone need a pool table? Someone I know is selling their barely used 8 ft Brunswick for around $200, which is a pretty crazy deal. Comes with balls, cues, a cover, and a pingpong table top.",
  "In light of the last day of “summer,” go enjoy the nice weather!  No official meeting today ☀️",
  "Meeting at 3pm in Blackburn as usual!  Hope to see y’all there",
  "Yes, Blackburn House. It's across from Scott. It's in the game room",
  "Where is lit Blackburn bourse?",
  "Until around 5pm ",
  "How y’all gonna be their for?",
  "I'm like 5 minutes away",
  "I’ll be there in like 2",
  "Anyone here yet?",
  "Thanks!!",
  "Sorry about that :/ Get well soon!",
  "I’m sick and can’t make it 😟",
  "Come on down to Blackburn tomorrow at 3pm! Let’s play some pool 🎱🦾",
  "Afternoon, everyone. We won’t be having a meeting today. See you all next week.",
  "Hello everyone,\nPlease join our Discord server. A place for students to pay vetted tutors to do their homework , online exams, write research papers, complete online classes and other assignments.\n\nhttps://discord.gg/QN24TRp98D",
  "Hey, last reminder to anyone who wants to stop by Suzi Cue tonight. Feel free to show up anytime from 7 to around 9.",
  "I missed the poll, but I would go and can drive",
  "Going to add everyone who’s interested in going to Suzi-Cue to a new chat for planning rides. Let me know if you missed the poll but want to come.",
  "I forgot to take the poll, but I’m interested in going! I’d need a ride tho",
  "Damn I just finished studying 😂",
  "I am, almost everyone else left or is leaving",
  "Are you guys still at Blackburn? ",
  "And as always, we will be meeting 3pm today at Blackburn.",
  "Hey everyone! I want to organize a trip to SUZI CUE this Tuesday at 7pm. If you are interested in going, please take the poll so we can figure out who needs a ride and who would be willing to drive.",
  "Created new poll 'Suzi-Cue trip'",
  "Oh okay. Thanks Nick :)",
  "Some people stay a little bit of that time, but I'm typically the last one to leave, so I'd say a little bit of both",
  "if you stay til 7, do you have other ppl there too? Or just your own company?",
  "Oh okayy",
  "As long as you want to stay. Usually there's a decent amount of people that stay until 5pm, I'm usually there until about 7",
  "Heyyy. Sunday is from 3pm to what time?",
  "Hey everyone! I'm currently writing up a proposal to send into the University in response the overall poor state of billiards/cue sports equipment on campus (leaning tables, broken rails, almost no cues with tips, etc, no snooker tables, etc.). If you have a few minutes and are willing to fill out this survey to the best of your ability, I would greatly appreciate every response! Here is the link:\nhttps://docs.google.com/forms/d/e/1FAIpQLSdCDtVXISuiYdWlONLymEZqjD86Qn6fjNZNy82x3fjQjHo4Dg/viewform?usp=sf_link\n\nIf the club board doesn't want this in here, I can remove the message. Just felt it's one of the best places to gather information for this topic. Thanks!",
  "Yeah, probably next Tuesday. Stay posted for details.",
  "Do you think we’ll end up meeting a second day?",
  "Sunday 3pm at Blackburn",
  "what days do you guys meet up again?",
  "Yes, the club is still active if that's what you're asking",
  "Hi everyone, just joined the group. Is this club still on? �",
  "Does anyone live at Blackburn and can let me in to get my cue tip at some point during the week? I forgot to grab it when I was packing up",
  "Same here",
  "But on my way",
  "Im running a little late",
  "You’re welcome",
  "thanks Trent",
  "Yes",
  "thank is it at Blackburn house ?",
  "Yes",
  "is there billiards club  today at 3pm?",
  "I have a 530-650 class those days and usually leave campus on the weekends. Fridays work best for me because I just have some late classes during the rest of the week",
  "I have a class tues and thurs from 530-650 unfortunately :(",
  "^same here",
  "I'll just add that I voted for Tuesdays, but both days work for me. ",
  "Too early?",
  "Seems those times don’t work for some people. Can I hear from some of you what the conflict is and some suggestions?",
  "Undecided. Either Blackburn, RPAC, or occasionally Suzi Cue which is free Tuesday, Thursday.",
  "Are these meetings also at Blackburn",
  "Created new poll 'When to meet?'",
  "Hey everyone, meeting tomorrow 3pm at Blackburn!\n\nLet’s also take a vote for meeting either Tuesdays or Thursdays at 6pm, in addition to our Sunday meetings:",
  "Ok, thank you!",
  "I got mine online. I use Vaula",
  "Honestly online, you can go to different pool halls, but they just aren’t as high quality as the ones you’ll find online. ",
  "Does anyone know where to get a glove for pool? ",
  "the rec room. you can come in the side door",
  "Where IN Blackburn do you guys meet lol",
  "I’m at Blackburn ",
  "My badd",
  "Ohhh so that's you. Okay. I didn't ask what your name was 😂😭",
  "Yes I was at the rpac a couple days ago ",
  "This message has been deleted",
  "Not us spamming the gc with messages lol",
  "😀✋️",
  "I-",
  "Broken rails, pockets with loose or no nails, and leaning quite a bit",
  "Sorry, I literally can't remember ppls names 😭",
  "Wait Krishna, were you at the lounge 2 days ago too?",
  "Nosker has a nice table that's barely used",
  "How's it like",
  "Lol I haven't seen em",
  "Lord have mercy on the west campus tables",
  "I feel like most campus tables are pretty nice. They're no worse than most bar tables which most real life games are played outside of tournaments. ",
  "First come first serve tbh ",
  "😂",
  "You can just go in",
  "Nah",
  "Do you have to reserve the rpac tables or is it first come first serve?",
  "Never mindd",
  "Ohhh",
  "Actually i font know anyone in this group. I havent been to any meetings @Anjani Kaluvala i wanted to pull up the other night but physics had me 50 shades of f’d up",
  "RPAC tables are noice",
  "I'd recommend the RPAC tables over most of the dorm tables honestly",
  "Okay. What times do yall usually go play Tuesdays and Thursdays?",
  "Bett ",
  "I work at bowen and they have a decent table. Not very good cues tho. I play there most of the time",
  "Yooo, I met you two days ago too right?",
  "On Tuesday and Thursday it is free, all other days you gotta pay",
  "I shall bring my mini pool table back to campus this weekend! But does anyone live in a dorm that can let me in to play real pool tho?",
  "Oh,  awesome. Idk really. I just guessed",
  "bruh, I thought it was for free 💀",
  "I turned 22 like a few days ago, so im good 😌",
  "I usually go at like 7 or 8 and play for a couple hours with some friends I convinced to come with me lol",
  "Oh shi",
  "It is 18+ last I checked",
  "They are usually 6.50 an hour for the table",
  "Blackburn, 3pm",
  "Yeah I think it is 21+ sadly. Most times they don't card tho. ",
  "How much is that place normally? I have class tues/third 5:30-6:50",
  "isnt suzi cue a bar? and 21+ only??",
  "^^^",
  "Where's the meeting at tmrw",
  "Ouu bet bet. How far is that from the union. Walking distance ",
  "What time tho",
  "I go there all the time. Great vibes",
  "Mini pool?? Where is that",
  "Suzi cue is free for students on Tuesday and Thursday nights",
  "I wanna play mini pool! ",
  "At pool",
  "Nick is so good peeps",
  "Yooo",
  "Yup!",
  "This is you right that I met 2 days ago?",
  "Anyways!! i have a mini pool table Aahahahah Who wants to meet up and play some mini pool😀",
  "nickk",
  "That’s my classic move sadly",
  "I usually win bc ppl hit the 8ball in the wrong hole hehehe ",
  "sorry my stroke game is weak",
  "Most of the time, you don't really even have to hit real hard to break it up fairly well. It's mostly about hitting with a good stroke at first. Power comes with time and confidence as you refine your stroke",
  "i hit the cue and it slightly moves maybe one or two balls but never enough to actually break the whole thing",
  "I'll be bringing some loaner cues down if anyone wants a personal one to use, especially since the dorm cues generally have no tips, etc. ",
  "im like SO trash. idk how yall get freaking power",
  "omg i need to learn how to break",
  "AHAHA. I need to practice ngl. Been awhile. I'm a bit rusty. But I'll be prepared 😌 and see who wins 🏆 ",
  "Get ready to get whooped 😤",
  "We should schedule a day to meet up during the week to play pool in the lounge ",
  "I was like, I really want to play. But Sundays are my rest days yk 😭 im a commuter student",
  "I’m down for that 100%",
  "Let's gooo",
  "Ayyyy",
  "Noted! Then we should definitely figure out another meeting time during the week. Perhaps at Suzi Cue.",
  "Officials are Sunday at 3, but people are more than welcome to message in the groupchat and meet up throughout any time of the week",
  "Yeah ive been wanting to go to meetings but i have a conflict with my schedule ",
  "no fax bc i be working on sundays😭 so i never get to go",
  "is there any other days that meetings take place besides Sunday? 😭",
  "Yep, next meeting is tomorrow at 3pm in Blackburn 👍",
  "Pretty sure they’re every Sunday at 3",
  "When is the next meeting",
  "They could also use the GroupMe college discover feature where they input their OSU email and can see a list of OSU affiliated GroupMe chats. In that list is the Billiards Club as well",
  "Refer them to the OSU club page, have them message an offer, and they'll add them. That's what I've been doing when I recommend the club to people",
  "How do I add a member",
  "https://apps.apple.com/us/app/fuzemee/id1532369140\n\nY’all should get this app, marketplace just for OSU students, it’s really cool",
  "Aight I'll come, omw. Bout 20 min out",
  "You can still make ittt",
  "I wanted to play with yall tonight but I'm too far a walk to make it atm",
  "On Saturday from 12 -  6 I work at bowen and we have a pool table here. I'm totally down to let you guys in and we can play. Only 1 table tho",
  "I'm here",
  "Yes sir. I will likely be here past 8 at this point",
  "I’m heading over ",
  "yes",
  "Are y’all still at the rpac?",
  "^ same here",
  "I’ll probably come by if you are still playing when my class finishes",
  "Oh okayy",
  "Probably until 8ish",
  "How long will you stay?",
  "okay bet",
  "ohh",
  "I usually stay for multiple hours on end. Yup, in the lounge",
  "And is this in the lounge?",
  "At the rpac",
  "How long will yall stay ",
  "Logan and I are shooting pool at the RPAC. Let us know when you get here if you need directions to the room",
  "@Nick K i’m at Curl eating atm so whenever ur free u lmk and i’ll head over",
  "kk i will dm u when we are available @Katelyn Chu ",
  "Okay well i wont be able to join till like 6 or so ish, but keep us updated @Logan Porter ",
  "Yeah, the RPAC tables are in the lounge on the bottom floor. They have 2 of them. The cues there actually have tips too, unlike almost all the dorm cues. If you two wanted to go earlier, you only need your BuckID to get in. This line will go fairly fast honestly, only takes like 5-10 mins tops",
  "i’m guessing it’ll be around 530 cuz the line at scott is long as hell. unless h wanna head up there now and we can get some games in before Nick is available",
  "okay i dont live in a dorm so if you guys find a place lmk bc i wanna play pool too",
  "please do!",
  "omg can i join later too ",
  "i didn’t know rpac had tables. id be down to try those",
  "The RPAC tables are generally somewhat better than the dorm ones, but I live in Morrill. Up to you whichever place you want to go.",
  "i can do it later sure. i don’t care which dorm i live off campus so i can’t get in them anyway",
  "If you can do it later*",
  "I can in a bit. I'm going to eat at Scott once they open in 5 mins, then I'd have to head back to my dorm and grab my cues. Where would you be playing?",
  "would anyone like to play 8ball if u live in a dorm?",
  "As long as you care to stay! We usually stick around until 5 at least.",
  "^",
  "How long does the meeting go for? ",
  "Sorry i can’t come I just have too much studying to do :(",
  "Hello everyone! Tomorrow we will meet at Blackburn at 3pm as usual. Please like this message to RSVP.",
  "Bruh. Seriously?",
  "My man looking to get COAMed in a big server",
  "Hello everyone,\nPlease join our Discord server. A place for students to pay vetted tutors to do their homework , online exams, write research papers, complete online classes and other assignments.\nhttps://discord.gg/85RAAeeNcN",
  "I guess being a good player consists of skill and style.",
  "Probably helps having the smaller tip too, I agree. I'm guessing that's how players with snooker cues (even pool players have some) can get significant screw shots and replicating them with our cues is virtually impossible",
  "I see. I was thinking physically, a smaller tip would apply more precise pressure on the point of the ball you were trying to strike while a larger tip would take up more surface area and therefore be less effective. It must be a combination of both cue size and ball size. ",
  "Trying to find info about tournaments especially times when people were playing before that site was around was a nightmare",
  "Snooker.org is the best site ever created",
  "The cues help be more precise, not adding extra side especially. It's hard to tell with larger tips if you added a fraction of a tip left or right. I'm almost certain the spin has to do with the size of the balls; if you took Physics, it has to do with angular momentum. It's easier to get something to spin faster when it's smaller. Same premise here",
  "Is it because of the balls or the smaller tips on the cues?  Idk cause I've seen pool players with snooker cues before",
  "It's nice how much easier it is to get spin on those balls though",
  "I've heard 12 x 6 feet. Plus smaller pockets and smaller balls. It's wild how they make those crazy shots. Snooker players make it seem so much easier than it really is ",
  "Nevermind, must've misread something. It's scary all around. ",
  "Only 10 ft in US, 1 ft longer than 9-ball tables. Europe is 12 ft, those scare me",
  "The pockets are so tiny",
  "Snooker players are unbelievable. The size of that table alone makes me tremble",
  "Here's a good snooker calendar\nhttp://www.snooker.org/res/index.asp?template=2",
  "Snooker players are built different ",
  "Awesome, I'm definitely more interested in watching 8 ball and snooker. I'll definitely search that up and see what I can find tho as I've always been interested in watching live games ",
  "There's different ones for different types. You'll find various calendars for 8-ball, 9-ball, 10-ball, one-pocket, and snooker. I'd recommend simply looking up \"x calendar\" on google, you'll find different leagues posting their calendar(s). I haven't personally seen a general consolidated one, but some tournament organizers/leagues will put multiple games into the same calendar (ex. 9 and 10 ball are often lumped together)",
  "Does anyone have a website or something to keep up with current pool tournaments and when I can tune in to a tournament? ",
  "That is tragic",
  "😭😭 for that poor man. That was an easy set up",
  "If you need a pick-me-up, this happened at the European Open Championship\nhttps://youtu.be/Qz44uycTxpQ",
  "Happens to the best of us",
  "guys I scratch on a free shot this isn't fair ",
  "Fr!!",
  "We’ve been humbled",
  "That’s really impressive 😂 makes me feel like shit 😂",
  "This child is better than me 😩",
  "https://www.tiktok.com/t/ZTR5GeX2t/",
  "Ok thanks",
  "We’re at Blackburn, feel free to stop by whenever until 5.  West side door is propped out",
  "When does the meeting today start",
  "Wya ",
  "I think all the doors are locked, some of us are standing here ",
  "I've been outside Scott for about half an hour, took me less time to walk and eat than I thought",
  "Anyone there yet?",
  "Remember to come in the side door to the rec room. They won’t let you in through the dorms.",
  "Ohhh ok, thank you for clarifying ",
  "These \"meetings\" are just people meeting up and playing pool. Nothing really to recap on!",
  "So I had something come up and I can’t make it to the meeting today, will there be a recap email or something like that?",
  "😆 We’re thinking Krispy Kreme. But if anyone has allergy-related suggestions, let me know!",
  "Dennis’ response to the attendance question will DEPEND on where the donuts are from ^",
  "Where are the donuts from?",
  "Also please fill out the poll so we know about how much food to get!",
  "Created new poll 'RSVP to first meeting'",
  "Hello everyone!  Our first meeting is this Sunday at Blackburn House at 3:00pm.  You can enter through the side entrance to the rec room (across from Scotts dining hall), the door will be propped open.  \n\nThere will be donuts for anyone who shows up, no experience required.  Look forward to seeing you all there!",
  "sounds good",
  "Ight I’ll meet you at the main door at 7 ",
  "sounds good. would need to be let in",
  "7? ",
  "what time u thinkin",
  "id be down",
  "Anyone wanna play later tn at Blackburn ? ",
  "At the side door ",
  "I’m pulling up ",
  "Good evening everyone,\nI would like to update you with the details of our first meeting, which was originally scheduled for tomorrow at 3pm in the Blackburn House… Due to it being a holiday weekend, and with students still settling in, the first official meeting will be moved to next Sunday, September 11. We will send out another message with further details.\n\nFor anyone who does not see this message in time or would still like to come by Blackburn tomorrow, regardless of the turnout, I will be there to shoot some pool. But, for our first official meeting, there will be donuts! Looking forward to seeing you all.",
  "Greetings, Billiards Club members! I hope you all had a great summer. Our first official meeting of the semester will be held on Sunday, September 4, at 3pm in the Blackburn Dorm House.\n\nPlease be aware that as guests using residence hall facilities, the residents of the building have first priority over the space and use of the pool tables. This has not been a problem in the past, as the Blackburn House rec room has three tables.\n\nTo our new members who have not attended a meeting before, we are a recreational club intended for anyone who enjoys playing or is interested in learning how to play pool. There are no fees to join, as we rely on the use of the university's pool equipment and that brought by members.\n\nAlso! I encourage everyone to stop by the OSU Student Involvement Fair this Sunday, the 28th. It's the best opportunity there is to find new student organizations. VP Sanjay Luckwitz and I will be manning the Billiards Club table in the \"special interests\" section.",
  "Hey guys we r gonna go to suzi cue on Thursday around 6pm-ish, everyone is welcome to join 😀 ",
  "There’s free pool at suzi cue those days",
  "I could also other days if those don't work",
  "Tmrw and Thursday after 6pm work for me",
  "I’d be down",
  "Yo, anyone around columbus down to play billiards sometime this week?",
  "haha dw I made friends",
  "Live’s",
  "If there’s someone that still love’s in any of the dorms, you can check them out with the name.#",
  "Oh dang, sorry about that. I’ve gotten them to cough up the balls just by saying I’m here for billiards club.",
  "Lol sounds good",
  "well I'll see if I can make a friend since I'm already here",
  "ohh snap",
  "Unless we can get someone that lives here to come, we might have to go to the RPAC because I can't check out balls without being a resident",
  "trent and i aren’t holding an official meeting today since finals are coming up this week.  the tables are leveled though, you guys can definitely go in and play!  someone will need to go in through the main door first",
  "That's where I'll be going.",
  "Blackburn today at 3pm?",
  "Lmk and I'll send the addy",
  "Anyone wants to come to my place and play some pool? I got some beer so you can prepare for the night if you'd like",
  "Apparently billiards plus is doing the refelting. This is parked outside of park-strad rn",
  "Does anyone want to play pool?",
  "Yeah, I'll still be here",
  "I got held on some stuff. Will you be free at 4?",
  "Rpac sounds good",
  "Oh I meant what building do you want to go to? I don't have access to Blackburn if you're going there. I'm at Lincoln Tower; I think the RPAC is the closest thing for both of us that has open tables",
  "I'm at 18th. Got to finish some stuff real quick. I can meet at 3:10?",
  "I can play for a little bit. Where do you want to meet up? I'll head out in a few, I want to finish up this math problem I'm doing real quick",
  "I missed the meeting yesterday.",
  "random but does anyone want to play a game or so?",
  "Awesome thanks ",
  "It depends what you want to watch.\n\nhttp://www.snooker.org/res/index.asp?template=2\nhttps://wpapool.com/calendar/action~month/exact_date~1654034400/request_format~json/\n\nThese are relatively small lists of upcoming tournaments. I know some competitions (like an ongoing Maryland 9-ball State Championship) is being livestreamed on YouTube. Outside of that, I'm not sure where you'd view it. Occasionally some of the major tournaments are aired on TV, maybe on BBC? ",
  "I also wanna know about upcoming ones that maybe I could find streams of",
  "Do any of you know where I can watch live pool tournaments? ",
  "Here's that masse/jump shot video I was talking about earlier. I like this one because it not only explains how to do them, but it also explains misconceptions that people have when doing masses and jumps\nhttps://youtu.be/hCSTMkQBitc",
  "Can someone let me in?",
  "Here, side door",
  "I'm here",
  "I’m on my way. They can let you in the main entrance if you knock",
  "Is anyone there yet? I'm outside if someone could let me in. Thanks",
  "I've been going to the RPAC. There's almost always a table open. If you do go, try to get the one close to the door if you can. The other table is missing nails in 3 pockets. It still works, but it's a little more annoying to play on",
  "Suzi Cue is 18+",
  "age *",
  "my friend is under ago",
  "The Library Bar also has a pool table",
  "The pool hall suzie cues allows students free entry on Tuesdays and Thursdays. There's usually a cover charge but on those days you just need your buck id ",
  "Does someone live in Blackburn can let us in.",
  "I don't live on campus so I guess I have to go to Arpc?",
  "Other than the dorms that have tables (Blackburn is the best), the RPAC has 2 tables that aren’t that bad.",
  "Is there a place to play pool on campus now?",
  "Pool at Blackburn, 3pm tomorrow. Come on down!",
  "Can someone let me in please",
  "I think I'm at the side door",
  "I'm at the side door",
  "I will be in a minute, just chilling at Scott's right now",
  "yep, i am",
  "Anyone here yet?",
  "Just a reminder, we’ll be at Blackburn at 3. If enough people show up, perhaps we can have a bit of an 8-ball tournament.",
  "Ahh yea, I can see how that would happen",
  "Lincoln table deserves the hole though; half the time you're doing a masse because the wall makes you hold the stick at a 50 degree angle or more. I can see how new players would put a tear in it",
  "😬😔 rip Lincoln table",
  "For the first semester I was playing on the miserable table in Lincoln; that table has a busted rail, a huge tear in the cloth, and every stick is broken",
  "Lmao, they re-felt the table at Jones too, they j hate y’all I guess ",
  "Wait, genuine question, how did someone get OSU to re-felt the tables at blackburn but the table in park strad doesn't even have a triangle or an 8 ball?",
  "Awesome! No problem 😉 ",
  "thank you",
  "Then I know where it is",
  "The door is where the pin is ",
  "One sec, I’ll send a picture",
  "It’s the side door that leads to the activity room, and we can let you in ",
  "I don't live on campus so I don't think I have access to dorms?",
  "where at Blackburn?",
  "😳🤩",
  "Hey everyone! They re-felted the tables at Blackburn :O\nLet’s meet this Sunday at 3pm and play some pool while they’re still pristine.",
  "I am",
  "Anyone there yet?",
  "Please come to the side door of Blackburn and send a message so we can let you in.",
  "I'll definitely come through if I'm in columbus by then",
  "Happy Friday! To anyone who needs a break from midterms, let’s meet at the Blackburn house this Sunday at 3pm for some pool and donuts.\nPlease like this message if you are interested.",
  "cool, we’re straight back on a quarter table",
  "I am here now",
  "I am on the way",
  "Hey, anyone else here?",
  "Yeah they have quarter tables and a change machine they also have 9 ft tables you can rent per hour and I think you can rent a 7 ft table per hour as well I’m not sure if the rate is per table or per person",
  "Yeah, it looks like they only have quarter tables. I’m guessing they have a change machine.",
  "Do u have to pay per game?",
  "Cushions Billiards and Lounge\n5986 Westerville Rd\nWesterville, OH 43081",
  "Good morning. We’ll be going to the pool hall at around 3. Hit me up if anyone else needs a ride.",
  "Created new poll 'Where do you want to meet?': https://s.groupme.com/auG1FG",
  "I would love to go but need a ride ",
  "Hey, everyone! I think it would be great to meet up this Sunday. It was suggested that we check out Cushions Billiards and Lounge, a pool hall out in Westerville. Since it’s a bit far, let’s take a poll to see who can make it or if anyone wants a ride there. If the majority would rather stay local, we will meet at Blackburn.",
  "I always visit Suzi Cues, it's a great place with good people",
  "Busses suck",
  "Same here",
  "I'll be a bit late, but I'll be there",
  "I’ll be there around then too",
  "Good morning. I’ll be at Suzi’s at 3. See y’all there!",
  "Sounds good to me too",
  "2-3 sounds good for me",
  "Start time",
  "Early afternoon sounds good. Like 2-3?",
  "I think I can make it",
  "As long as it's not too late, I'm fine with anytime",
  "Sweet, does anyone have a time preference? Early afternoon?",
  "I’d be down to go too",
  "I'm down to go",
  "Hey, would anyone like to go to Suzi Cue tomorrow? It’s an 18+ pool hall and bar. Haven’t decided what time yet.",
  "That being said however, you all are free to set up any informal gatherings, and just meet up with some peeps to play, and y’all are free to use this chat as a way to find anyone down to play!",
  "Hey guys sorry for the delay in updates, but OSU has advised all clubs to try and stay virtual for the month of January. So I’m order to comply, we’re gonna hold off on any official meetings for the next 2 weeks, in hopes that we can get back in February ",
  "So if anyone is interested in either being President, Vice President, or Treasurer of the club please don’t hesitate to reach out!",
  "Also on the topic of the future of this club, if anyone is interested in taking up a leadership position in the club please reach out to me. Kyle, Zach and I are planning on stepping down and would like to pass this club off to others so that it continues to live and thrive",
  "Hey everyone! Hope you had a wonderful break and first day of classes! I just wanted to let you guys know that since this is the first week of classes and everyone is still settling into campus, we’re gonna hold off on this weeks pool meeting, also in hopes that we get more guidance from OSU on if we’re allowed to keep in person meetings ",
  "Hey guys, just wanted to remind you all that we won’t be having a meeting today due to finals. Good luck with finals everyone and hope you all have a great break!",
  "Im at the front door I think?",
  "side door ",
  "At side door",
  "Can someone let me in?",
  "Is anyone there yet? If so I'm at the side door",
  "Hey guys! Let’s have our last meeting for the semester tomorrow before finals start. As usual, we’ll be at Blackburn at around 3",
  "Hey everyone! Hope you all are having a great break! Because of the break, we’re going to cancel our weekly meeting tomorrow. Let’s plan on meeting one more time next week tho before exams start!",
  "Could someone let me in please?",
  "can someone let me in?",
  "Hey will someone let me in",
  "Kk I just got here, so when u get here come toward the conkers room entrance (the door towards the north west side of the building)",
  "^ I’m about to leave my place to head over and finesse my way in, and then yea I’ll let people in through the side doors!",
  "Just out in the chat that you're at the side door and someone will let you in",
  "Usually I go through the side doors, the north set of doors facing Scott, you just need to ask someone else who is already in to open the door for you",
  "Hey guys! My name’s Alex and this will be my first meeting! I was wondering what Blackburn doors are we supposed to go through?",
  "Speaking of which, let’s plan on meeting this Sunday at Blackburn at around 3pm to play for a bit! If you are planning on coming like this message so we can get an estimate of how many ppl to expect",
  "Hey Mazin! Nice to meet ya! Excited to have you here and play some rounds together!",
  "Hi hi! Im Amani (Ah-Mon-EE), I try to show up but only end up making it some times, nice to meet ya!!",
  "Nice to meet you all!",
  "Wassup everyone, my name is Mazin. I played billiards a bit a few years ago, and i wanna see how rusty I am now 🤣🤣",
  "Hey everyone! Unfortunately I’m feeling a little under the weather today, and it is also currently snowing outside, so I feel like it’s probably best to cancel our weekly pool meeting today… let’s shoot for meeting up next week tho!",
  "Could someone let me in through the conkers room door",
  "Hey guys, like usual we are going to be playing today at Blackburn at 3! If you are free to come we would love to have you!",
  "But I do encourage you all to utilize this chat and potentially still a group together to play if you all are free!",
  "Hey everyone! Sorry for the super last minute notice, but it doesn’t look like anyone from exec can make it to play today, so we’re gonna go ahead and cancel any formal club meeting",
  "at side door can someone let me in",
  "At the side door",
  "Ye were here ",
  "anyone at blackburn now ?",
  "Hey everyone! So let’s shoot to play tomorrow at Blackburn at around 3",
  "Hey everyone! Sorry for the super last minute notice, but because of fall break we’re not gonna be meeting today. Hope you all are enjoying this last day of break and taking some time to mentally reset!",
  "can someone let me in?",
  "i’ll be there in 10",
  "At the side door",
  "hey can someone let me in the side door?",
  "Be there in 15",
  "Yeah I’m there",
  "Yea",
  "The conkers room door?",
  "Let us know when ur there",
  "If u go left around the main entrance you’ll see a pair of double doors",
  "That was a bad description",
  "It’s across from Scott’s entrance",
  "What door do you guys go to to get let in?",
  "Lemme in",
  "Ok I just got to Blackburn. Let me know once you guys get here so I can let y’all in",
  "Hey sorry for the delayed reply, but let’s try to play tomorrow at Blackburn at around 3pm. If you guys are free to come like this message!",
  "I would definitely go if I didn’t have a project and two midterms due Tuesday ",
  "hey guys, so apparently suzi cue (a billiards club and bar like 1 mile off campus) holds a 9 ball tournament every monday at 8pm.  they just haven’t held it for the last few weeks since there weren’t enough people.  if at least 4 of you guys want to go this monday, they will have enough people to do the tournament.  is anyone interested?",
  "Pull up ",
  "Yea",
  "is anyone there yet ",
  "Hey I’m here I’m by the door by the pool tables ",
  "be there in one sec!",
  "Okay, I'm chilling outside the side door, let me in whenever you get the chance",
  "i’m just arriving",
  "Anyone in yet?",
  "But trent will be there instead to make sure everything goes smoothly, so if you guys are still free, we are still playing today at 3 at Blackburn ",
  "Hey guys! Unfortunately I’m not feeling too good right now, so I won’t be able to make it today.",
  "So just to gauge interest, if you are free and plan to come play tomorrow, if you could like this message that would be lovely",
  "But if people are free tomorrow, we can also try to play at 3 at Blackburn",
  "Unfortunately I can play today :/",
  "I’ll play some pool tomorrow ",
  "Anyone wanna play pool rn?",
  "actually where are the pool tables  ",
  "where is the entrance ?",
  "In*",
  "Aight lemme I’m",
  "Ok",
  "Can you come to the side door?",
  "Do I come in from outside?",
  "Ye ",
  "Yeah, you need in?",
  "Where u guys at?",
  "anyone in the room?",
  "i’ll be there in like 10",
  "The side one right outside the pool room",
  "Which door are you at?",
  "I’m almost there",
  "3 tables in Blackburn",
  "I’ll be right there",
  "I need someone to let me in, if anyone is inside",
  "3",
  "how many pool tables are in blackburn?",
  "Anyone here?",
  "Awesome!",
  "Forgot to mention that I brought a few extra cues and a set of balls from home, so no need to worry about passing one cue around!",
  "Hey everyone, I’m on the way to Blackburn with some donuts. Hope to see y’all there!",
  "Hey guys! So we’re gonna try and play some pool tomorrow at Blackburn at 3pm! I unfortunately won’t be able to make it, but Trent will be there to organize everything. So if you guys are free and want to play feel free to stop by!",
  "I'm here",
  "K for whoever that is coming today, and needs to be let in, msg me or just like tap on the glass outside and we can let you in through the conkers room",
  "Ok thanks for voting! So let’s try and meet up at Blackburn around 3pm! No worries if y’all have to show up late or anythin tho! ",
  "If you could vote in that poll for what start time(s) works for you that would be great!",
  "Let’s figure that out actually lol. ",
  "Created new poll 'What time works best for you for this Sunday?': https://s.groupme.com/2ZFTWv",
  "What time is the meeting?",
  "Hey everyone! So we want to try and play this Sunday. To gauge interest, like this message if you’re interested in coming",
  "Go to the entrance room. I'll be upstairs holding a cue",
  "I have no idea where the pool room is",
  "And getting the pool stuff. Just meet me in the pool room downstairs",
  "I'm here",
  "Sick. I'll be there",
  "Sure",
  "Can you be at the rpac in like 10 minutes?",
  "I'm on south but I'll go anywhere",
  "Where at?",
  "Anyone free for a few games rn?",
  "Is there a door to outside?",
  "We’re already in the blackburn pool room",
  "Where u guys at",
  "Aight",
  "Lmao you're good",
  "I’m walking harder than I’ve ever walked before",
  "I'm in the waiting area as soon as you walk in. I'll wait for Kyle",
  "Yeah, just ask the people at the front desk to let you into the pool room",
  "I actually haven’t been there yet, but from what I’ve heard there’s a pool room that we’ll have to tailgate our way into somehow",
  "I’m running a little late, sorry about that",
  "I'm in the blackburn lobby. Where do I go from here?",
  "Gotcha ",
  "Blackburn, hopefully, but if that doesn’t work we can try and relocate to Scott ",
  "Where is the meeting at?",
  "I unfortunately can’t go today, but our beloved Kyle will be there to set everything up!",
  "Hey just wanted to remind everyone that we’ll be playing pool at Blackburn today at 3pm! If you are free and want to play we would love to have y’all!",
  "Let’s for now say around 3pm like last time. But lmk if that doesn’t work and we can find a better time!",
  "Ok so this is pretty last minute, but since no one seems down to play Saturday, we’re gonna reschedule for Sunday!",
  "Also just to compare, like this message if you would rather play on Sunday",
  "So if everyone who is still down to play on saturday (probably around 5) could like this message that would be great! And if y’all would rather play on a different day we can figure that out",
  "Hey guys! So I saw that most people voted to play on Saturday… just wanted to make sure that that day actually does work for everyone (because Saturdays are when the football games are)",
  ".... it doesn’t work for me, but my group me was glitching out so I couldn’t Vote 😭 😭 ",
  "Hey guys! So I saw that most people voted to play on Saturday… just wanted to make sure that that day actually does work for everyone (because Saturdays are when the football games are)",
  "Anyone wanna play now?",
  "This message has been deleted",
  "Sorry, I have a class in 10 minutes",
  "Anyone want to play rn?",
  "Vote keeping in mind that the weekday timing will most likely be in the afternoon/evening, and the weekend timings will most likely be morning/afternoon. We can vote on the times once we settle on a day",
  "Created new poll 'What days work for our weekly meetings': https://s.groupme.com/cI54Ai7",
  "And as to our weekly meetings, to figure out what days work best ima put a pill in the chat so if u guys could vote that’ll be helpful",
  "But I love the fact y’all are trying to play! I encourage y’all to keep asking and seeing who’s free to play",
  "It's all good",
  "^ unfortunately same here :/",
  "I would but school is destroying me",
  "The age-old billiards club dillema. \n\nNo one ever plans to play pool. They just do. Right now.",
  "Lol yeah except different outcome cuz I can't :( ",
  "Literally the same conversation Dorothy and I had yesterday",
  "Like rn",
  "When? ",
  "Anyone want to play pool?",
  "Could you open the door for me? ",
  "Walking to Torres rn ",
  "Yoo that's so cool",
  "Honestly pull up. It's like a candy and cultures event",
  "That'd*",
  "Torres has candy tasting events? I'm officially jealous",
  "That's be sick",
  "Hmm might be able to swing by for 15 min? Got a study sess at 3 lol",
  "Like rn. Tonight at Torres might be busy since there's a candy tasting event going on at 7",
  "When? Tonight? ",
  "I'm in Torres house",
  "Anyone wanna play?",
  "Created new poll 'How often do you want to have a meeting': https://s.groupme.com/NOfSR",
  "And as for future meet ups, I wanted to get your guys’ input on how often you guys are down to do something similar and play some pool. So if you guys could vote in this poll if you’re interested in continuing to have recurring meetings to play, that would be great!",
  "Hey guys, just wanted to thank everybody for coming out yesterday, it was great being able to meet everyone and play some pool!",
  "Probably a couple hours @Sophia Vargo ",
  "Be there in 5-10",
  "How long will you guys be there ",
  "I'll be there soon too. I'll stand outside the side door",
  "^^",
  "Will someone come open the door for me plez??",
  "Can someone come open the door for me",
  "I’m a dorm resident ",
  "Hey just a reminder that we’ll be playing at Blackburn today at 3!\nAlso just a general question: is anyone who’s planning on coming today also a dorm resident?",
  "We’ll have some snacks there for y’all as well. And if you can’t swipe in when you’re there and need someone to let you in feel free to drop a msg in this chat or dm me!",
  "*3pm tomorrow ",
  "Ok thank you everyone for voting! So let’s plan on meeting at blackburn at 3pm! ",
  "Hey everyone! So for whoever would be down to meet up for some pool and snacks later this week (meeting location most likely in Blackburn), please vote in that poll for whichever times work for you!",
  "Created new poll 'What day / time best works for you?': https://groupme.com/polls/57312068/163047286069566027/8fNN92",
  "Jones has all the pool balls ",
  "if needed i could bring balls",
  "I'd definitely prefer Blackburn over rpac since it's a shorter walk lol ",
  "Blackburn goated",
  "Ye most of the dorms’ tables kind of suck. We were thinking about playing in Blackburn though, because they got 3 tables and I think they’re fairly good (compared to the other dorms at least)",
  "I think we can potentially reserve them… someone can correct me if I’m wrong but the problem with the rpac is that I don’t think they’re renting our equipment still :/",
  "The RPAC tables are nice from what I remember. Is it possible to reserve them?",
  "When I played we used the second 5 ball, it had a bunch of chalk on it. And the table does suck",
  "Also the table is garbage",
  "When I lived there almost 2 years ago we used a 2nd cue ball as the 8",
  "Lol they're still missing the 8 ball?",
  "Mine does (park-stad) but we are missing a triangle, an 8 ball, and none of the cues have felt on then, so it's not ideal",
  "Most dorms should have pool tables",
  "The rpac has pool tables ",
  "Which dorms have pool tables?",
  "So firstly to gauge interest, like this message if you would be down to meet up at one of the dorms sometime next week for some snacks and to play pool or just hang out!",
  "Hey everyone! Now with dorms allowing people to rent equipment again, we figured that it would be nice to start some pool club meetings!",
  "^",
  "jokes on you I'm bad",
  "Hey everyone! I had a guy reach out to me about him being in an APA league and his team needing a couple more players. If anyone is interested reach out to me and I can connect you guys",
  "I’m good for Saturday",
  "Yea they got free tables on Tuesdays and thursdays I think!",
  "Do they still do the weekday (I think it was Tuesday?) Free pool for students?",
  "I’m unfortunately busy Saturday night, but I’d be down Friday night or Saturday afternoon",
  "I'll be home this weekend :/ maybe another weekend though",
  "yo what’s yalls saturday night looking like? anyone tryna play some pool at suzi cues?",
  "The Torres house table",
  "Where did you guys play?",
  "Billiards club is still attracting new members. Don’t lose faith!",
  "Hey so Trent and I were playing for a bit either tomorrow or Friday evening and we were wondering if anyone wanted to join!",
  "Yo I’d be so down to play",
  "What’s up, everyone? I’ve been going to Suzi Cue’s pretty frequently. Hit me up if you’re tryina play sometime.",
  "There was a previous pool club a few years back and they were able to get Suzy-cues to give them a free table once a week for an hour ",
  "That would be amazing!",
  "Hell even sponsor us imagine that ",
  "Maybe they can do special arrangements for the club ",
  "Could email them about their business policies this year",
  "Yeah! we were talking about it before corona",
  "It’s called Susie-Cue ",
  "I’m pretty sure there’s a pool hall near campus that’s free for students? Idk if they’ll be open or not but I think it’s separate from the university ",
  "Intern* for free",
  "Or better yet just hire some engineering students to build it for us ",
  "Let’s do it!",
  "We'll build our own tables",
  "Smh",
  "Definitely. Sounds like i want my activity fee refunded",
  "They said they’re not allowing any physical activity (like basketball) and they’re not allowing their amenities... which might include the pool tables?",
  "Interesting",
  "Not to it’s normal extent... they’re basically only doing lifting",
  "Yeah.. will the RPAC even exist",
  "We should have our normal budget... if not ima rage lel",
  "Think theyll give us a budget or are they gonna hold onto all the money they can lol",
  "Yea and if that’s the case, we can easily just buy the stuff we need to play",
  "^",
  "I bet theyll just not loan equipment bc I feel like it would be very expensive and impractical to actually get rid of the pool tables for a year",
  "We can hope ig",
  "I mean maybe...? Just cause we’re a small club with not many ppl",
  "Think theyll allow club meetings at all?",
  "Ima email the rpac and see if we can like reserve a table since we’re a club",
  "Yea :/",
  "No loaning equipment? OSU is a big baby",
  "I want a refund",
  "Just an fyi for all... theres a chance dorms don’t get pool tables this year 😢",
  "For those of you who are really desperate :P",
  "https://www.youtube.com/watch?v=fJ8i2HiKsGw&feature=share",
  "But still I know a lot of us will still be in the Columbus area, don’t be afraid to reach out and ask if anyone would like to hit!",
  "Also btw I know I’ve talked to a few of you guys bout wanting to get weekly times to play together, but with the whole corona outbreak that’s obviously gonna be kind of hard to do",
  "Also everyone this is Vladimir! Another fellow pool enthusiast 😅",
  ":O those tables look hype",
  "Suzi Cue’s is the place to be https://v.groupme.com/57312068/2020-03-13T02:06:32Z/3d6862ea.272x480r.mp4",
  "Yea that hits a little too close to home 😅",
  "that must be embarrassing",
  "😂 ",
  "https://www.instagram.com/p/B9bzou3FXuw/?igshid=1exdbw0ac4k0",
  "Ima be playin in Patterson for a bit if anyone wants to join",
  "didn’t even think about that. went with the fam and they got the balls🤦🏻‍♂️",
  "U get a free table?",
  "Damnnn",
  "was just at Suzi Cue. cool place.",
  "Yeeee we play in hard mode",
  "adds character to the gameplay",
  "Some tears in the the table, balls are aight (except for a puncture in the cue ball)",
  "Uh they’re not great... but like it’s good enough for OSU standards",
  "How is the table/balls?",
  "Well I do have my own",
  "the cues are trash unfortunately",
  "Park strad is useless",
  "Jw is the pool stuff at Paterson good?",
  "i’m at the pool table on paterson if anyone tryina clack some balls",
  "I was telling my brother that tequilas videos are amazing",
  "Lol I’ve watched so many tequila videos on o Sullivan ",
  "I would if ppl are free to go to the rpac and play with you guys during the weekend",
  "Yea that’s totally fair",
  "Sorry lol",
  "I'd be more willing to play if I didnt have a stupid exam Thursday",
  "Also I’m bored so ima be in Patterson playing if anyone wants to join",
  "Fantastic safety player",
  "Mark selby is knows as one of the best at those",
  "Dang. Yea even though making the shots looks cleaner... playing good defensive shots is much harder to do",
  "https://m.youtube.com/watch?v=eVuiiAl17vQ\n\nhttps://m.youtube.com/watch?v=Pgu_1gpujBQ\n\nEveryone loves some good pots but never forget about this stuff too!!",
  "Hey so I know some people have been a bit busy today, does anyone want to play at the rpac today?",
  "Also @Jason Vindvamara Sullivan is insane! (Most snooker players are insane in general lol)",
  "Trent ikr that whole runout was insane",
  "Ishan, that first shot after the break blew my mind",
  "https://m.youtube.com/watch?v=lhegpigXlCU\n\nhttps://m.youtube.com/watch?v=Whe7FND2Qgw\n\nThe one and only... the true GOAT",
  "That's a good video!",
  "https://www.youtube.com/watch?v=vKD7EdzMjAM&feature=share",
  "But... have you guys seen Chris Melling’s 8 ball run out",
  "God those guys are insane",
  "https://youtu.be/Gtnmfb9Dnkg\nThese guys were some badass pool hustlers.",
  "Don’t forget to vote in the poll plz :)",
  "(Also ima be playin in Patterson for a bit if anyone wants to join)",
  "Created new poll 'Preferred starting time?': https://s.groupme.com/2RT6xNB",
  "So it seems like Saturday is the general consensus, please vote in this poll so we get an idea of what times work out for peeps",
  "Yo does anybody want to play ",
  "Um from most of the people I’ve talked to the weekends just seem to work better so I didn’t put any weekdays as an option, if you rlly really really would prefer that instead lmk",
  "Created new poll 'Day to play?': https://s.groupme.com/4R6859s",
  "Hey so we would like to start having more structured times for us to meet at the rpac (in addition to the other times we play whenever we feel like)\nI feel like I have a time range in mind that works for everyone, but I’m just gonna make some general polls.\nPlease vote according to your guys’ preference :)",
  "U guys still playing?",
  "well me and Ishan are playin",
  "Mine is harder",
  "But",
  "Ok",
  "😓",
  "I have the exact same midterm as you",
  "I would play",
  "If I didn’t have a midterm tmrw",
  "I could hop over, i'll be home around 930",
  "I can play for a bit",
  "anyone wanna play in paterson?",
  "Ill be there in a bit",
  "K ima head down to Patterson rn",
  "I'll be there for a bit too",
  "The more the merrier",
  "I don't mind at all",
  "If u guys don’t mind",
  "That is",
  "I’ll probably play a bit",
  "^",
  "Probably Paterson",
  "Where u guys playing?",
  ":D let’s play ",
  "I should be free around 5:30",
  "Also if anyone else does want to play today hmu",
  "(That goes for everyone here)",
  "Aw that sucks :/\nIf your schedule does free up or you wanna play next week feel free to hmu or anyone else in this chat",
  "I would love to but I'm booked up for the week 😭",
  "Hey all! I was wondering if anyone wanted to play a few games around 5:30ish?",
  "The actual event starts at 7. I’m gonna be there at 6:30 to meet dr. Kilcup and plays a few racks with him if anyone wants to join me for that feel free",
  "Just a reminder this is today. If you guys can make it y’all totally should!",
  "Honestly as (vp) i could look into that for us",
  "I.e make the IBleagues intramural tournament real",
  "We should all also be on the lookout for possible tourneys that we all might be able to go to together",
  "Yea for sure!",
  "^^^",
  "Free good pool table would be good for smaller group tho",
  "true. an occasional get together at a pool hall could be fun tho",
  "^^",
  "I personally feel like it would be better tho to stay on campus and possibly try expanding pool there",
  "Also the last pool club that existed got Suzy Cues to give them a free table once a week... so if we want to go down that route that is also a possibility",
  "@trent I haven’t personally been there but I know a few people that have played there and they say it’s good",
  "I’m down",
  "Also how many of you guys will be actually be willing to attend Dr. Kilcup’s pool physics clinic if it’s held at Patterson...?",
  "anyone been here?",
  "Zach did have a nice idea where if we do have too many people for 2 tables and we haven’t gotten more table for the rpac we could just split up and have little divisions in different dorms",
  "Thats the president we need",
  "I agree I would like to see the club grow",
  "The scratchers lol",
  "PB club",
  "Also if anyone has any good names for the club feel free to suggest",
  "Nah prob not. I just named this chat that cause that’s technically the name of the club atm. Once we change the name of the club we can just change the groupme name",
  "But like I think it’ll be cool if we go. It’ll also be a way to get relations with him better",
  "Btw are we gonna keep the name pocket billiards club?",
  "(Lol ik that sounds kinda extra)",
  "And btw I’ve been talking a bit with Dr. Kilcup (he’s prob gonna be the advisor for our club) and he said that he would like to have a little physics demonstration showing us the physics of pool",
  "What’s good prez",
  "Ofc feel free to add anyone to the groupme who wants to join ",
  "Yo yo so here is the beginning of the pool club. Since the club isn’t technically a thing yet we can just use this chat as an informal way to just see if anyone wants to play for now"
]