[
  "Looking to sell my Kendrick Lamar and SZA tickets for cheap , I have gotten a couple as a gift but unfortunately i can’t make the date for May 5, Lincoln Financial Field• Philadelphia , PA. Anyone interested should text me please…..8623842594\n",
  "Giving away my Kendrick Lamar and Sza tickets for free, lmk if anyone is interested in it. 9363803622",
  "Found it ",
  "Thank you but where’s that ",
  "The timashev has a ton of private practice rooms on the second and third floors",
  " Any room on campus I can go and play some piano ?",
  "  Selling 2 Michigan tickets text me on (346)632-7971 if interested",
  "Selling 2 Iowa tickets",
  " Selling 2 Michigan tickets text me on (862)365-8142 if interested",
  "Selling my Sabrina Carpenter tickets for September 23rd, concert venue @ Nationwide Arena - Columbus, Ohio.",
  "Selling 2 Michigan tickets 38A text me on (862)365-8142 if interested",
  "Selling 2 Michigan tickets 38A text me on (862)365-8142 if interested",
  " Hi! Everyone, I’m selling four Michigan tickets (Includes Tickets for the remaining Home Games).\nText me on +1 (406)-206 7541",
  "Selling my  MICHIGAN tickets, text me if you’re interested please ",
  "selling western Michigan tickets Dm if you’re interested ",
  "Selling my season tickets, lmk if anyone is interested in it. I’m down to sell them separately too.8482249281",
  "Selling my  MICHIGAN tickets, text me if you’re interested please ",
  "I’m selling my michigan ticket dm if you want it",
  "Selling Western Michigan Ticket (38A), DM if interested ",
  "I’m giving away my Football season tickets \nAnyone interested should text me on (406) 206-7541.",
  "Selling Michigan ticket dm if interested ",
  "Selling my Big10 package  Including Michigan ticket",
  "This message was deleted",
  "Selling my Michigan tickets message if you’re interested +1 352-658-6063",
  "Selling two Michigan tickets dm if interested or text me on (862)365-8142",
  "I am trying to sell my Michigan and Akron tickets \nDm if interested \n8604920113",
  "Hi! Everyone, I’m giving away my Football Tickets - Season Package (Includes Tickets for all Home Games).\nText me on (657) 535-8314",
  "Selling my full season football pass message me if interested +1 352-658-6063",
  "nope first meeting is september 3rd at 6:30",
  "Is there a meeting this week?",
  "Selling season ticket for cheap can also sell individually dm or text me on (862)365-8142 if interested",
  "Selling my football season tickets and also selling them individually hmu if you’re interested +17652229415",
  "Am trying to sell my full season ticket and I can sell individual also \nDm if interested 334-247-3238",
  "Selling my Big10 package  Including Michigan ticket",
  "brennan still selling his big. 10. package. if anyone is interested ",
  "Selling my Big10 package  Including Michigan ticket",
  "Trying to sell my Michigan and Oregon tickets anyone interested should text me on 4782603559",
  "If y'all aren't already try snapchat for selling tickets, like on the class of 2028-2025 stories maybe",
  "Selling my Big10 package  Including Michigan ticket",
  "Selling my football season ticket!\n530-523-0194",
  "Anyone interested in buying my Michigan tickets should text me please (281) 984-9935",
  "Selling my Big10 tickets ",
  "Trying to sell my tickets to all home games this season 4782603559",
  "Selling my Big10 tickets ",
  "selling my full season football tickets Reserved! DM me if interested!",
  "Selling my 3 Sabrina Carpenter tickets, lmk if anyone is interested in them. I’m down to sell them separately too. 6782735697",
  "Anyone interested in buying my Michigan tickets should text me please (281) 984-9935",
  "Hi! Everyone, I’m giving away my Football Tickets - Season Package (Includes Tickets for all Home Games).\nText me on (657) 535-8314",
  "Giving away my season tickets, lmk if anyone is interested in it. 6782735697",
  "Anyone interested in buying my Michigan tickets should text me please (281) 984-9935",
  "Please join the new group me for the 2024-2025 school year!",
  "https://groupme.com/join_group/102439557/pMvIIOKD\n\nPlease join the new group me for piano club 2024-2025 school year!! ",
  "Selling my season Tickets dm if you’re interested 9088789850",
  " Selling full season reserved ticket",
  "Anyone interested in buying my Michigan tickets should text me please (281) 984-9935",
  "Selling season ticket for cheap can also sell individually dm or text me on (862)365-8142 if interested",
  "Anyone interested in buying my Michigan tickets should text me please,(281) 984-9935",
  "Looking to sell my full season tickets. \nText me if you’re interested (281) 984-9935",
  "i go to ones on the 4th floor",
  "Gotcha, thanks :)",
  "if you reserve them you get up to 3 hours in the room just looks up osu practice rooms, don’t need to be a music major",
  "I've never had an issue as a non music major, any empty room in timashev is fine just leave if a music major needs it",
  "They may be reserved but the dorms have pianos in them so you can practice outside of this club",
  "Hey y'all! I'm an incoming freshman, and I want to practice piano between classes. Can I just go in and practice in the Timashev Building, or are those reserved for music majors?",
  "for me i went on musescore and looked up compositions of popular pop songs that i already knew the basic melody to and played through them. bc that way you vaguely know the overall melody but still have to pick up on the various adaptations the composer added to the music when translating it from the original song to a piece to be played on the piano. idk makes it made the process of sightreading a lot more fun bc youre playing songs you know and like but for me it really helped speed up the overall process of learning how to sightread",
  "like don’t just stick to the same piece because you’re pretty much just relying on visual cues and memory",
  "honestly just start learning a lot of songs at once and play them straight through. that’s what i had to do for my hs choir and it got me really good",
  "anyone have any advice on getting better at sight reading? ",
  "Cool cool \nI'm an incoming international student and I've been playing the piano for quite a few years now so I just wanted to connect with new peeps ",
  "But if you have any piano related questions, I’m sure at least some people will respond",
  "I think mainly just during the school year",
  "But like in general ? ",
  "Not at this hour",
  "Is this group/club still active ? ",
  "Looking to sell my full season BOS tickets for cheap. Text me if you’re interested please ",
  "Anyone interested in buying my full season tickets should dm please ",
  "I want to give out my MacBook Air 2020 for free, it's in perfect health and good condition, along side a charger so it's perfect, I want to give it because I just got a new model MacBook Air 2022 and I thought of giving out the old one to someone who can't afford one, Text if you need it \n(217) 376-8345",
  "Hey guys i have gotten Chelsea vs Manchester city  tickets for sale, venue at Ohio Stadium, for Aug 3rd. Text me if you’re interested please (818) 208-2762",
  "Anyone interested in getting Taylor Swift tickets for cheap should text me please, i have gotten a couple as a gift but unfortunately i can’t make the date (Nov 2nd). Concert venue @ Lucas Oil Stadium. Indianapolis, IN. (818) 208-2762",
  "Selling grad tickets dm if you’re interested ",
  "Hi guys! I don’t know if maybe posting this here is inappropriate 🥲 But pls 🙏 I’m looking to sell 3 of my Olivia Rodrigo tickets at Rupp Arena,Lexington KY on wed• 24 July @ 7:30pm and 2 of my Taylor swift tickets. Anyone interested  in purchasing them should text me +1 920 345 6096. The tickets are together in a great section and a nice view of the stage",
  "Due to the weather tonight’s meeting will just be cancelled, I will see about having one next week",
  "Tonight’s meeting will be shifted to start at 7:30 due to scheduling conflicts. See you there!",
  "Trying to sell Nicki Minaj concert tickets for tonight’s show. I got mixed up with schedules so we won’t be able to make it to the concert anymore. Hit me up if you are interested.\n(910) 801-8660",
  "ok thanks",
  "Unfortunately there was an event scheduled for tonight so next meeting will be next week",
  "is there a meeting today?",
  "Hello everyone! Putting this here might seem to be unsuitable to all and sundry but,I've a couple of Nicky Minaj tickets that I'm putting up for sale,at Value City Arena - Schottenstein Center, Columbus,OH, USA on Apr 12 • Fri • 8:00PM • 2024 the tickets are certain and credible. The ticket are together in a great section and a nice view of the stage if you’re interested in purchasing them kindly send me a text on here +1 574-347-3319",
  " Selling 2 extra driver era tickets ",
  "Due to some unexpected complications tonight’s meeting will have to be cancelled, it will be pushed to next week. Apologies for the inconvenience",
  "This message was deleted",
  "Nope next week",
  "Hey guys, is there a meeting tonight?",
  "I have three Olivia Rodrigo tickets for tonight’s show in Columbus. Text me if you want to purchase them because I won't be able to make it to the show",
  "Also the pianist is super SUPER good!!!",
  "Tonight! If you are interested please come!!! Let music bright your night!✨✨",
  "Selling Olivia Rodrigo tickets at affordable price ",
  "Hi! I’m looking to sell my tickets to Olivia Rodrigo concert, \nText me if you’re interested +1 409-232-3083",
  "We’re starting in about 30 ish minutes, reminder to come to high street entrance!",
  "Hello \nI have 3 Olivia Rodrigo tickets for United center, Chicago Illinois, date Tue March 19 and 2 Taylor Swift tickets, anyone interested in them should kindly text me on ‪(510) 831-3924",
  "Reminder that we have our meeting tonight at 7! See you there!",
  "Selling my 3 Olivia Rodrigo tickets, lmk if anyone is interested in it. I’m down to sell them separately too. 2097991379",
  "Also, my piano accompanist is awesome!!!!",
  "Hello everyone! My voice recital will be on March 22nd, Friday, at 7:00pm at Timashev Recital Hall! It’s the Friday after spring break. If you like classical music and free on that time, please come and join! It will be around 35 minutes! Thank you!!!!",
  "I might but i need more info. Date, time, songs, etc?",
  "Hello all!\nI play violin and I want to perform 10 minutes east-style music 2 weeks later. Is thrre anyone who want to play piano with me? I do not know is there any other group that I can ask if anybody can join me?",
  "yes",
  "will the club meet again after spring break?",
  "I had to leave for work but everyone played great! ",
  "can someone let us in please ",
  "We’ll start around 7:10 to give time for everyone to get here, reminder to come to the high street entrance so I can let you in. See you there!",
  "It will be in the collaboratory. There will be signs pointing to it and I will have to let people in the building since it locks at 6",
  "Which room will tonight's meeting be in?",
  "I have heard back from the people at sullivant. The piano should be unlocked so, assuming they followed through, we are able to have our meeting tonight at 7.",
  "I saw this in the SOM!",
  "An admin deleted this message",
  "An admin deleted this message",
  "Sorry I didn’t see this, but yes that’d be great if possible!",
  "i play under a professor at the SOM do you think it’s worth it to ask for help on getting meetings in timashev?",
  "ah I see. that's really frustrating but I hope next week you'll be able to get that room you scheduled",
  "Since the club is not technically associated with the college of music, they make it pretty much impossible to reserve there consistently",
  "Is it not possible to book a classroom at Timashev? I've had other club meetings there, or at least the classrooms are open to use",
  "Ugh ig thats the end of me coming to meetings then. Im booked that day",
  "Yes as that is the only day they’d agree upon for reservations",
  "Is the standard meeting time always on wednesdays now?",
  "Unfortunately, due to the negligence of OSU once again, tonight’s meeting will have to be cancelled as they did not unlock the piano and there is nobody with a key on campus. I apologize once again for the inconveniences and will try to shift it to next week.",
  "An admin deleted this message",
  "Reminder that our first meeting is tonight at 7! Enter Sullivant hall through the doors on high street and signs will point towards the room. Hope to see you there!",
  "An admin deleted this message",
  "they’ve been kicked before but just rejoin i think they back people’s accounts",
  "We have to start somewhere",
  "There’s so many",
  "but maybe we could ban the bots??",
  "I enjoyed the pun😂",
  "nah jk",
  "the only fair is laissez-faire!!",
  "Is anyone in favor of ticket selling here 😂?",
  "we already banned it they’re just bots",
  "Could we potentially do a vote on whether we should ban ticket selling in this groupme?",
  " Selling 4 Drake last min tickets for tonight’s show! Dm",
  " I have got 3 drake tickets for sale, dm me!!",
  " I have got 3 drake tickets for sale, dm me!!",
  " I have got 3 drake tickets for sale, dm me!!",
  " Selling 4 Drake last min tickets for tonight’s show! Dm",
  "Selling 3 Drake tickets for Feb 21!!",
  "I’m selling 3 Drake tickets for the show in Columbus, OH, Dm me if interested in buying ",
  "I’m looking to sell 3 Drake tickets for the show here Columbus, OH, my cousins and I can’t go to the show anymore. Reach out to me on 7632441125",
  "After a long time of no response I was finally able to reserve the collaboratory in Sullivant Hall! The first meeting will be next Wednesday the 21st from 7-8:30 pm! Thank you all again for your patience and I hope to see you there!",
  "This message was removed",
  "I’m selling my 2 Taylor swift tickets\nText me  if you’re interested in buying them\n(‪304) 405-4602‬\n",
  "Selling my 3 Olivia Rodrigo tickets, lmk if anyone is interested in it. I’m down to sell them separately too. 5012467961",
  "What do you need help with?",
  "you can use any room with a piano in it if it’s open! you can also reserve them for an hour or two on the website ",
  "I have its pretty easy ",
  "Hey there, I’m new here I don’t know anything about paino, can someone help me?",
  "have any non music majors here used the osu piano practice rooms? It says online you can if they're available but I'm not sure",
  "Selling parking pass hmu if interested",
  "This message was removed",
  "This message was removed",
  "Indeed",
  "good to know! i thought it was a great performance😊",
  "Yes! Thank you 😄",
  "sorry i didn’t see this! were you able to make it in?",
  "Or are the doors only open at 5",
  "Can we enter before 5pm?",
  "nope, it’s completely free!!",
  "@Emily McNicol do we need to buy tickets for the recital? ",
  "I’ll see if I can make it after class",
  "Nice thanks for letting us know",
  "playing schumann and debussy!",
  "https://music.osu.edu/events/program/christopher-harding-piano-020624",
  "yes",
  "pretty sure yeah let me check",
  "Is the recital at Timashev too?",
  "he is also performing a recital at 5pm which would be really nice and both are open to the public! i will be there and so will my professor ",
  "Anyone going to this event?",
  "hey guys! i know this is super last minute but i was just informed of a piano masterclass tomorrow from 1:30-3:00. the professor coming is the professor of music at the university of michigan christopher harding. some students getting masters and bachelor’s degrees in piano performance are also playing there and are playing beethoven and brahms among others. here is the link: https://music.osu.edu/events/guest-master-class-christopher-harding ",
  "This message was removed",
  "This message was removed",
  "I have contacted the building for reservations and am currently waiting for a response, thank you all for your patience!",
  "Do we have a day and time set yet?",
  "This message was removed",
  "This message was removed",
  "This message was removed",
  "Did you click the link below?",
  "For me it keeps saying site cant be reached",
  "http://whenisgood.net/nfpyipk\n\nHopefully this should make things a bit easier, ignore the dates and just select the times that would work best for each day, thanks!",
  "I did not know about that, thank you!",
  "U guys should try whenisgood.net",
  "Yeah that’s a slight issue, this first poll is more of a general idea what days people are leaning towards",
  "Well 5 works on different days than 8 does.....",
  "Id say aiming for later afternoon, at least 5pm or later",
  "What time are we talking for the poll?",
  "Created new poll 'What day would meetings work best?'",
  "awesome!",
  "that sounds incredible! i’ll be there😎",
  "Can drake play the piano ",
  "This message was removed",
  "Nope!",
  "Do you have a be a pro pianist to join this group? ",
  "This message was removed",
  "also completely free ^^",
  "Created new poll 'would you be interested in going?'",
  "hey guys! i was thinking this might be something fun to go to instead of the normal meeting. its on a monday 7-9:30. it’s a performance by a piano professor and he’s playing tons of classics that everyone knows by schubert debussy liszt (liebestraume?? 😳)and others sounds like tons of romantic music. he’s also playing a mediterranean music inspired piece i bet it’s really nice! i’ve been to shows in timashev they’re always great. is this something everyone would be interested in going to?",
  "This message was removed",
  "Hi everyone I’m looking to sell Tickets to Olivia Rodrigo\n\n@Nationwide Arena, Columbus, OH\n\nMarch • Fri •22 • 2024\n\nSelling each for a good&fair price (negotiable)\n\nPlease Lmk if interested🌹\n+1 302-408-5157\n",
  "I’m selling 3 Drake tickets, text me at 7632441125 for more details!!",
  "This message was removed",
  " I’m looking to sell 3 Bad Bunny tickets, Dm or text me at 7632441125",
  "This message was removed",
  "DM me if you need to be let in!",
  "For anyone new, the meeting is at the Collaboratory space in Sullivant Hall. Go to the N High Street and I’ll be there to let you in!",
  "Hey guys! Don’t forget we have our last meeting of the semester tomorrow 6:30-8!!\n\nAnd if you haven’t joined the new GroupMe, don’t forget to!!",
  "Due to lower than expected turnout, we are wanting to see any issues that may lie in our meetings. I encourage everyone to please fill out this survey so that we can make meetings as enjoyable as possible for everyone. Thank you.\nhttps://forms.gle/rmDzARKLDG3wYbvS7",
  "You're invited to my new group 'Piano Club @ OSU 23-24' on GroupMe. Click here to join: https://groupme.com/join_group/97809723/zo0MABKj",
  "To help us to sort between active members on this GroupMe I will be creating a new GroupMe for 23-24. Messages will eventually only be sent in that chat so please join if you plan to come to any meetings. Thank you!",
  "Dm me if you need help getting in!",
  "Piano club tonight at 6:30!!! ",
  "Selling 2 Minnesota tickets!!",
  "Selling my MSU and Michigan tickets. Text me at 9095034640. Thanks!",
  "Selling my Missouri and ole miss tickets at affordable price ",
  "An admin deleted this message",
  "Reminder that we are looking for a new treasurer! It’s a low commitment and requires no previous experience or knowledge of treasurer/money stuff. It is REQUIRED for us to stay as an active club that we have a treasurer in place asap. Please reach out to me if you have any questions about being treasurer or if you’re just too lazy to do the application but are interested. ",
  "Hey everyone! Piano club is cancelled tonight. Enjoy your Halloween! Send us pics of your costumes!!",
  "An admin deleted this message",
  "This message was removed",
  "An admin deleted this message",
  "An admin deleted this message",
  "An admin deleted this message",
  "An admin deleted this message",
  "Reminder to fill out officer applications if interested! A treasurer is needed to complete the training so we can stay active. It is an easy position that is good for resumes and money experience is not needed!",
  "An admin deleted this message",
  "hey guys this isn’t me, it’s a hacker so don’t get tickets from them",
  "This message was deleted",
  "An admin deleted this message",
  "An admin deleted this message",
  "An admin deleted this message",
  "If you have any questions about the treasurer position, let me know!",
  "Another ticket sale, of course",
  "An admin deleted this message",
  "Please complete this form as soon as possible as training is required before the 30th, thanks!",
  "https://forms.gle/UdZsmtFnn1fmvEKu7",
  "Hi everyone! We have a couple of Piano Club board positions opening, starting this January. Being on the board of this club will look great on your resume and will reflect on your diverse interests. Both open positions do not require a heavy investment in time, but it is requested that you attend club meetings as much as possible. Just like the club, no experience with the piano is required to hold a board position. Here are the general responsibilities related to each board position:\n \nVice President: Manage social media, coordinate with building staff for club meetings, and prep for/attend spring involvement fair.\n \nTreasurer*: Manage club funds and apply for grants through OSU, assist with GroupMe moderation, and prep for/attend spring involvement fair.\n \n*The new treasurer will be required to complete Treasurer training online through the university in the next couple of weeks. \n\nI will be posting the application link soon/later today.",
  "An admin deleted this message",
  "If you arrive late text in here so we can let you in",
  "Reminder to come to the high street entrance where I will let you in",
  "'Club Meeting' is starting in 30 minutes",
  "An admin deleted this message",
  "'Club Meeting' is starting in 2 hours",
  "Selling a course on how to read minds, don't dm me I'll dm you.",
  "No more ticket messages please 😭",
  "Again, please no ticket sales on this GroupMe! ",
  "An admin deleted this message",
  "An admin deleted this message",
  "An admin deleted this message",
  "An admin deleted this message",
  "same",
  "An admin deleted this message",
  "Noah Friedman created event 'Club Meeting' https://group.me/5rJ3aHsmsvYegI",
  "An admin deleted this message",
  "An admin deleted this message",
  "This message was deleted",
  "An admin deleted this message",
  "An admin deleted this message",
  "selling my first begotten son to the highest bidder, dm me if interested. May be genetically likely to have a widow’s peak if you’re interested in that",
  "Mortgage is new, they're changing strategy",
  "An admin deleted this message",
  "I am selling my mortgage and also two tickets to celine dion in Las Vegas, Nevada on November 24th. The mortgage is a fixed-rate 8% 30 year loan from Citizen’s Bank. Let me know please. Thanks",
  "I didnt realize i joined ticket exchange groupme",
  "An admin deleted this message",
  "An admin deleted this message",
  "An admin deleted this message",
  "This Tuesday 6:30-8:00pm",
  "When is the next meeting?",
  "Selling penn state and Michigan State tickets dm if you’re interested \n(424) 464-3922",
  "Selling penn state and Michigan State tickets dm if you’re interested ",
  "Selling 2 Penn State tickets (210) 971-4917 message me if you’re interested in them",
  "An admin deleted this message",
  "An admin deleted this message",
  "I’m here ",
  "Message when you get here and I’ll come let you in",
  "I’m arriving late ",
  "If you are arriving late then let us know in this chat and we’ll let you in!",
  "Jack Toadvine created event 'Club Meeting' https://group.me/30uSJIQovYPjZ0",
  "Reminder for the meeting in an hour! See you there!",
  "Piano club tonight!!! 6:30-8 at the Collaboratory in Sullivant Hall!!!! Enter through the doors on N High St. ",
  "An admin deleted this message",
  "Alrighty thanks!",
  "Nope. Next week!",
  "Is there a meeting this week?",
  "Tuesdays at 6:30",
  "What are the weekly meeting times? I just saw there are meetings. ",
  "I’m selling my season tickets text me if you are interested ",
  "Reminder to let us know if you are arriving after this time so we can let you in!",
  "Come and go whenever! Since you’re coming after 6:45, just message here saying you need to be let in",
  "I get out of class at 6:50",
  "Our club (at least for the first few meetings) is going to be pretty unstructured. It’s really just a time to hang out and talk with people who enjoy the piano. There’s a grand piano in the room open for playing. We invite people all the way from beginner to super advanced to come and show off what they’ve learned or what they’re learning! ",
  "Sullivant Hall. High street entrance. ",
  "And what does a typical meeting cover??",
  "What building?",
  "Get well soon!",
  "I’m wearing a red shirt with a star on it",
  "Im currently at the doors on high street. Let me know you’re here for piano club when you come in and I’ll let you into the collaboratory space. ",
  "I wont be coming sadly. Not feeling good tonight",
  "As a general reference, since we will be checking to let people in, expect the meeting to “start” around 6:45",
  "Hey everyone, the high street doors lock at 6:00, so we have to have someone holding the doors for everyone.  ",
  "High street doors are locked currently",
  "Piano club in one hour!!",
  "An admin deleted this message",
  "This message was deleted",
  "Don’t forget! We have our biweekly meeting tomorrow 6:30-8pm at Sullivant hall! Enter via high the high street entrance. ",
  "Selling my football full season student tickets. Dm with offers at (267) 764-4177. Thanks",
  "Selling my penn state ticket dm if interested ",
  "On my way!",
  "Could you get the door?",
  "Club still happening? We are at the door",
  "15 minutes!!! The entrance to the collaboratory (Sullivant 141) is by using the entrance on N High. We will be standing at the doors to let people in. People coming in after 6:45 should DM me and I’ll let you in!",
  "'FIRST MEETING' is starting in 30 minutes",
  "'FIRST MEETING' is starting in 2 hours",
  "It’s all good! These are open and casual meetings where we’ll just be playing and hanging out",
  "is it okay if i stop by for just a half hour i have a sisterhood i have to go to too but i wanted to go the meeting for a little bit",
  "I'm stuck taking a midterm at the same time. If you are all still there after an hour, I might be able to pop in for a few!",
  "Reminder: our first piano club meeting is tonight!",
  "Nope! ",
  "Do i have to rsvp? I wont know until tomorrow if i can go",
  "I can’t go tomorrow but will be at the bext one for sure 👍",
  "Thank you so much. I’ll be sure to be at the next meeting.",
  "I don’t think we plan on having slides but I’ll make sure we get someone to put a summary up on GroupMe after the fact. ",
  "We will also be meeting next week. Club meetings will be every two weeks from then on. ",
  "I have a couple time conflicts but will slides and info be posted here after the meeting?",
  "Great to hear. Thank you.",
  "Noah Friedman updated the location for the event 'FIRST MEETING'",
  "Noah Friedman created event 'FIRST MEETING' https://group.me/4SpjOCyYfk6T4x",
  "Yes, we are! Our rescheduled first meeting is TOMORROW 6:30-8 in the Sullivant Hall  Collaboratory (Room 141). The doors will be locked but either I, @Jack Toadvine, or @Emily McCormick will be there at the door to let you in. ",
  "Are we up for this week?",
  " Selling my football season ticket for cheap dm if interested ",
  "True, gonna be a funny story in a couple of weeks",
  "No big deal! It happens.",
  "Unfortunately it seems that we are unable to get into the room so tonight’s meeting will have to be cancelled. If there are any changes within the next few minutes I will make an announcement. I will try to set up a meeting for next Tuesday to make up for today. Once again I apologize.",
  "I am working on a solution but I will keep everyone updated",
  "It is no problem! However, it seems I was not given access to the building so we might not be able to have the meeting",
  "If we miss the first meeting is that alright? ",
  "Thank you so much ",
  "Music 2216.11, don’t know much about it have just seen it recommended ",
  "Is there a course or class here at OSU for anyone who wants to learn piano?",
  "Reminder that our first meeting is tonight 6:30-8 in Sullivant Hall 141! See you there!",
  "Deja vu",
  "Selling my Maryland, PSU, MI state, Minnesota, WKU, ND, Purdue, Rutgers and Michigan tickets. Anyone who wants it should dm me or text me at 9095034640",
  "Sounds great! See you there",
  "Huge thanks. Ill definitely stop by the first 20 minutes then and at least try and meet a few people :)",
  "That’s perfectly fine! My goal for this club is to be a casual meeting place for those who enjoy piano",
  "Would it be okay to only show up for a few minutes? I have class at 7. Or should i just not bother",
  "I’ll be there for sure 👍",
  "Hey y’all! One week from today we will have our first meeting of the semester. This semester our meetings will be held in Sullivant Hall room 141. They will be every other Tuesday night starting 9/5 from 6:30-8. Make sure to check the GroupMe for any other announcements or you can follow our Instagram page @osupianoclub as well for updates. Look forward to seeing y’all next week!",
  "Timashev floors 2 thru 4",
  "Also does anyone know if there are on campus pianos that are open to practice on?",
  "Ive been playing for a few months and would love to meet more experienced people",
  "Sick. Is there a meeting set up or anything? I cant find much on the student org. Page",
  "Yes. We are active. ",
  "Hello, is this club active?",
  "Tennis Club",
  "What should we call it?",
  "Agreed",
  "we should make a club about how much we love piano",
  "we have so much in common",
  "Wait that’s crazy I also love piano",
  "lmao, me too",
  "I love piano",
  "Ok!\n",
  "not sure, you can shoot her an email though!",
  "Where is the office of Amily, I want to walk in �",
  "Available seats",
  "Hope there are seats of music 2216 now",
  "Ok, thank you so much !",
  "just your normal advisor should be able to help you but if not you can talk to emily klepinger she is a music advisor and no as long as you have some prior experience playing the piano",
  "Does music 2216 have prerequisites courses before taking?",
  "communicate with my business advisor or music advisor?",
  "it’s great lol",
  "I might also need that class ",
  "music 2216.11 you have to get permission for it but they’ll give it to you just communicate with your advisor",
  "It is hard to find in schedule planner",
  "And it’s lesson number",
  "What is the piano lesson called?",
  "you can take piano lessons for non music majors for one or two credit hours",
  "To people who are not piano major",
  "Do you have some piano courses recommendation",
  "As long as you are booking in Timashev the ones in Weigel are piano majors only ",
  "Thanks!",
  "you don’t have to be a major to book, just type in osu practice rooms and you can book one",
  "Forreal wow ",
  "Not anymore ",
  "Oh okay thanks. And where can I book the room?",
  "Wait to book don’t you have to be a music major",
  "yes whatever room is open you can use, but i would recommend booking an hour because other people can kick you out if they’ve booked the hour",
  "Without booking or bringing anything?",
  "Hi, I just joined this group and just wanted to make sure. So I can go Timashev whenever I wanna practice right? ",
  "I kinda want to try and play every piano here on campus before I graduate but I have no clue how many there are so idk how feasible it is",
  "I think I remember Patterson sounding fine but it felt bad to play\n\nLawrence tower was an upright that was really out of tune and on a cart so it was elevated\n\nThe one on the second floor of the Union is really good, but it was locked whenever I tried to play it last year (also where did the one from the basement go?)\n\nMorrison (mini grand) wasn’t bad it was just pretty quiet\n\nMorrill was just average\n\nI think Bradley had a couple bad keys but besides that wasn’t horrible, I think Taylor was a bit better than that\n\nPark Stradley is a bit out of tune",
  "it’s upright",
  "bowen also has a piano in a private room that’s pretty nice that was my favorite from last year",
  "best grand piano is in Timashev though, they also have a Boston Upright that sounds angelic",
  "Scott is pretty good as long as u don’t need F2",
  "Houston is def the best one",
  "if you want the good residence hall pianos, scott has a decent piano but it has a dead key, houston has an amazing grand piano, and Busch has a really good upright in a practice room. Those are the top 3 on north campus imo. I think nosker also had a decent upright.\n\nThe one in blackburn is horrifically out of tune- or at least it was last year.\n\nThe grand piano in Raney is pretty old and not the best.\n\nTorres has an upright but it’s pretty bad.\n\nDrackett has a really nice upright but something about it feels off when playing it, I think it’s slightly out of tune.\n\nLincoln Tower has an upright that is similar in quality to the one at Torres.\n\nCanfield has a pretty bad grand piano.\n\nMack has an upright in its basement that is older than christmas and actually hilarious to play given how bad it is.\n\nJones, I think, had a pretty bad one but I can’t remember- same with Patterson\n\nThat’s the extent of the pianos i’ve played on campus",
  "Yea well those usually suck, plus im off campus",
  "There are also pianos in a bunch of residence halls",
  "every floor and is open even the classrokms",
  "you can use any practice room in the timashev music building",
  "2nd floor timashev is open to anyone ",
  "Last i checked, you had to be a music major tho. Are any places open to other majors?",
  "4th floor (the top floor)",
  "Timashev has multiple places",
  "Are you asking for places on campus where you can practice piano?",
  "Where is the piano room? Does anyone know?�",
  "hi\n",
  "That’s a great question! Let me introduce myself: I’m Noah, the treasurer of piano club. We’re currently working with Sullivant Hall’s building management team to reserve a space for this year. We are hoping to have bi-weekly meetings in the Sullivant Hall Collaboratory on Thursday 6:30-8 (ish), but day/time is subject to change based on building availability. \n\nLast semester, we around a piano and played piano for each other. We’re planning on having themes (like Disney, classical, etc) to our meetings for this year. Additionally, we are working on setting up some sort of piano lessons for those who are new to piano and want to learn! \n\nBe on the lookout for announcements about our first meeting once the day and time is set in stone! As always, feel free to ask me, our president @Jack Toadvine, and our VP @Emily McCormick and questions you may have :)",
  "Is kinda*",
  "The Thompson series I recommended I kinda elementary schooly for the starter book but the grades 1-5 are pretty good and don’t make you feel like you’re 11. ",
  "They do!",
  "If they follow the same formula then they're great",
  "Although thinking back on it the Piano Adventures books I used were meant for young children (which was perfect for me at the time) but I think they have more books in the series for adult beginners, I just can't necessarily vouch for those because I never used them ",
  "A few other suggestions would be the Dozen a Day series which helps build finger dexterity and strength, the Theory Time Music Theory series for learning and understanding the basics behind music theory and reading sheet music, and a book of scales that help to build understanding of music theory (start after finishing Thompson Grade 1). ",
  "Each of the levels is split into I believe 4 books (Lesson, Theory, Technique, and Performance) which all serve different purposes for teaching specific parts",
  "The \"Piano Adventure\" series is what I learned for many years",
  "The Thompson series comes in grades 1-5, each progressively getting harder. ",
  "When I was first learning piano (I was in 1st grade at the time) my teacher used Faber books and I would learn using them until I decided to branch out to other resources, but the Faber books as Abigail said are good for beginners (at least in my experience)",
  "And then this book is for those who know a bit of piano but are still kinda working on the basics: https://www.amazon.com/John-Thompsons-Modern-Course-Piano/dp/0877180059/ref=asc_df_0877180059/?tag=hyprod-20&linkCode=df0&hvadid=312138007830&hvpos=&hvnetw=g&hvrand=609483747164594424&hvpone=&hvptwo=&hvqmt=&hvdev=m&hvdvcmdl=&hvlocint=&hvlocphy=9014969&hvtargid=pla-433976899666&psc=1&tag=&ref=&adgrpid=60258871097&hvpone=&hvptwo=&hvadid=312138007830&hvpos=&hvnetw=g&hvrand=609483747164594424&hvqmt=&hvdev=m&hvdvcmdl=&hvlocint=&hvlocphy=9014969&hvtargid=pla-433976899666",
  "That’s a book that’s great for people who are starting to learn piano and have absolutely no experience. ",
  "My piano teacher in middle school SWORE by this book: https://www.amazon.com/Teaching-Little-Fingers-Play-Thompsons/dp/0877180202/ref=asc_df_0877180202/?tag=hyprod-20&linkCode=df0&hvadid=312138007830&hvpos=&hvnetw=g&hvrand=609483747164594424&hvpone=&hvptwo=&hvqmt=&hvdev=m&hvdvcmdl=&hvlocint=&hvlocphy=9014969&hvtargid=pla-437052127875&psc=1&tag=&ref=&adgrpid=60258871097&hvpone=&hvptwo=&hvadid=312138007830&hvpos=&hvnetw=g&hvrand=609483747164594424&hvqmt=&hvdev=m&hvdvcmdl=&hvlocint=&hvlocphy=9014969&hvtargid=pla-437052127875",
  "Also when are meetings and what goes on there",
  "any sight reading advice/drills/books for beginners who are more slow in the head than in the hands",
  "Anything by faber is good for beginner books",
  "Get a scales and arpeggios book and learn them, helped me a lot",
  "Got it thanks",
  "Def download musescore if u have an iPad ",
  "I'm not technically \"new\" to piano but definitely out of practice so if you guys are ever getting together to practice I would be interested in that",
  "Thanks! Are there any apps or methods you'd reccomend to practice in our free time",
  "Im also willing to help ",
  "Id be willing to help someone learn! Ive been a pianist for 11 years",
  "same except instead of somewhat beginner just straight up beginner",
  "Same boat ",
  "hey new to the club, do you guys have allow help for those who are somewhat beginners at piano, and trying to get better",
  "Anyone interested in buying 2 Michigan tickets,dm with your offer at (276) 546-7455!!!",
  "Yea I love it",
  "Arent you the guy who was tabling for it last semester?",
  "Love that app",
  "Ok thanks for this ",
  "Idk if this helps but there’s some guitars being sold on FuzeMee",
  "Noteflight transcriptions arent always good tho",
  "What I like to do when I need to hear how the notes sound is go to YouTube to listen or go to noteflight and transcribe the measure that I need so that the computer can play it for me",
  "It will of course be more helpful if I can hear how you played it",
  "Thank you both. ",
  "Just think of them as kinda like a partial note. They happen right before the note they go with and are really abrupt. The way i hear it is like ba-dum. I can send you a recording of me doing that measure if youd like.",
  "It depends piece to piece because sometimes you want to linger on the note a bit longer and sometimes make it a quick texture type thing. But exploring different ways of approaching it is the best for them. But keep in mind it usually is leading to the note following the grace note and that’s the one you want to emphasize. If that helps ",
  "Any reference is also appreciated.",
  "Anyone knows how to play grace note properly, for example the grace notes in measure 25 of Beethoven's Fur Elise?",
  "��",
  "Eh I’ll figure it out",
  "lick them clean",
  "Just say your broke 🤷‍♂️ ",
  "I second this especially if it’s a Heintzman ",
  "just get a taste dude seriously it can’t be that bad the tongue’s a hard muscle fr",
  "Bro this sucks i’m praying 4 u honestly",
  "Okay so your dog just casually pooped on one of the most expensive pianos ever (literally 3+ million dollars)… sure. ",
  "If you aren’t comfortable and/or confident to do it yourself, you could hire someone to take it apart and to put it back together ",
  "😂😂😂",
  "It’s a bit of a long process but you could take the keys out and clean them all individual and then clean the piano itself where they were before, then you’d have to build it back together",
  "No it is most definitely is serious, I have a Heintzman Crystal Piano",
  "Tongue maybe",
  "Umm I’m not sure if that was a serious question but if you lmk what kind of piano it is, I may have some suggestions?",
  "Buy a new piano ",
  "mmm yummy",
  "My dog pooped all over my piano keys and now they’re sticky and won’t press properly, what’s the best way to clean them?",
  "Piano lessons?",
  "As of right now I do not believe that we do, but we will update everyone as soon as something changes!",
  "Hey! I saw the poster for this club during my orientation a couple days ago. Just out of curiosity, is there a date set for the first meeting in the autumn? ",
  "I still got my last 2 Taylor Swift tickets 🎫 .. HMU to get on (336) 496-0356",
  "Kinda relevant tho, Selling my Taylor swift tickets, lmk if anyone is interested In it. 2677025876",
  "Hi guys! I don’t know if maybe posting this here is inappropriate🤔But Please 🙏 I’m just looking to sell my last 2 Taylor Swift tickets 🎫 ..To any swiftie interested in purchasing them please HMU (336) 496-0356",
  "Still available ",
  "Hey Everyone\nI've got 2 Taylor Swift tickets for sale for her show in Cincinnati on the 30th of June\nText me if you're interested ",
  "�",
  "We’re a pretty new club so we’ve only been able to meet a handful of times but so far, we’ve really just sat around a piano and played songs for each other and listened. I know in the future we have plans to have themed nights like Disney, musicals, jazz, etc and also potentially nights where we focus around teaching piano to beginners. ",
  "ok dope, what do we usually do??",
  "Yes, we meet every other Wednesday at 7:30pm in Timashev Family Music Building. I think we may be done for the semester though. ",
  "Yeah, usually every other Wednesday in the evening. But since we’re about to go on summer break it’ll be a bit",
  "Bi-weekly Wednesdays I believe ",
  "lol does this club have meetings?",
  "I’m going to be honest I’m just using this as a form of tinder",
  "People had to leave the room Colin ",
  "Uh",
  "When we playing some piano boys. I’m ready to get freaky with them keys 🎹 ",
  "Thank you for your insight",
  "The spicy Pattie’s from Scott make you fart really bad never eat those ",
  "Selling my Taylor swifts tickets… Text if you’re interested (475) 777-1869",
  "Stuck at work tonight :(",
  "Hey guys!! We have a meeting tonight at 7:30 in the Timashev building room N300!!",
  "Does anyone have an idea where I can rent a drum kit or a room for practice? I’m really in a need of it right now..\n",
  "Cool",
  "Next week!",
  "When is the next meeting?",
  "@Noah Friedman Swing that ban hammer 😁",
  "you’re the problem it’s you",
  "Hi, is there anyone interested in Taylor swift era’s tour? I’ve got 2 tickets available for sale because my friend and I won’t be attending. HMU on (574) 328-1445",
  "This message has been deleted",
  "This message has been deleted",
  "Room N120",
  "N300 is double booked",
  "Yep. Timashev Family Music Building, room N300",
  "The building on college rd right",
  "Tonight!",
  "I've been away for too long",
  "Woah what, an actual meet up😳",
  "This message has been deleted",
  "Reminder: We have our biweekly meeting this week on Wednesday at 7:30pm in Timashev N300! For this week, please feel free to bring any music you are currently working on or that you’ve learned previously :)",
  "My roommate and I are subleasing our apartment on FuzeMee, lmk if you’re interested ",
  "This message has been deleted",
  "Ok thanks",
  "Meetings are every other Wednesday at 7:30pm",
  "Are there meetings on Wednesdays at 8?",
  "'Our first meeting!!' is starting now",
  "See you guys soon!",
  "I can’t come tonight, I just joined the club but have a lot of assignments to finish sorry",
  "Reminder: Meeting at 7:30 tonight!",
  "Noah Friedman created event 'Our first meeting!!' https://group.me/51rFbou6jpvMIS",
  "Our first meeting of the year (or ever) will be THIS WEDNESDAY at 7:30pm in Timashev Family Music Building Room N300!!!!",
  "When do we find out about when meetings are taking place ",
  "This message has been deleted",
  "It is more of a general question so we can decide how to structure the meetings, such as things you’d like to do",
  "Shouldn’t this be asking what I want to hear during the meetings?",
  "https://forms.gle/qab1iQ22yqNQt5hq8",
  "I am excited to announce that we are finally active status! As we move forward to scheduling meetings, I would like to have everyone fill out this survey to find the best times that would work for everyone. Currently we are planning on having meetings biweekly, but that is subject to change. I want to thank you all for being patient with us along the way and I can’t wait to have our first meeting to meet everyone!",
  "use more arm/wrist movement when playing instead of your fingers. it should give you natural accents",
  "Does anyone know how to accent when playing really fast?",
  "Anyone interested in buying 2 SZA tickets?\nText me 6023415251",
  "Selling 2 SZA tickets (405) 585-6163",
  "Maybe if I had time lol",
  "Our advisor has done the required trainings, so now we’re just waiting on the active status as a club. Once we get that, we can go ahead and book a meeting space!",
  "Any updates on meetings? ",
  "My friend is selling 2 SZA tickets (551) 501-9213 text if you’re interested in it ",
  "Would anyone be willing to give me piano lessons I’ve never played and am interested in learning",
  "SZA? More like scissor",
  "😮",
  "they aren't real people that's why",
  "man people must really not want to go see SZA",
  "Selling 2 SZA tickets message me if you’re interested (786) 753-9337",
  "Hey guys, this isn’t specifically piano related but I’m singing in a choir concert in the timashev family Music hall recital hall (N120) on the 19th if you’re interested in attending",
  "Selling a ticket to SZA concert.\nPlease Dm if you’re looking 7864358894",
  "I got 2 SZA tickets for sale….(424) 422-0273",
  "We are currently waiting on our advisor to complete training and then meetings will shortly follow. Thank you all for your continued patience!",
  "any word on when meetings will start?",
  "but I already know of one person whose been scammed from this groupme",
  "true, an unintended benefit ",
  "them scam artists are everywhere I tell ya",
  "Well the bots help with the activity in this chat",
  "Unfortunately it’s like this for most club groupmes ",
  "Like does anyone know how to disable a bot",
  "How do we even have so many bots 😭",
  "It’s definitely a harder sell for some people, but easier to police spam",
  "It’d also help filter out spam ",
  "I am 100% more active there, but it’s not really a thing that everyone uses.",
  "Maybe we should just make a discord ",
  "we lost one",
  "I know what impersonating is 🗿 but how are they impersonating ",
  "🤣",
  "Impersonating - the act of pretending to be (another person) as entertainment or in order to deceive someone.",
  "I’m selling 2 sza tickets in section 228 row j , lmk if you want it. 7013535287",
  "Selling 2 SZA tickets….(747) 228-3708",
  "wym impersonating?",
  "Selling 2 Noah Kahan tickets. Lmk if anyone wants it 5185094102",
  "Thank you. These bots are frustrating 😅",
  "Mohith ",
  "He’s impersonating someone on another page",
  "Bot alert ",
  "I’m selling 2 Taylor swift tickets for a good price,text me if you’re interested 3854505333",
  "I have 4 Taylor Swift tickets for sale, I won’t be able to attend the show again, so if you’re interested in buying text me on 858-367-3497",
  "Selling 2 Noah Kahan tickets. Dm with your offer 6195003503",
  "Looks like a lot of people just joined so I’ll send this again for anyone who is interested ",
  "Correct",
  "Okay so meeting isn’t determined yet ",
  "Correct. ",
  "Probably Wednesday afternoons but it’s still uncertain I think",
  "When are meetings for this club?",
  "I’m selling 2 Taylor swift tickets text me on 858-367-3497",
  "yes, probably just basic nothing too crazy",
  "1/2 getting there",
  "probably basic music reading skills as well id assume",
  "no sorry :( you have to have at least some experience",
  "So is this a class for people with no experience?",
  "no problem!",
  "ahh that’s smart thanks",
  "careful if you're already at 17/18 credit hours though, you will have to pay the per credit hour fee which is very expensive ",
  "oh perfect! thank you!",
  "doesn’t cost anything, just another class that’s 1-2 credit hours. you would pay the same rate if you are a full time student!",
  "how much would it cost?",
  "if you email maria staeblein and ask if it’s not too late to start taking lessons you may be able to! i think she’s a professor for the piano department. you’ll play a song for her as a “try out” (although if you’ve been playing for a while, she’s not going to deny you) and then she’ll give you the contact of a piano ta and you may be able to start lessons!",
  "🤖 ",
  "I’m pretty sure you just sign up when signing up for classes",
  "What’s the process to take the piano class ?",
  " I’m selling 2 SZA tickets and 2 Wisconsin tickets,text me if you’re interested \n3854505333",
  "I’m selling 2 SZA tickets and 2 Wisconsin tickets,text me if you’re interested \n3854505333",
  "It’s not letting me send any messages you can just try texting me the information if that’s okay 3038800352",
  "Anyone who's interested, just message me on here and I give you all the details",
  "Groupme isn't letting me message you individually but if send me something first maybe it'll work and I can get you some more information",
  "I’d be interested in this possibly ",
  "Hey for anyone who is interested in an opportunity to play in a pit orchestra for a musical, Off the Lake productions is a club on campus that is doing Disneys Freaky Friday this spring and I am looking for a pianist to play in the show. If you’re interested let me know and I can get you some more information ",
  "afaik the private lessons aren't for beginners ",
  "Hey guys! Just as a word of caution, this group is meant to be used so we can talk about music, piano, and anything similar. Sports are not under this umbrella (especially selling sports tickets), so anyone who attempts to sell sports tickets will be booted :)\n\nConcert tickets like SZA are fine as long as it’s not a bot doing it :)",
  "people be desperate to sell those SZA tickets",
  "I’m selling 2 SZA tickets and 2 Iowa tickets,text me if you’re interested \n3854505333",
  "yes!! i’m taking them right now and last semester and i love them! we even got to perform last semester in timashev",
  "They do! OSU offers non-majors two intro to piano classes along with private lessons with grad students or professors. I (a business major) am starting this week with a grad student after auditioning with an assistant piano professor. You can search piano on the course planner and it should show up!",
  "I know there are beginning piano classes but I’m not sure if they are offered to non music majors",
  "Yeah it’s all combined",
  "I don’t need lessons, but idk if there are any resources OSU has that we can refer people in this club to if they want to start learning piano",
  "Does anyone know if OSU offers any like beginner piano lessons?",
  "No",
  "My friend is selling 2 Wisconsin tickets dm with your offer (405) 585-6163",
  "We wait",
  "Sounds fun!",
  "Can someone explain to me what do we do in this club? I want to learn how to play piano. ",
  "Does that include all the grad/phd students?",
  "I’m selling 3 Taylor swift tickets text me on 858-367-3497",
  "oh ok sounds more reasonable lol",
  "There’s like 30 ",
  "someone told me that and i was generally taken aback cuz i know the wind studios are a lot more",
  "is it true that theres only like 6 people in the piano studio??",
  "I’m a piano major lol",
  "^",
  "I be enjoying the piano on occasion",
  "So when do we meet?",
  "really passionate about selling her ticket ",
  "I think Kendyll was just really passionate about the piano concert Sza is supposedly having",
  "it's a bot",
  "Ms girl advertised this 4 times on this chat already 🤪",
  "I’m selling 2 sza tickets in section 228 row j , lmk if you want it. 7013535287",
  "It’s recital season ",
  "Good luck getting 120",
  "ohh okay!!",
  "if there's more than 10 people coming, something like a rehearsal hall like weigel 124 or a performance hall like Timashev 120 is better",
  "room 488 is the best it has two pianos and a giant window",
  "yes i was gonna say",
  "We’re still working on that as well but we’re hoping the new Timashev Family Music Building since there are a lot of rooms with pianos there.",
  "where will the meetings be held?",
  "yes^^",
  "This is exciting",
  "We are currently working on getting that set up, however we were thinking possibly Wednesday afternoons, but all is subject to change",
  "I think at the activities fair, I was told like every other Wednesday maybe",
  "Hi, do we have an idea of possible meeting days/times ?",
  "I’m not sure, I think the main focus is just like gathering to play/listen to each other playing piano, but I’m sure you can learn a bit about how to play piano",
  "Hello, what is this club for? Does the club teach us to play piano?",
  "lol nope but I like it when people play piano for me 🥰",
  "Created new poll 'Anyone play piano??'",
  "damn thats crazy me too",
  "Me too",
  "Me too!!",
  "then sza should join piano club 🥰",
  "Slay",
  "I play piano",
  "You don’t have to play piano to be in this club :)",
  "does she play piano ",
  "probably a scam",
  "^",
  "For how much ",
  "I’m selling 2 sza tickets in section 228 row j , lmk if you want it. 7013535287",
  "I don’t see why not",
  "I’m not a student at the moment but can I come? ",
  "yes",
  "Today?",
  "Hey guys! I just wanted to reiterate that we will be at the involvement fair today from 4-7 in the union. Come visit us! I know @Jack Toadvine, @Emily McCormick, and I would love to meet y’all!",
  "Hey everyone! Want to be more involved with the music community here at Ohio State? Consider joining Kappa Kappa Psi, the national honorary band fraternity! KKPsi is coed, so anyone is eligible! We are holding recruitment events this week at 8 pm in the Steinbrenner Band Center in the stadium. Everyone is welcome, even if you don’t end up deciding to go for a bid! Please note that you must be a part of a university ensemble, either marching/athletic band, a concert band, or a jazz ensemble, to be considered eligible. Hope to see you there!",
  "Shivam I was gonna say the definition of insanity is doing something over and over again and expecting different results😂",
  "Oh haha",
  "Lol thank you Shivam. I think that because it is music related, it should be okay to sell that specific thing on here. We just want to keep this chat relating to piano and music in general (no sports)",
  "You know you’re gonna get kicked out of this GroupMe lol?",
  "I’m selling 2 sza tickets in section 228 row j , lmk if you want it. 7013535287",
  "Hey everyone! We’re going to have a booth at the Spring Involvement fair at the union on the 18th from 4-7 I believe. We’d love to see you there :)",
  "^",
  "Selling 2 Noah Kahan tickets. Dm with your offer 6195003503",
  "Yes! We are working to find a place to have meetings, so hopefully soon",
  "Hey, will we be able to meet this semester?",
  "Rip",
  "😂",
  "bruv",
  "My friend is selling 2 peach bowl tickets \n(424) 265-1758",
  "Reading is an essential skill ",
  "^",
  "Selling Purdue tickets \nText me (863) 275-0569",
  "Selling peach bowl tickets. I’m willing to transfer a ticket first before receiving payment ….(779) 800-9059",
  "Hey y’all, please no selling sports tickets on this GroupMe :)",
  "Selling  2 peach bowl tickets…(779) 800-9059",
  "I’m selling 2 sza tickets in section 228 row j , lmk if you want it. 7035926491",
  "Hello everyone,\nI apologize that I was not able to host any meetings this semester, the process got kind of out of hand and I got caught up in my classes. I want to thank you all for showing interest in this club and I hope to get it truly started up next semester. \n\n\nGood luck on finals everyone!",
  "I want to set like a goal for myself for like when I want to finish it by, but like I have no clue how long it’ll take",
  "FROM TOKYO GHOUL",
  "I’m currently learning unravel and I just like pretty much got past the “wall”, but now that I’m onto the easier part, I’m like less motivated lol",
  "If I could have everyone continue to fill this out so that you are considered a part of this club it would be great!",
  "I learned Death a while back and was looking for my next project",
  "Currently I’m on a pause from big projects (school is killing me), before then I was working on songs from “Disasters for Piano”, which you can find the pdf for online for free",
  "Just out of curiosity, what songs are you all learning (if any)?",
  "gotcha 👍👍",
  "Right now I just need to wait for the advisor to clear things",
  "lmk if I could help in some way, im a senior with decent amount of free time 😂",
  "Once I’m able to finally get the club official😅 Should be done soon though!",
  "can't wait for casual hangouts where we play & listen to each other! 😆",
  "Welcome ",
  "saw posting at nosker house piano :)",
  "hello",
  "Greetings",
  "Sup",
  "Kiss the rain is a good one^",
  "I don’t really know other yiruma songs but those could also be an option lol",
  "Or river flows in you by yiruma lmao",
  "I highly recommend Ludovico Einaudi or Yann tiersen for something simple with patterns but pretty (if you’re into contemporary classical)  ",
  "mendelssohn’s songs without words are pretty unique",
  "I wanna learn something pretty and definitely not as hard as maple leaf cuz that took me too long",
  "What type of song do you want to learn? Like what genre and difficulty?",
  "Anyone have good songs to learn??? I’m finishing up maple leaf rag and need smth new",
  "i always hear people playing that when i’m looking for practice rooms in timashev 😂",
  "I think I was probably a bit too ambitious to say that I could learn unravel in a month, but I’ll see how far I can get lol",
  "id personally do a shit ton of reps of each hand separately til it becomes muscle memory",
  "Practice it slowly and keep repeating, increasing tempo",
  "I just can’t look at both hands at the same time since there’s jumps for both hands 😂",
  "Same^",
  "i haven’t heard of any strategy for playing them but what i do is literally watch my fingers hit the notes. like make sure you’re looking at the keys during that part so that you always hit the right notes and eventually it’ll become more automatic. idk if that helps but that’s how i do it 😂",
  "Does anyone have any tips for learning to play jumps? I can kinda play jumps but not for both hands at the same time",
  "OTL is still looking for keyboard players for anyone here who is interested!",
  "If I could have everyone fill out this form so that I may begin filling in the roster, it would be greatly appreciated!",
  "https://forms.gle/VVDpCdQo96UTwRfu6",
  "Thank you for your patience",
  "I am still in the process of getting the club approved so I have not planned out meetings as of yet. I hope to have everything finished within the next week and will send more information out soon",
  "When/where will the meetings be or like when will we find that out?",
  "Thank you! If you have any questions feel free to send me an email (Sullivan.1306@osu.edu) or send me a message here",
  "If you’re interested fill out this google form: https://forms.gle/M98iW8MMTN1uqefi8\n\nInformation about auditions and signups can be found here: https://drive.google.com/drive/folders/1x3kXlrlixvIHEVDGXgm3WUSw28PSKuOA?usp=sharing",
  "Hello! My name is Aidan Sullivan and I am the Pit Director for Off the Lake’s production of Freaky Friday this spring. OTL is a student run, service based theater organization on campus that puts on a musical every year. I am currently looking for a few keyboard players to audition for the pit orchestra! The show is going to be a lot of fun and a great opportunity to do some playing and I’d love to have some of you audition. ",
  "https://forms.gle/KZD4mYGqGwBA32L6A",
  "I am resending the officer application form if some are unable to see the older messages. Also, these positions are not super responsibility heavy, as of right now",
  "Okay thanks!",
  "Yes",
  "For those who have recently joined, are you able to see the previous messages?",
  "https://forms.gle/KZD4mYGqGwBA32L6A",
  "Below is the officer application form, if you are interested please fill out ASAP!",
  "Welcome to the first OSU piano club! I apologize for slow updates, as this is my first time starting a club and there are formalities I have to get out of the way first. \n\nI will soon be posting a google form for those interested in an officer position, which as of now are the Vice President and Treasurer.\n\nRight now I plan to have casual meetings where we can sit around a piano and enjoy listening to everyone play, however I am open to suggestions so please let me know!\n\nThank you for joining and I hope to have more information out soon!"
]